raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
<?xml version="1.0" encoding="utf-8"?>
<!--
Copyright (c) 2024 Raspberry Pi Ltd.

SPDX-License-Identifier: BSD-3-Clause
-->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">    <vendor>Raspberry Pi</vendor>
    <name>RP2350</name>
    <series>RP</series>
    <version>0.1</version>
    <description>
        Dual Cortex-M33 or Hazard3 processors at 150MHz
        520kB on-chip SRAM, in 10 independent banks
        Extended low-power sleep states with optional SRAM retention: as low as 10uA DVDD
        8kB of one-time-programmable storage (OTP)
        Up to 16MB of external QSPI flash/PSRAM via dedicated QSPI bus
            Additional 16MB flash/PSRAM accessible via optional second chip-select
        On-chip switched-mode power supply to generate core voltage
            Low-quiescent-current LDO mode can be enabled for sleep states
        2x on-chip PLLs for internal or external clock generation
        GPIOs are 5V-tolerant (powered), and 3.3V-failsafe (unpowered)
        Security features:
            Optional boot signing, enforced by on-chip mask ROM, with key fingerprint in OTP
            Protected OTP storage for optional boot decryption key
            Global bus filtering based on Arm or RISC-V security/privilege levels
            Peripherals, GPIOs and DMA channels individually assignable to security domains
            Hardware mitigations for fault injection attacks
            Hardware SHA-256 accelerator
        Peripherals:
            2x UARTs
            2x SPI controllers
            2x I2C controllers
            24x PWM channels
            USB 1.1 controller and PHY, with host and device support
            12x PIO state machines
            1x HSTX peripheral
    </description>
    <width>32</width>
    <size>32</size>
    <resetMask>0xffffffff</resetMask>
    <resetValue>0x00000000</resetValue>
    <access>read-write</access>
    <licenseText>
        Copyright (c) 2024 Raspberry Pi Ltd.

        SPDX-License-Identifier: BSD-3-Clause
    </licenseText>
    <cpu>
        <name>CM33</name>
        <revision>r1p0</revision>
        <endian>little</endian>
        <mpuPresent>true</mpuPresent>
        <fpuPresent>true</fpuPresent>
        <sauNumRegions>8</sauNumRegions>
        <nvicPrioBits>4</nvicPrioBits>
        <vtorPresent>1</vtorPresent>
        <dspPresent>1</dspPresent>
        <vendorSystickConfig>false</vendorSystickConfig>
        <deviceNumInterrupts>52</deviceNumInterrupts>
    </cpu>
    <addressUnitBits>8</addressUnitBits>
    <peripherals>
    <peripheral>
        <name>ACCESSCTRL</name>
        <description>Hardware access control registers</description>
        <baseAddress>0x40060000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>236</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>LOCK</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Once a LOCK bit is written to 1, ACCESSCTRL silently ignores writes from that master. LOCK is writable only by a Secure, Privileged processor or debugger.

                    LOCK bits are only writable when their value is zero. Once set, they can never be cleared, except by a full reset of ACCESSCTRL

                    Setting the LOCK bit does not affect whether an access raises a bus error. Unprivileged writes, or writes from the DMA, will continue to raise bus errors. All other accesses will continue not to.</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>DEBUG</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FORCE_CORE_NS</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Force core 1's bus accesses to always be Non-secure, no matter the core's internal state.

                    Useful for schemes where one core is designated as the Non-secure core, since some peripherals may filter individual registers internally based on security state but not on master ID.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CORE1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CFGRESET</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Write 1 to reset all ACCESSCTRL configuration, except for the LOCK and FORCE_CORE_NS registers.

                    This bit is used in the RP2350 bootrom to quickly restore ACCESSCTRL to a known state during the boot path.

                    Note that, like all registers in ACCESSCTRL, this register is not writable when the writer's corresponding LOCK bit is set, therefore a master which has been locked out of ACCESSCTRL can not use the CFGRESET register to disturb its contents.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CFGRESET</name>
                        <bitRange>[0:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_NSMASK0</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Control whether GPIO0...31 are accessible to Non-secure code. Writable only by a Secure, Privileged processor or debugger.

                    0 -&gt; Secure access only

                    1 -&gt; Secure + Non-secure access</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_NSMASK0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_NSMASK1</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Control whether GPIO32..47 are accessible to Non-secure code, and whether QSPI and USB bitbang are accessible through the Non-secure SIO. Writable only by a Secure, Privileged processor or debugger.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ROM</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access ROM, and at what security/privilege levels they can do so.

