raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    Defaults to fully open access.

                    This register is writable only from a Secure, Privileged processor or debugger, with the exception of the NSU bit, which becomes Non-secure-Privileged-writable when the NSP bit is set.</description>
                <resetValue>0x000000ff</resetValue>
                <fields>
                    <field>
                        <name>DBG</name>
                        <description>If 1, SRAM4 can be accessed by the debugger, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <description>If 1, SRAM4 can be accessed by the DMA, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <description>If 1, SRAM4 can be accessed by core 1, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>If 1, SRAM4 can be accessed by core 0, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SP</name>
                        <description>If 1, SRAM4 can be accessed from a Secure, Privileged context.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SU</name>
                        <description>If 1, and SP is also set, SRAM4 can be accessed from a Secure, Unprivileged context.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSP</name>
                        <description>If 1, SRAM4 can be accessed from a Non-secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSU</name>
                        <description>If 1, and NSP is also set, SRAM4 can be accessed from a Non-secure, Unprivileged context.

                            This bit is writable from a Non-secure, Privileged context, if and only if the NSP bit is set.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SRAM5</name>
                <addressOffset>0x00000030</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access SRAM5, and at what security/privilege levels they can do so.

                    Defaults to fully open access.

                    This register is writable only from a Secure, Privileged processor or debugger, with the exception of the NSU bit, which becomes Non-secure-Privileged-writable when the NSP bit is set.</description>
                <resetValue>0x000000ff</resetValue>
                <fields>
                    <field>
                        <name>DBG</name>
                        <description>If 1, SRAM5 can be accessed by the debugger, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DMA</name>
                        <description>If 1, SRAM5 can be accessed by the DMA, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE1</name>
                        <description>If 1, SRAM5 can be accessed by core 1, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0</name>
                        <description>If 1, SRAM5 can be accessed by core 0, at security/privilege levels permitted by SP/NSP/SU/NSU in this register.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SP</name>
                        <description>If 1, SRAM5 can be accessed from a Secure, Privileged context.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SU</name>
                        <description>If 1, and SP is also set, SRAM5 can be accessed from a Secure, Unprivileged context.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSP</name>
                        <description>If 1, SRAM5 can be accessed from a Non-secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSU</name>
                        <description>If 1, and NSP is also set, SRAM5 can be accessed from a Non-secure, Unprivileged context.

                            This bit is writable from a Non-secure, Privileged context, if and only if the NSP bit is set.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SRAM6</name>
                <addressOffset>0x00000034</addressOffset>
                <description>Control whether debugger, DMA, core 0 and core 1 can access SRAM6, and at what security/privilege levels they can do so.

