raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>CORESIGHT_TRACE</name>
        <description>Coresight block - RP specific registers</description>
        <baseAddress>0x50700000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>8</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CTRL_STATUS</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>TRACE_CAPTURE_FIFO_OVERFLOW</name>
                        <description>This status flag is set high when trace data has been dropped due to the FIFO being full at the point trace data was sampled. Write 1 to acknowledge and clear the bit.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TRACE_CAPTURE_FIFO_FLUSH</name>
                        <description>Set to 1 to continuously hold the trace FIFO in a flushed state and prevent overflow.

                            Before clearing this flag, configure and start a DMA channel with the correct DREQ for the TRACE_CAPTURE_FIFO register.

                            Clear this flag to begin sampling trace data, and set once again once the trace capture buffer is full. You must configure the TPIU in order to generate trace packets to be captured, as well as components like the ETM further upstream to generate the event stream propagated to the TPIU.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRACE_CAPTURE_FIFO</name>
                <addressOffset>0x00000004</addressOffset>
                <description>FIFO for trace data captured from the TPIU</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RDATA</name>
                        <description>Read from an 8 x 32-bit FIFO containing trace data captured from the TPIU.

                            Hardware pushes to the FIFO on rising edges of clk_sys, when either of the following is true:

                            * TPIU TRACECTL output is low (normal trace data)

                            * TPIU TRACETCL output is high, and TPIU TRACEDATA0 and TRACEDATA1 are both low (trigger packet)

                            These conditions are in accordance with Arm Coresight Architecture Spec v3.0 section D3.3.3: Decoding requirements for Trace Capture Devices

                            The data captured into the FIFO is the full 32-bit TRACEDATA bus output by the TPIU. Note that the TPIU is a DDR output at half of clk_sys, therefore this interface can capture the full 32-bit TPIU DDR output bandwidth as it samples once per active edge of the TPIU output clock.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>DMA</name>
        <description>DMA with separate read and write masters</description>
        <baseAddress>0x50000000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>3016</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>DMA_IRQ_0</name>
            <value>10</value>
        </interrupt>
        <interrupt>
            <name>DMA_IRQ_1</name>
            <value>11</value>
        </interrupt>
        <interrupt>
            <name>DMA_IRQ_2</name>
            <value>12</value>
        </interrupt>
        <interrupt>
            <name>DMA_IRQ_3</name>
            <value>13</value>
        </interrupt>
        <registers>
            <register>
                <name>CH0_READ_ADDR</name>
                <addressOffset>0x00000000</addressOffset>
                <description>DMA Channel 0 Read Address pointer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH0_READ_ADDR</name>
                        <description>This register updates automatically each time a read completes. The current value is the next address to be read by this channel.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH0_WRITE_ADDR</name>
                <addressOffset>0x00000004</addressOffset>
                <description>DMA Channel 0 Write Address pointer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH0_WRITE_ADDR</name>
                        <description>This register updates automatically each time a write completes. The current value is the next address to be written by this channel.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH0_TRANS_COUNT</name>
                <addressOffset>0x00000008</addressOffset>
                <description>DMA Channel 0 Transfer Count</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MODE</name>
                        <description>When MODE is 0x0, the transfer count decrements with each transfer until 0, and then the channel triggers the next channel indicated by CTRL_CHAIN_TO.

                            When MODE is 0x1, the transfer count decrements with each transfer until 0, and then the channel re-triggers itself, in addition to the trigger indicated by CTRL_CHAIN_TO. This is useful for e.g. an endless ring-buffer DMA with periodic interrupts.

                            When MODE is 0xf, the transfer count does not decrement. The DMA channel performs an endless sequence of transfers, never triggering other channels or raising interrupts, until an ABORT is raised.

                            All other values are reserved.</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TRIGGER_SELF</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENDLESS</name>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COUNT</name>
                        <description>28-bit transfer count (256 million transfers maximum).

