raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Program the number of bus transfers a channel will perform before halting. Note that, if transfers are larger than one byte in size, this is not equal to the number of bytes transferred (see CTRL_DATA_SIZE).

                            When the channel is active, reading this register shows the number of transfers remaining, updating automatically each time a write transfer completes.

                            Writing this register sets the RELOAD value for the transfer counter. Each time this channel is triggered, the RELOAD value is copied into the live transfer counter. The channel can be started multiple times, and will perform the same number of transfers each time, as programmed by most recent write.

                            The RELOAD value can be observed at CHx_DBG_TCR. If TRANS_COUNT is used as a trigger, the written value is used immediately as the length of the new transfer sequence, as well as being written to RELOAD.</description>
                        <bitRange>[27:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH7_CTRL_TRIG</name>
                <addressOffset>0x000001cc</addressOffset>
                <description>DMA Channel 7 Control and Status</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>AHB_ERROR</name>
                        <description>Logical OR of the READ_ERROR and WRITE_ERROR flags. The channel halts when it encounters any bus error, and always raises its channel IRQ flag.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>READ_ERROR</name>
                        <description>If 1, the channel received a read bus error. Write one to clear. 
                            READ_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 3 transfers later)</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>WRITE_ERROR</name>
                        <description>If 1, the channel received a write bus error. Write one to clear. 
                            WRITE_ADDR shows the approximate address where the bus error was encountered (will not be earlier, or more than 5 transfers later)</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>BUSY</name>
                        <description>This flag goes high when the channel starts a new transfer sequence, and low when the last transfer of that sequence completes. Clearing EN while BUSY is high pauses the channel, and BUSY will stay high while paused.

                            To terminate a sequence early (and clear the BUSY flag), see CHAN_ABORT.</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SNIFF_EN</name>
                        <description>If 1, this channel's data transfers are visible to the sniff hardware, and each transfer will advance the state of the checksum. This only applies if the sniff hardware is enabled, and has this channel selected.

                            This allows checksum to be enabled or disabled on a per-control- block basis.</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BSWAP</name>
                        <description>Apply byte-swap transformation to DMA data. 
                            For byte data, this has no effect. For halfword data, the two bytes of each halfword are swapped. For word data, the four bytes of each word are swapped to reverse order.</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IRQ_QUIET</name>
                        <description>In QUIET mode, the channel does not generate IRQs at the end of every transfer block. Instead, an IRQ is raised when NULL is written to a trigger register, indicating the end of a control block chain.

                            This reduces the number of interrupts to be serviced by the CPU when transferring a DMA chain of many small control blocks.</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TREQ_SEL</name>
                        <description>Select a Transfer Request signal. 
                            The channel uses the transfer request signal to pace its data transfer rate. Sources for TREQ signals are internal (TIMERS) or external (DREQ, a Data Request from the system). 
                            0x0 to 0x3a -&gt; select DREQ n as TREQ</description>
                        <bitRange>[22:17]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>PIO0_TX0</name>
                                <value>0</value>
                                <description>Select PIO0's TX FIFO 0 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO0_TX1</name>
                                <value>1</value>
                                <description>Select PIO0's TX FIFO 1 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO0_TX2</name>
                                <value>2</value>
                                <description>Select PIO0's TX FIFO 2 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO0_TX3</name>
                                <value>3</value>
                                <description>Select PIO0's TX FIFO 3 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO0_RX0</name>
                                <value>4</value>
                                <description>Select PIO0's RX FIFO 0 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO0_RX1</name>
                                <value>5</value>
                                <description>Select PIO0's RX FIFO 1 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO0_RX2</name>
                                <value>6</value>
                                <description>Select PIO0's RX FIFO 2 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO0_RX3</name>
                                <value>7</value>
                                <description>Select PIO0's RX FIFO 3 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO1_TX0</name>
                                <value>8</value>
                                <description>Select PIO1's TX FIFO 0 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO1_TX1</name>
                                <value>9</value>
                                <description>Select PIO1's TX FIFO 1 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO1_TX2</name>
                                <value>10</value>
                                <description>Select PIO1's TX FIFO 2 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO1_TX3</name>
                                <value>11</value>
                                <description>Select PIO1's TX FIFO 3 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO1_RX0</name>
                                <value>12</value>
                                <description>Select PIO1's RX FIFO 0 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO1_RX1</name>
                                <value>13</value>
                                <description>Select PIO1's RX FIFO 1 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO1_RX2</name>
                                <value>14</value>
                                <description>Select PIO1's RX FIFO 2 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO1_RX3</name>
                                <value>15</value>
                                <description>Select PIO1's RX FIFO 3 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO2_TX0</name>
                                <value>16</value>
                                <description>Select PIO2's TX FIFO 0 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO2_TX1</name>
                                <value>17</value>
                                <description>Select PIO2's TX FIFO 1 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO2_TX2</name>
                                <value>18</value>
                                <description>Select PIO2's TX FIFO 2 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO2_TX3</name>
                                <value>19</value>
                                <description>Select PIO2's TX FIFO 3 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO2_RX0</name>
                                <value>20</value>
                                <description>Select PIO2's RX FIFO 0 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO2_RX1</name>
                                <value>21</value>
                                <description>Select PIO2's RX FIFO 1 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO2_RX2</name>
                                <value>22</value>
                                <description>Select PIO2's RX FIFO 2 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PIO2_RX3</name>
                                <value>23</value>
                                <description>Select PIO2's RX FIFO 3 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SPI0_TX</name>
                                <value>24</value>
                                <description>Select SPI0's TX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SPI0_RX</name>
                                <value>25</value>
                                <description>Select SPI0's RX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SPI1_TX</name>
                                <value>26</value>
                                <description>Select SPI1's TX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SPI1_RX</name>
                                <value>27</value>
                                <description>Select SPI1's RX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UART0_TX</name>
                                <value>28</value>
                                <description>Select UART0's TX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UART0_RX</name>
                                <value>29</value>
                                <description>Select UART0's RX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UART1_TX</name>
                                <value>30</value>
                                <description>Select UART1's TX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UART1_RX</name>
                                <value>31</value>
                                <description>Select UART1's RX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP0</name>
                                <value>32</value>
                                <description>Select PWM Counter 0's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP1</name>
                                <value>33</value>
                                <description>Select PWM Counter 1's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP2</name>
                                <value>34</value>
                                <description>Select PWM Counter 2's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP3</name>
                                <value>35</value>
                                <description>Select PWM Counter 3's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP4</name>
                                <value>36</value>
                                <description>Select PWM Counter 4's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP5</name>
                                <value>37</value>
                                <description>Select PWM Counter 5's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP6</name>
                                <value>38</value>
                                <description>Select PWM Counter 6's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP7</name>
                                <value>39</value>
                                <description>Select PWM Counter 7's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP8</name>
                                <value>40</value>
                                <description>Select PWM Counter 8's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP9</name>
                                <value>41</value>
                                <description>Select PWM Counter 9's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP10</name>
                                <value>42</value>
                                <description>Select PWM Counter 0's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PWM_WRAP11</name>
                                <value>43</value>
                                <description>Select PWM Counter 1's Wrap Value as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>I2C0_TX</name>
                                <value>44</value>
                                <description>Select I2C0's TX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>I2C0_RX</name>
                                <value>45</value>
                                <description>Select I2C0's RX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>I2C1_TX</name>
                                <value>46</value>
                                <description>Select I2C1's TX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>I2C1_RX</name>
                                <value>47</value>
                                <description>Select I2C1's RX FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC</name>
                                <value>48</value>
                                <description>Select the ADC as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>XIP_STREAM</name>
                                <value>49</value>
                                <description>Select the XIP Streaming FIFO as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>XIP_QMITX</name>
                                <value>50</value>
                                <description>Select XIP_QMITX as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>XIP_QMIRX</name>
                                <value>51</value>
                                <description>Select XIP_QMIRX as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HSTX</name>
                                <value>52</value>
                                <description>Select HSTX as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CORESIGHT</name>
                                <value>53</value>
                                <description>Select CORESIGHT as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SHA256</name>
                                <value>54</value>
                                <description>Select SHA256 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TIMER0</name>
                                <value>59</value>
                                <description>Select Timer 0 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TIMER1</name>
                                <value>60</value>
                                <description>Select Timer 1 as TREQ</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TIMER2</name>
                                <value>61</value>
                                <description>Select Timer 2 as TREQ (Optional)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TIMER3</name>
                                <value>62</value>
                                <description>Select Timer 3 as TREQ (Optional)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PERMANENT</name>
                                <value>63</value>
                                <description>Permanent request, for unpaced transfers.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CHAIN_TO</name>
                        <description>When this channel completes, it will trigger the channel indicated by CHAIN_TO. Disable by setting CHAIN_TO = _(this channel)_.

