raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Note this field resets to 0, so channels 1 and above will chain to channel 0 by default. Set this field to avoid this behaviour.</description>
                        <bitRange>[16:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RING_SEL</name>
                        <description>Select whether RING_SIZE applies to read or write addresses. 
                            If 0, read addresses are wrapped on a (1 &lt;&lt; RING_SIZE) boundary. If 1, write addresses are wrapped.</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RING_SIZE</name>
                        <description>Size of address wrap region. If 0, don't wrap. For values n &gt; 0, only the lower n bits of the address will change. This wraps the address on a (1 &lt;&lt; n) byte boundary, facilitating access to naturally-aligned ring buffers.

                            Ring sizes between 2 and 32768 bytes are possible. This can apply to either read or write addresses, based on value of RING_SEL.</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RING_NONE</name>
                                <value>0</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INCR_WRITE_REV</name>
                        <description>If 1, and INCR_WRITE is 1, the write address is decremented rather than incremented with each transfer.

                            If 1, and INCR_WRITE is 0, this otherwise-unused combination causes the write address to be incremented by twice the transfer size, i.e. skipping over alternate addresses.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INCR_WRITE</name>
                        <description>If 1, the write address increments with each transfer. If 0, each write is directed to the same, initial address.

                            Generally this should be disabled for memory-to-peripheral transfers.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INCR_READ_REV</name>
                        <description>If 1, and INCR_READ is 1, the read address is decremented rather than incremented with each transfer.

                            If 1, and INCR_READ is 0, this otherwise-unused combination causes the read address to be incremented by twice the transfer size, i.e. skipping over alternate addresses.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INCR_READ</name>
                        <description>If 1, the read address increments with each transfer. If 0, each read is directed to the same, initial address.

                            Generally this should be disabled for peripheral-to-memory transfers.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DATA_SIZE</name>
                        <description>Set the size of each bus transfer (byte/halfword/word). READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes) with each transfer.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SIZE_BYTE</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SIZE_HALFWORD</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SIZE_WORD</name>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HIGH_PRIORITY</name>
                        <description>HIGH_PRIORITY gives a channel preferential treatment in issue scheduling: in each scheduling round, all high priority channels are considered first, and then only a single low priority channel, before returning to the high priority channels.

                            This only affects the order in which the DMA schedules channels. The DMA's bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>DMA Channel Enable. 
                            When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high)</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL1_CTRL</name>
                <addressOffset>0x00000390</addressOffset>
                <description>Alias for channel 14 CTRL register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL1_CTRL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL1_READ_ADDR</name>
                <addressOffset>0x00000394</addressOffset>
                <description>Alias for channel 14 READ_ADDR register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL1_READ_ADDR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL1_WRITE_ADDR</name>
                <addressOffset>0x00000398</addressOffset>
                <description>Alias for channel 14 WRITE_ADDR register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL1_WRITE_ADDR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL1_TRANS_COUNT_TRIG</name>
                <addressOffset>0x0000039c</addressOffset>
                <description>Alias for channel 14 TRANS_COUNT register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL1_TRANS_COUNT_TRIG</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL2_CTRL</name>
                <addressOffset>0x000003a0</addressOffset>
                <description>Alias for channel 14 CTRL register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL2_CTRL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL2_TRANS_COUNT</name>
                <addressOffset>0x000003a4</addressOffset>
                <description>Alias for channel 14 TRANS_COUNT register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL2_TRANS_COUNT</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL2_READ_ADDR</name>
                <addressOffset>0x000003a8</addressOffset>
                <description>Alias for channel 14 READ_ADDR register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL2_READ_ADDR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL2_WRITE_ADDR_TRIG</name>
                <addressOffset>0x000003ac</addressOffset>
                <description>Alias for channel 14 WRITE_ADDR register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL2_WRITE_ADDR_TRIG</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL3_CTRL</name>
                <addressOffset>0x000003b0</addressOffset>
                <description>Alias for channel 14 CTRL register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL3_CTRL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL3_WRITE_ADDR</name>
                <addressOffset>0x000003b4</addressOffset>
                <description>Alias for channel 14 WRITE_ADDR register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL3_WRITE_ADDR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL3_TRANS_COUNT</name>
                <addressOffset>0x000003b8</addressOffset>
                <description>Alias for channel 14 TRANS_COUNT register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL3_TRANS_COUNT</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_AL3_READ_ADDR_TRIG</name>
                <addressOffset>0x000003bc</addressOffset>
                <description>Alias for channel 14 READ_ADDR register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH14_AL3_READ_ADDR_TRIG</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_READ_ADDR</name>
                <addressOffset>0x000003c0</addressOffset>
                <description>DMA Channel 15 Read Address pointer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH15_READ_ADDR</name>
                        <description>This register updates automatically each time a read completes. The current value is the next address to be read by this channel.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_WRITE_ADDR</name>
                <addressOffset>0x000003c4</addressOffset>
                <description>DMA Channel 15 Write Address pointer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH15_WRITE_ADDR</name>
                        <description>This register updates automatically each time a write completes. The current value is the next address to be written by this channel.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_TRANS_COUNT</name>
                <addressOffset>0x000003c8</addressOffset>
                <description>DMA Channel 15 Transfer Count</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MODE</name>
                        <description>When MODE is 0x0, the transfer count decrements with each transfer until 0, and then the channel triggers the next channel indicated by CTRL_CHAIN_TO.

                            When MODE is 0x1, the transfer count decrements with each transfer until 0, and then the channel re-triggers itself, in addition to the trigger indicated by CTRL_CHAIN_TO. This is useful for e.g. an endless ring-buffer DMA with periodic interrupts.

                            When MODE is 0xf, the transfer count does not decrement. The DMA channel performs an endless sequence of transfers, never triggering other channels or raising interrupts, until an ABORT is raised.

                            All other values are reserved.</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TRIGGER_SELF</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENDLESS</name>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COUNT</name>
                        <description>28-bit transfer count (256 million transfers maximum).

