raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Note this field resets to 0, so channels 1 and above will chain to channel 0 by default. Set this field to avoid this behaviour.</description>
                        <bitRange>[16:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RING_SEL</name>
                        <description>Select whether RING_SIZE applies to read or write addresses. 
                            If 0, read addresses are wrapped on a (1 &lt;&lt; RING_SIZE) boundary. If 1, write addresses are wrapped.</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RING_SIZE</name>
                        <description>Size of address wrap region. If 0, don't wrap. For values n &gt; 0, only the lower n bits of the address will change. This wraps the address on a (1 &lt;&lt; n) byte boundary, facilitating access to naturally-aligned ring buffers.

                            Ring sizes between 2 and 32768 bytes are possible. This can apply to either read or write addresses, based on value of RING_SEL.</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>RING_NONE</name>
                                <value>0</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INCR_WRITE_REV</name>
                        <description>If 1, and INCR_WRITE is 1, the write address is decremented rather than incremented with each transfer.

                            If 1, and INCR_WRITE is 0, this otherwise-unused combination causes the write address to be incremented by twice the transfer size, i.e. skipping over alternate addresses.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INCR_WRITE</name>
                        <description>If 1, the write address increments with each transfer. If 0, each write is directed to the same, initial address.

                            Generally this should be disabled for memory-to-peripheral transfers.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INCR_READ_REV</name>
                        <description>If 1, and INCR_READ is 1, the read address is decremented rather than incremented with each transfer.

                            If 1, and INCR_READ is 0, this otherwise-unused combination causes the read address to be incremented by twice the transfer size, i.e. skipping over alternate addresses.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INCR_READ</name>
                        <description>If 1, the read address increments with each transfer. If 0, each read is directed to the same, initial address.

                            Generally this should be disabled for peripheral-to-memory transfers.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DATA_SIZE</name>
                        <description>Set the size of each bus transfer (byte/halfword/word). READ_ADDR and WRITE_ADDR advance by this amount (1/2/4 bytes) with each transfer.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SIZE_BYTE</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SIZE_HALFWORD</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SIZE_WORD</name>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HIGH_PRIORITY</name>
                        <description>HIGH_PRIORITY gives a channel preferential treatment in issue scheduling: in each scheduling round, all high priority channels are considered first, and then only a single low priority channel, before returning to the high priority channels.

                            This only affects the order in which the DMA schedules channels. The DMA's bus priority is not changed. If the DMA is not saturated then a low priority channel will see no loss of throughput.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>DMA Channel Enable. 
                            When 1, the channel will respond to triggering events, which will cause it to become BUSY and start transferring data. When 0, the channel will ignore triggers, stop issuing transfers, and pause the current transfer sequence (i.e. BUSY will remain high if already high)</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL1_CTRL</name>
                <addressOffset>0x000003d0</addressOffset>
                <description>Alias for channel 15 CTRL register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL1_CTRL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL1_READ_ADDR</name>
                <addressOffset>0x000003d4</addressOffset>
                <description>Alias for channel 15 READ_ADDR register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL1_READ_ADDR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL1_WRITE_ADDR</name>
                <addressOffset>0x000003d8</addressOffset>
                <description>Alias for channel 15 WRITE_ADDR register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL1_WRITE_ADDR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL1_TRANS_COUNT_TRIG</name>
                <addressOffset>0x000003dc</addressOffset>
                <description>Alias for channel 15 TRANS_COUNT register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL1_TRANS_COUNT_TRIG</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL2_CTRL</name>
                <addressOffset>0x000003e0</addressOffset>
                <description>Alias for channel 15 CTRL register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL2_CTRL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL2_TRANS_COUNT</name>
                <addressOffset>0x000003e4</addressOffset>
                <description>Alias for channel 15 TRANS_COUNT register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL2_TRANS_COUNT</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL2_READ_ADDR</name>
                <addressOffset>0x000003e8</addressOffset>
                <description>Alias for channel 15 READ_ADDR register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL2_READ_ADDR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL2_WRITE_ADDR_TRIG</name>
                <addressOffset>0x000003ec</addressOffset>
                <description>Alias for channel 15 WRITE_ADDR register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL2_WRITE_ADDR_TRIG</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL3_CTRL</name>
                <addressOffset>0x000003f0</addressOffset>
                <description>Alias for channel 15 CTRL register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL3_CTRL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL3_WRITE_ADDR</name>
                <addressOffset>0x000003f4</addressOffset>
                <description>Alias for channel 15 WRITE_ADDR register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL3_WRITE_ADDR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL3_TRANS_COUNT</name>
                <addressOffset>0x000003f8</addressOffset>
                <description>Alias for channel 15 TRANS_COUNT register</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL3_TRANS_COUNT</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH15_AL3_READ_ADDR_TRIG</name>
                <addressOffset>0x000003fc</addressOffset>
                <description>Alias for channel 15 READ_ADDR register 
                    This is a trigger register (0xc). Writing a nonzero value will 
                    reload the channel counter and start the channel.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CH15_AL3_READ_ADDR_TRIG</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTR</name>
                <addressOffset>0x00000400</addressOffset>
                <description>Interrupt Status (raw)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTR</name>
                        <description>Raw interrupt status for DMA Channels 0..15. Bit n corresponds to channel n. Ignores any masking or forcing. Channel interrupts can be cleared by writing a bit mask to INTR or INTS0/1/2/3.

                            Channel interrupts can be routed to either of four system-level IRQs based on INTE0, INTE1, INTE2 and INTE3.

