raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Channels with a security/privilege (SECCFG_CHx) greater SECCFG_IRQ1) read as 0 in this register, and ignore writes.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTR2</name>
                <addressOffset>0x00000420</addressOffset>
                <description>Interrupt Status (raw)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTR2</name>
                        <description>Raw interrupt status for DMA Channels 0..15. Bit n corresponds to channel n. Ignores any masking or forcing. Channel interrupts can be cleared by writing a bit mask to INTR or INTS0/1/2/3.

                            Channel interrupts can be routed to either of four system-level IRQs based on INTE0, INTE1, INTE2 and INTE3.

                            The multiple system-level interrupts might be used to allow NVIC IRQ preemption for more time-critical channels, to spread IRQ load across different cores, or to target IRQs to different security domains.

                            It is also valid to ignore the multiple IRQs, and just use INTE0/INTS0/IRQ 0.

                            If this register is accessed at a security/privilege level less than that of a given channel (as defined by that channel's SECCFG_CHx register), then that channel's interrupt status will read as 0, ignore writes.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTE2</name>
                <addressOffset>0x00000424</addressOffset>
                <description>Interrupt Enables for IRQ 2</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTE2</name>
                        <description>Set bit n to pass interrupts from channel n to DMA IRQ 2.

                            Note this bit has no effect if the channel security/privilege level, defined by SECCFG_CHx, is greater than the IRQ security/privilege defined by SECCFG_IRQ2.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTF2</name>
                <addressOffset>0x00000428</addressOffset>
                <description>Force Interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTF2</name>
                        <description>Write 1s to force the corresponding bits in INTS2. The interrupt remains asserted until INTF2 is cleared.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTS2</name>
                <addressOffset>0x0000042c</addressOffset>
                <description>Interrupt Status for IRQ 2</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTS2</name>
                        <description>Indicates active channel interrupt requests which are currently causing IRQ 2 to be asserted. 
                            Channel interrupts can be cleared by writing a bit mask here.

                            Channels with a security/privilege (SECCFG_CHx) greater SECCFG_IRQ2) read as 0 in this register, and ignore writes.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTR3</name>
                <addressOffset>0x00000430</addressOffset>
                <description>Interrupt Status (raw)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTR3</name>
                        <description>Raw interrupt status for DMA Channels 0..15. Bit n corresponds to channel n. Ignores any masking or forcing. Channel interrupts can be cleared by writing a bit mask to INTR or INTS0/1/2/3.

                            Channel interrupts can be routed to either of four system-level IRQs based on INTE0, INTE1, INTE2 and INTE3.

                            The multiple system-level interrupts might be used to allow NVIC IRQ preemption for more time-critical channels, to spread IRQ load across different cores, or to target IRQs to different security domains.

                            It is also valid to ignore the multiple IRQs, and just use INTE0/INTS0/IRQ 0.

                            If this register is accessed at a security/privilege level less than that of a given channel (as defined by that channel's SECCFG_CHx register), then that channel's interrupt status will read as 0, ignore writes.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTE3</name>
                <addressOffset>0x00000434</addressOffset>
                <description>Interrupt Enables for IRQ 3</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTE3</name>
                        <description>Set bit n to pass interrupts from channel n to DMA IRQ 3.

                            Note this bit has no effect if the channel security/privilege level, defined by SECCFG_CHx, is greater than the IRQ security/privilege defined by SECCFG_IRQ3.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTF3</name>
                <addressOffset>0x00000438</addressOffset>
                <description>Force Interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTF3</name>
                        <description>Write 1s to force the corresponding bits in INTS3. The interrupt remains asserted until INTF3 is cleared.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTS3</name>
                <addressOffset>0x0000043c</addressOffset>
                <description>Interrupt Status for IRQ 3</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTS3</name>
                        <description>Indicates active channel interrupt requests which are currently causing IRQ 3 to be asserted. 
                            Channel interrupts can be cleared by writing a bit mask here.

