raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Once its LOCK bit is set, this register becomes read-only.

                            A failed write, for example due to the write's privilege being lower than that specified in the channel's SECCFG register, will not set the LOCK bit.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>S</name>
                        <description>Secure channel. If 1, this channel performs Secure bus accesses. If 0, it performs Non-secure bus accesses.

                            If 1, this channel is controllable only from a Secure context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P</name>
                        <description>Privileged channel. If 1, this channel performs Privileged bus accesses. If 0, it performs Unprivileged bus accesses.

                            If 1, this channel is controllable only from a Privileged context of the same Secure/Non-secure level, or any context of a higher Secure/Non-secure level.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SECCFG_IRQ0</name>
                <addressOffset>0x000004c0</addressOffset>
                <description>Security configuration for IRQ 0. Control whether the IRQ permits configuration by Non-secure/Unprivileged contexts, and whether it can observe Secure/Privileged channel interrupt flags.</description>
                <resetValue>0x00000003</resetValue>
                <fields>
                    <field>
                        <name>S</name>
                        <description>Secure IRQ. If 1, this IRQ's control registers can only be accessed from a Secure context.

                            If 0, this IRQ's control registers can be accessed from a Non-secure context, but Secure channels (as per SECCFG_CHx) are masked from the IRQ status, and this IRQ's registers can not be used to acknowledge the channel interrupts of Secure channels.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P</name>
                        <description>Privileged IRQ. If 1, this IRQ's control registers can only be accessed from a Privileged context.

                            If 0, this IRQ's control registers can be accessed from an Unprivileged context, but Privileged channels (as per SECCFG_CHx) are masked from the IRQ status, and this IRQ's registers can not be used to acknowledge the channel interrupts of Privileged channels.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SECCFG_IRQ1</name>
                <addressOffset>0x000004c4</addressOffset>
                <description>Security configuration for IRQ 1. Control whether the IRQ permits configuration by Non-secure/Unprivileged contexts, and whether it can observe Secure/Privileged channel interrupt flags.</description>
                <resetValue>0x00000003</resetValue>
                <fields>
                    <field>
                        <name>S</name>
                        <description>Secure IRQ. If 1, this IRQ's control registers can only be accessed from a Secure context.

                            If 0, this IRQ's control registers can be accessed from a Non-secure context, but Secure channels (as per SECCFG_CHx) are masked from the IRQ status, and this IRQ's registers can not be used to acknowledge the channel interrupts of Secure channels.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P</name>
                        <description>Privileged IRQ. If 1, this IRQ's control registers can only be accessed from a Privileged context.

                            If 0, this IRQ's control registers can be accessed from an Unprivileged context, but Privileged channels (as per SECCFG_CHx) are masked from the IRQ status, and this IRQ's registers can not be used to acknowledge the channel interrupts of Privileged channels.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SECCFG_IRQ2</name>
                <addressOffset>0x000004c8</addressOffset>
                <description>Security configuration for IRQ 2. Control whether the IRQ permits configuration by Non-secure/Unprivileged contexts, and whether it can observe Secure/Privileged channel interrupt flags.</description>
                <resetValue>0x00000003</resetValue>
                <fields>
                    <field>
                        <name>S</name>
                        <description>Secure IRQ. If 1, this IRQ's control registers can only be accessed from a Secure context.

                            If 0, this IRQ's control registers can be accessed from a Non-secure context, but Secure channels (as per SECCFG_CHx) are masked from the IRQ status, and this IRQ's registers can not be used to acknowledge the channel interrupts of Secure channels.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P</name>
                        <description>Privileged IRQ. If 1, this IRQ's control registers can only be accessed from a Privileged context.

