raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>MPU_BAR7</name>
                <addressOffset>0x0000053c</addressOffset>
                <description>Base address register for MPU region 7. Writable only from a Secure, Privileged context.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>This MPU region matches addresses where addr[31:5] (the 27 most significant bits) are greater than or equal to BAR_ADDR, and less than or equal to LAR_ADDR.

                            Readable from any Privileged context, if and only if this region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a Secure, Privileged context.</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_LAR7</name>
                <addressOffset>0x00000540</addressOffset>
                <description>Limit address register for MPU region 7. Writable only from a Secure, Privileged context, with the exception of the P bit.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDR</name>
                        <description>Limit address bits 31:5. Readable from any Privileged context, if and only if this region's S bit is clear, and MPU_CTRL_NS_HIDE_ADDR is clear. Otherwise readable only from a Secure, Privileged context.</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>S</name>
                        <description>Determines the Secure/Non-secure (=1/0) status of addresses matching this region, if this region is enabled.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>P</name>
                        <description>Determines the Privileged/Unprivileged (=1/0) status of addresses matching this region, if this region is enabled. Writable from any Privileged context, if and only if the S bit is clear. Otherwise, writable only from a Secure, Privileged context.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Region enable. If 1, any address within range specified by the base address (BAR_ADDR) and limit address (LAR_ADDR) has the attributes specified by S and P.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH0_DBG_CTDREQ</name>
                <addressOffset>0x00000800</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH0_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH0_DBG_TCR</name>
                <addressOffset>0x00000804</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH0_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH1_DBG_CTDREQ</name>
                <addressOffset>0x00000840</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH1_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH1_DBG_TCR</name>
                <addressOffset>0x00000844</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH1_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH2_DBG_CTDREQ</name>
                <addressOffset>0x00000880</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH2_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH2_DBG_TCR</name>
                <addressOffset>0x00000884</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH2_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH3_DBG_CTDREQ</name>
                <addressOffset>0x000008c0</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH3_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH3_DBG_TCR</name>
                <addressOffset>0x000008c4</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH3_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH4_DBG_CTDREQ</name>
                <addressOffset>0x00000900</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH4_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH4_DBG_TCR</name>
                <addressOffset>0x00000904</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH4_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH5_DBG_CTDREQ</name>
                <addressOffset>0x00000940</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH5_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH5_DBG_TCR</name>
                <addressOffset>0x00000944</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH5_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH6_DBG_CTDREQ</name>
                <addressOffset>0x00000980</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH6_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH6_DBG_TCR</name>
                <addressOffset>0x00000984</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH6_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH7_DBG_CTDREQ</name>
                <addressOffset>0x000009c0</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH7_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH7_DBG_TCR</name>
                <addressOffset>0x000009c4</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH7_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH8_DBG_CTDREQ</name>
                <addressOffset>0x00000a00</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH8_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH8_DBG_TCR</name>
                <addressOffset>0x00000a04</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH8_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH9_DBG_CTDREQ</name>
                <addressOffset>0x00000a40</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH9_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH9_DBG_TCR</name>
                <addressOffset>0x00000a44</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH9_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH10_DBG_CTDREQ</name>
                <addressOffset>0x00000a80</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH10_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH10_DBG_TCR</name>
                <addressOffset>0x00000a84</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH10_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH11_DBG_CTDREQ</name>
                <addressOffset>0x00000ac0</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH11_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH11_DBG_TCR</name>
                <addressOffset>0x00000ac4</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH11_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH12_DBG_CTDREQ</name>
                <addressOffset>0x00000b00</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH12_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH12_DBG_TCR</name>
                <addressOffset>0x00000b04</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH12_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH13_DBG_CTDREQ</name>
                <addressOffset>0x00000b40</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH13_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH13_DBG_TCR</name>
                <addressOffset>0x00000b44</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH13_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_DBG_CTDREQ</name>
                <addressOffset>0x00000b80</addressOffset>
                <description>Read: get channel DREQ counter (i.e. how many accesses the DMA expects it can perform on the peripheral without overflow/underflow. Write any value: clears the counter, and cause channel to re-initiate DREQ handshake.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH14_DBG_CTDREQ</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH14_DBG_TCR</name>
                <addressOffset>0x00000b84</addressOffset>
                <description>Read to get channel TRANS_COUNT reload value, i.e. the length of the next transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH14_DBG_TCR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
