raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Once the HSTX is enabled again, and data is pushed to the FIFO, the generated clock's first rising edge will be one half-period after the first data is launched.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BIT0</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Data control register for output bit 0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK</name>
                        <description>Connect this output to the generated clock, rather than the data shift register. SEL_P and SEL_N are ignored if this bit is set, but INV can still be set to generate an antiphase clock.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Invert this data output (logical NOT)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_N</name>
                        <description>Shift register data bit select for the second half of the HSTX clock cycle</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_P</name>
                        <description>Shift register data bit select for the first half of the HSTX clock cycle</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BIT1</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Data control register for output bit 1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK</name>
                        <description>Connect this output to the generated clock, rather than the data shift register. SEL_P and SEL_N are ignored if this bit is set, but INV can still be set to generate an antiphase clock.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Invert this data output (logical NOT)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_N</name>
                        <description>Shift register data bit select for the second half of the HSTX clock cycle</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_P</name>
                        <description>Shift register data bit select for the first half of the HSTX clock cycle</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BIT2</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Data control register for output bit 2</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK</name>
                        <description>Connect this output to the generated clock, rather than the data shift register. SEL_P and SEL_N are ignored if this bit is set, but INV can still be set to generate an antiphase clock.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Invert this data output (logical NOT)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_N</name>
                        <description>Shift register data bit select for the second half of the HSTX clock cycle</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_P</name>
                        <description>Shift register data bit select for the first half of the HSTX clock cycle</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BIT3</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Data control register for output bit 3</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK</name>
                        <description>Connect this output to the generated clock, rather than the data shift register. SEL_P and SEL_N are ignored if this bit is set, but INV can still be set to generate an antiphase clock.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Invert this data output (logical NOT)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_N</name>
                        <description>Shift register data bit select for the second half of the HSTX clock cycle</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_P</name>
                        <description>Shift register data bit select for the first half of the HSTX clock cycle</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BIT4</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Data control register for output bit 4</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK</name>
                        <description>Connect this output to the generated clock, rather than the data shift register. SEL_P and SEL_N are ignored if this bit is set, but INV can still be set to generate an antiphase clock.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Invert this data output (logical NOT)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_N</name>
                        <description>Shift register data bit select for the second half of the HSTX clock cycle</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_P</name>
                        <description>Shift register data bit select for the first half of the HSTX clock cycle</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BIT5</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Data control register for output bit 5</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK</name>
                        <description>Connect this output to the generated clock, rather than the data shift register. SEL_P and SEL_N are ignored if this bit is set, but INV can still be set to generate an antiphase clock.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Invert this data output (logical NOT)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_N</name>
                        <description>Shift register data bit select for the second half of the HSTX clock cycle</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_P</name>
                        <description>Shift register data bit select for the first half of the HSTX clock cycle</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BIT6</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Data control register for output bit 6</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK</name>
                        <description>Connect this output to the generated clock, rather than the data shift register. SEL_P and SEL_N are ignored if this bit is set, but INV can still be set to generate an antiphase clock.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Invert this data output (logical NOT)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_N</name>
                        <description>Shift register data bit select for the second half of the HSTX clock cycle</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_P</name>
                        <description>Shift register data bit select for the first half of the HSTX clock cycle</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BIT7</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Data control register for output bit 7</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLK</name>
                        <description>Connect this output to the generated clock, rather than the data shift register. SEL_P and SEL_N are ignored if this bit is set, but INV can still be set to generate an antiphase clock.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Invert this data output (logical NOT)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_N</name>
                        <description>Shift register data bit select for the second half of the HSTX clock cycle</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SEL_P</name>
                        <description>Shift register data bit select for the first half of the HSTX clock cycle</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXPAND_SHIFT</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Configure the optional shifter inside the command expander</description>
                <resetValue>0x01000100</resetValue>
                <fields>
                    <field>
                        <name>ENC_N_SHIFTS</name>
                        <description>Number of times to consume from the shift register before refilling it from the FIFO, when the current command is an encoded data command (e.g. TMDS). A register value of 0 means shift 32 times.</description>
                        <bitRange>[28:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENC_SHIFT</name>
                        <description>How many bits to right-rotate the shift register by each time data is pushed to the output shifter, when the current command is an encoded data command (e.g. TMDS).</description>
                        <bitRange>[20:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RAW_N_SHIFTS</name>
                        <description>Number of times to consume from the shift register before refilling it from the FIFO, when the current command is a raw data command. A register value of 0 means shift 32 times.</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RAW_SHIFT</name>
                        <description>How many bits to right-rotate the shift register by each time data is pushed to the output shifter, when the current command is a raw data command.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EXPAND_TMDS</name>
                <addressOffset>0x00000028</addressOffset>
                <description>Configure the optional TMDS encoder inside the command expander</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>L2_NBITS</name>
                        <description>Number of valid data bits for the lane 2 TMDS encoder, starting from bit 7 of the rotated data. Field values of 0 -&gt; 7 encode counts of 1 -&gt; 8 bits.</description>
                        <bitRange>[23:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L2_ROT</name>
                        <description>Right-rotate applied to the current shifter data before the lane 2 TMDS encoder.</description>
                        <bitRange>[20:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L1_NBITS</name>
                        <description>Number of valid data bits for the lane 1 TMDS encoder, starting from bit 7 of the rotated data. Field values of 0 -&gt; 7 encode counts of 1 -&gt; 8 bits.</description>
                        <bitRange>[15:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L1_ROT</name>
                        <description>Right-rotate applied to the current shifter data before the lane 1 TMDS encoder.</description>
                        <bitRange>[12:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L0_NBITS</name>
                        <description>Number of valid data bits for the lane 0 TMDS encoder, starting from bit 7 of the rotated data. Field values of 0 -&gt; 7 encode counts of 1 -&gt; 8 bits.</description>
                        <bitRange>[7:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>L0_ROT</name>
                        <description>Right-rotate applied to the current shifter data before the lane 0 TMDS encoder.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
