raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Reset value: 0x0</description>
                        <bitRange>[8:8]</bitRange>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>WRITE</name>
                                <value>0</value>
                                <description>Master Write Command</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>READ</name>
                                <value>1</value>
                                <description>Master Read Command</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DAT</name>
                        <description>This register contains the data to be transmitted or received on the I2C bus. If you are writing to this register and want to perform a read, bits 7:0 (DAT) are ignored by the DW_apb_i2c. However, when you read this register, these bits return the value of data received on the DW_apb_i2c interface.

                            Reset value: 0x0</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_SS_SCL_HCNT</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Standard Speed I2C Clock SCL High Count Register</description>
                <resetValue>0x00000028</resetValue>
                <fields>
                    <field>
                        <name>IC_SS_SCL_HCNT</name>
                        <description>This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock high-period count for standard speed. For more information, refer to 'IC_CLK Frequency Configuration'.

                            This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.

                            The minimum valid value is 6; hardware prevents values less than this being written, and if attempted results in 6 being set. For designs with APB_DATA_WIDTH = 8, the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed.

                            NOTE: This register must not be programmed to a value higher than 65525, because DW_apb_i2c uses a 16-bit counter to flag an I2C bus idle condition when this counter reaches a value of IC_SS_SCL_HCNT + 10.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_SS_SCL_LCNT</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Standard Speed I2C Clock SCL Low Count Register</description>
                <resetValue>0x0000002f</resetValue>
                <fields>
                    <field>
                        <name>IC_SS_SCL_LCNT</name>
                        <description>This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock low period count for standard speed. For more information, refer to 'IC_CLK Frequency Configuration'

                            This register can be written only when the I2C interface is disabled which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.

                            The minimum valid value is 8; hardware prevents values less than this being written, and if attempted, results in 8 being set. For designs with APB_DATA_WIDTH = 8, the order of programming is important to ensure the correct operation of DW_apb_i2c. The lower byte must be programmed first, and then the upper byte is programmed.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_FS_SCL_HCNT</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Fast Mode or Fast Mode Plus I2C Clock SCL High Count Register</description>
                <resetValue>0x00000006</resetValue>
                <fields>
                    <field>
                        <name>IC_FS_SCL_HCNT</name>
                        <description>This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock high-period count for fast mode or fast mode plus. It is used in high-speed mode to send the Master Code and START BYTE or General CALL. For more information, refer to 'IC_CLK Frequency Configuration'.

                            This register goes away and becomes read-only returning 0s if IC_MAX_SPEED_MODE = standard. This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.

                            The minimum valid value is 6; hardware prevents values less than this being written, and if attempted results in 6 being set. For designs with APB_DATA_WIDTH == 8 the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_FS_SCL_LCNT</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Fast Mode or Fast Mode Plus I2C Clock SCL Low Count Register</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>IC_FS_SCL_LCNT</name>
                        <description>This register must be set before any I2C bus transaction can take place to ensure proper I/O timing. This register sets the SCL clock low period count for fast speed. It is used in high-speed mode to send the Master Code and START BYTE or General CALL. For more information, refer to 'IC_CLK Frequency Configuration'.

                            This register goes away and becomes read-only returning 0s if IC_MAX_SPEED_MODE = standard.

                            This register can be written only when the I2C interface is disabled, which corresponds to the IC_ENABLE[0] register being set to 0. Writes at other times have no effect.

