raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            The minimum valid value is 8; hardware prevents values less than this being written, and if attempted results in 8 being set. For designs with APB_DATA_WIDTH = 8 the order of programming is important to ensure the correct operation of the DW_apb_i2c. The lower byte must be programmed first. Then the upper byte is programmed. If the value is less than 8 then the count value gets changed to 8.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_INTR_STAT</name>
                <addressOffset>0x0000002c</addressOffset>
                <description>I2C Interrupt Status Register

                    Each bit in this register has a corresponding mask bit in the IC_INTR_MASK register. These bits are cleared by reading the matching interrupt clear register. The unmasked raw versions of these bits are available in the IC_RAW_INTR_STAT register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>R_RESTART_DET</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_RESTART_DET bit.

                            Reset value: 0x0</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_RESTART_DET interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_RESTART_DET interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_GEN_CALL</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_GEN_CALL bit.

                            Reset value: 0x0</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_GEN_CALL interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_GEN_CALL interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_START_DET</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_START_DET bit.

                            Reset value: 0x0</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_START_DET interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_START_DET interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_STOP_DET</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_STOP_DET bit.

                            Reset value: 0x0</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_STOP_DET interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_STOP_DET interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_ACTIVITY</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_ACTIVITY bit.

                            Reset value: 0x0</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_ACTIVITY interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_ACTIVITY interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_RX_DONE</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_DONE bit.

