raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Reset value: 0x0</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_RX_DONE interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_RX_DONE interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_TX_ABRT</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_ABRT bit.

                            Reset value: 0x0</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_TX_ABRT interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_TX_ABRT interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_RD_REQ</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_RD_REQ bit.

                            Reset value: 0x0</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_RD_REQ interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_RD_REQ interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_TX_EMPTY</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_EMPTY bit.

                            Reset value: 0x0</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_TX_EMPTY interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_TX_EMPTY interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_TX_OVER</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_TX_OVER bit.

                            Reset value: 0x0</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_TX_OVER interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_TX_OVER interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_RX_FULL</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_FULL bit.

                            Reset value: 0x0</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>R_RX_FULL interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>R_RX_FULL interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>R_RX_OVER</name>
                        <description>See IC_RAW_INTR_STAT for a detailed description of R_RX_OVER bit.

