raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Reset value: 0x0</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>RX_OVER interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>RX_OVER interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RX_UNDER</name>
                        <description>Set if the processor attempts to read the receive buffer when it is empty by reading from the IC_DATA_CMD register. If the module is disabled (IC_ENABLE[0]=0), this bit keeps its level until the master or slave state machines go into idle, and when ic_en goes to 0, this interrupt is cleared.

                            Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INACTIVE</name>
                                <value>0</value>
                                <description>RX_UNDER interrupt is inactive</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ACTIVE</name>
                                <value>1</value>
                                <description>RX_UNDER interrupt is active</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_RX_TL</name>
                <addressOffset>0x00000038</addressOffset>
                <description>I2C Receive FIFO Threshold Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RX_TL</name>
                        <description>Receive FIFO Threshold Level.

                            Controls the level of entries (or above) that triggers the RX_FULL interrupt (bit 2 in IC_RAW_INTR_STAT register). The valid range is 0-255, with the additional restriction that hardware does not allow this value to be set to a value larger than the depth of the buffer. If an attempt is made to do that, the actual value set will be the maximum depth of the buffer. A value of 0 sets the threshold for 1 entry, and a value of 255 sets the threshold for 256 entries.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_TX_TL</name>
                <addressOffset>0x0000003c</addressOffset>
                <description>I2C Transmit FIFO Threshold Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TX_TL</name>
                        <description>Transmit FIFO Threshold Level.

                            Controls the level of entries (or below) that trigger the TX_EMPTY interrupt (bit 4 in IC_RAW_INTR_STAT register). The valid range is 0-255, with the additional restriction that it may not be set to value larger than the depth of the buffer. If an attempt is made to do that, the actual value set will be the maximum depth of the buffer. A value of 0 sets the threshold for 0 entries, and a value of 255 sets the threshold for 255 entries.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_CLR_INTR</name>
                <addressOffset>0x00000040</addressOffset>
                <description>Clear Combined and Individual Interrupt Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLR_INTR</name>
                        <description>Read this register to clear the combined interrupt, all individual interrupts, and the IC_TX_ABRT_SOURCE register. This bit does not clear hardware clearable interrupts but software clearable interrupts. Refer to Bit 9 of the IC_TX_ABRT_SOURCE register for an exception to clearing IC_TX_ABRT_SOURCE.

                            Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_CLR_RX_UNDER</name>
                <addressOffset>0x00000044</addressOffset>
                <description>Clear RX_UNDER Interrupt Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLR_RX_UNDER</name>
                        <description>Read this register to clear the RX_UNDER interrupt (bit 0) of the IC_RAW_INTR_STAT register.

                            Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_CLR_RX_OVER</name>
                <addressOffset>0x00000048</addressOffset>
                <description>Clear RX_OVER Interrupt Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLR_RX_OVER</name>
                        <description>Read this register to clear the RX_OVER interrupt (bit 1) of the IC_RAW_INTR_STAT register.

