raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    The register is used to generate a NACK for the data part of a transfer when DW_apb_i2c is acting as a slave-receiver. This register only exists when the IC_SLV_DATA_NACK_ONLY parameter is set to 1. When this parameter disabled, this register does not exist and writing to the register's address has no effect.

                    A write can occur on this register if both of the following conditions are met: - DW_apb_i2c is disabled (IC_ENABLE[0] = 0) - Slave part is inactive (IC_STATUS[6] = 0) Note: The IC_STATUS[6] is a register read-back location for the internal slv_activity signal; the user should poll this before writing the ic_slv_data_nack_only bit.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NACK</name>
                        <description>Generate NACK. This NACK generation only occurs when DW_apb_i2c is a slave-receiver. If this register is set to a value of 1, it can only generate a NACK after a data byte is received; hence, the data transfer is aborted and the data received is not pushed to the receive buffer.

                            When the register is set to a value of 0, it generates NACK/ACK, depending on normal criteria. - 1: generate NACK after data byte received - 0: generate NACK/ACK normally Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>Slave receiver generates NACK normally</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Slave receiver generates NACK upon data reception only</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_DMA_CR</name>
                <addressOffset>0x00000088</addressOffset>
                <description>DMA Control Register

                    The register is used to enable the DMA Controller interface operation. There is a separate bit for transmit and receive. This can be programmed regardless of the state of IC_ENABLE.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TDMAE</name>
                        <description>Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel. Reset value: 0x0</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>transmit FIFO DMA channel disabled</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Transmit FIFO DMA channel enabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>RDMAE</name>
                        <description>Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. Reset value: 0x0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>DISABLED</name>
                                <value>0</value>
                                <description>Receive FIFO DMA channel disabled</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLED</name>
                                <value>1</value>
                                <description>Receive FIFO DMA channel enabled</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_DMA_TDLR</name>
                <addressOffset>0x0000008c</addressOffset>
                <description>DMA Transmit Data Level Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DMATDL</name>
                        <description>Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1.

                            Reset value: 0x0</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IC_DMA_RDLR</name>
                <addressOffset>0x00000090</addressOffset>
                <description>I2C Receive Data Level Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DMARDL</name>
                        <description>Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or more than this field value + 1, and RDMAE =1. For instance, when DMARDL is 0, then dma_rx_req is asserted when 1 or more data entries are present in the receive FIFO.

