raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>GPIO40_CTRL</name>
                <addressOffset>0x00000144</addressOffset>
                <resetValue>0x0000001f</resetValue>
                <fields>
                    <field>
                        <name>IRQOVER</name>
                        <bitRange>[29:28]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>don't invert the interrupt</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>invert the interrupt</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>2</value>
                                <description>drive interrupt low</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>drive interrupt high</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INOVER</name>
                        <bitRange>[17:16]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>don't invert the peri input</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>invert the peri input</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>2</value>
                                <description>drive peri input low</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>drive peri input high</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OEOVER</name>
                        <bitRange>[15:14]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>drive output enable from peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLE</name>
                                <value>2</value>
                                <description>disable output</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLE</name>
                                <value>3</value>
                                <description>enable output</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OUTOVER</name>
                        <bitRange>[13:12]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>drive output from peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>drive output from inverse of peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>2</value>
                                <description>drive output low</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>drive output high</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FUNCSEL</name>
                        <description>0-31 -&gt; selects pin function according to the gpio table 
                            31 == NULL</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>spi1_rx</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>uart1_tx</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>i2c0_sda</name>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>pwm_a_8</name>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>siob_proc_40</name>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>pio0_40</name>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>pio1_40</name>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>pio2_40</name>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>usb_muxing_vbus_detect</name>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>null</name>
                                <value>31</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO41_STATUS</name>
                <addressOffset>0x00000148</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IRQTOPROC</name>
                        <description>interrupt to processors, after override is applied</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>INFROMPAD</name>
                        <description>input signal from pad, before filtering and override are applied</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OETOPAD</name>
                        <description>output enable to pad after register override is applied</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OUTTOPAD</name>
                        <description>output signal to pad after register override is applied</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO41_CTRL</name>
                <addressOffset>0x0000014c</addressOffset>
                <resetValue>0x0000001f</resetValue>
                <fields>
                    <field>
                        <name>IRQOVER</name>
                        <bitRange>[29:28]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>don't invert the interrupt</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>invert the interrupt</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>2</value>
                                <description>drive interrupt low</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>drive interrupt high</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INOVER</name>
                        <bitRange>[17:16]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>don't invert the peri input</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>invert the peri input</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>2</value>
                                <description>drive peri input low</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>drive peri input high</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OEOVER</name>
                        <bitRange>[15:14]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>drive output enable from peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>drive output enable from inverse of peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DISABLE</name>
                                <value>2</value>
                                <description>disable output</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ENABLE</name>
                                <value>3</value>
                                <description>enable output</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OUTOVER</name>
                        <bitRange>[13:12]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NORMAL</name>
                                <value>0</value>
                                <description>drive output from peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INVERT</name>
                                <value>1</value>
                                <description>drive output from inverse of peripheral signal selected by funcsel</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LOW</name>
                                <value>2</value>
                                <description>drive output low</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HIGH</name>
                                <value>3</value>
                                <description>drive output high</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FUNCSEL</name>
                        <description>0-31 -&gt; selects pin function according to the gpio table 
                            31 == NULL</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>spi1_ss_n</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>uart1_rx</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>i2c0_scl</name>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>pwm_b_8</name>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>siob_proc_41</name>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>pio0_41</name>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>pio1_41</name>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>pio2_41</name>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>usb_muxing_vbus_en</name>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>null</name>
                                <value>31</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO42_STATUS</name>
                <addressOffset>0x00000150</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IRQTOPROC</name>
                        <description>interrupt to processors, after override is applied</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>INFROMPAD</name>
                        <description>input signal from pad, before filtering and override are applied</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OETOPAD</name>
                        <description>output enable to pad after register override is applied</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OUTTOPAD</name>
                        <description>output signal to pad after register override is applied</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
