raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>PROC1_INTF3</name>
                <addressOffset>0x000002b4</addressOffset>
                <description>Interrupt Force for proc1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO31_EDGE_HIGH</name>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO31_EDGE_LOW</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO31_LEVEL_HIGH</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO31_LEVEL_LOW</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO30_EDGE_HIGH</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO30_EDGE_LOW</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO30_LEVEL_HIGH</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO30_LEVEL_LOW</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO29_EDGE_HIGH</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO29_EDGE_LOW</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO29_LEVEL_HIGH</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO29_LEVEL_LOW</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO28_EDGE_HIGH</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO28_EDGE_LOW</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO28_LEVEL_HIGH</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO28_LEVEL_LOW</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO27_EDGE_HIGH</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO27_EDGE_LOW</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO27_LEVEL_HIGH</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO27_LEVEL_LOW</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO26_EDGE_HIGH</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO26_EDGE_LOW</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO26_LEVEL_HIGH</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO26_LEVEL_LOW</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO25_EDGE_HIGH</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO25_EDGE_LOW</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO25_LEVEL_HIGH</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO25_LEVEL_LOW</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO24_EDGE_HIGH</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO24_EDGE_LOW</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO24_LEVEL_HIGH</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO24_LEVEL_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC1_INTF4</name>
                <addressOffset>0x000002b8</addressOffset>
                <description>Interrupt Force for proc1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO39_EDGE_HIGH</name>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO39_EDGE_LOW</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO39_LEVEL_HIGH</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO39_LEVEL_LOW</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO38_EDGE_HIGH</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO38_EDGE_LOW</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO38_LEVEL_HIGH</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO38_LEVEL_LOW</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO37_EDGE_HIGH</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO37_EDGE_LOW</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO37_LEVEL_HIGH</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO37_LEVEL_LOW</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO36_EDGE_HIGH</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO36_EDGE_LOW</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO36_LEVEL_HIGH</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO36_LEVEL_LOW</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO35_EDGE_HIGH</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO35_EDGE_LOW</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO35_LEVEL_HIGH</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO35_LEVEL_LOW</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO34_EDGE_HIGH</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO34_EDGE_LOW</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO34_LEVEL_HIGH</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO34_LEVEL_LOW</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO33_EDGE_HIGH</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO33_EDGE_LOW</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO33_LEVEL_HIGH</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO33_LEVEL_LOW</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO32_EDGE_HIGH</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO32_EDGE_LOW</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO32_LEVEL_HIGH</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO32_LEVEL_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC1_INTF5</name>
                <addressOffset>0x000002bc</addressOffset>
                <description>Interrupt Force for proc1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO47_EDGE_HIGH</name>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO47_EDGE_LOW</name>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO47_LEVEL_HIGH</name>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO47_LEVEL_LOW</name>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO46_EDGE_HIGH</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO46_EDGE_LOW</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO46_LEVEL_HIGH</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO46_LEVEL_LOW</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO45_EDGE_HIGH</name>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO45_EDGE_LOW</name>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO45_LEVEL_HIGH</name>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO45_LEVEL_LOW</name>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO44_EDGE_HIGH</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO44_EDGE_LOW</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO44_LEVEL_HIGH</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO44_LEVEL_LOW</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO43_EDGE_HIGH</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO43_EDGE_LOW</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO43_LEVEL_HIGH</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO43_LEVEL_LOW</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO42_EDGE_HIGH</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO42_EDGE_LOW</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO42_LEVEL_HIGH</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO42_LEVEL_LOW</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO41_EDGE_HIGH</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO41_EDGE_LOW</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO41_LEVEL_HIGH</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO41_LEVEL_LOW</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO40_EDGE_HIGH</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO40_EDGE_LOW</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO40_LEVEL_HIGH</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO40_LEVEL_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
