raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK19</name>
                <addressOffset>0x0000004c</addressOffset>
                <description>Software lock register for page 19.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK20</name>
                <addressOffset>0x00000050</addressOffset>
                <description>Software lock register for page 20.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK21</name>
                <addressOffset>0x00000054</addressOffset>
                <description>Software lock register for page 21.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK22</name>
                <addressOffset>0x00000058</addressOffset>
                <description>Software lock register for page 22.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK23</name>
                <addressOffset>0x0000005c</addressOffset>
                <description>Software lock register for page 23.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK24</name>
                <addressOffset>0x00000060</addressOffset>
                <description>Software lock register for page 24.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK25</name>
                <addressOffset>0x00000064</addressOffset>
                <description>Software lock register for page 25.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK26</name>
                <addressOffset>0x00000068</addressOffset>
                <description>Software lock register for page 26.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK27</name>
                <addressOffset>0x0000006c</addressOffset>
                <description>Software lock register for page 27.

