raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK28</name>
                <addressOffset>0x00000070</addressOffset>
                <description>Software lock register for page 28.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK29</name>
                <addressOffset>0x00000074</addressOffset>
                <description>Software lock register for page 29.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK30</name>
                <addressOffset>0x00000078</addressOffset>
                <description>Software lock register for page 30.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK31</name>
                <addressOffset>0x0000007c</addressOffset>
                <description>Software lock register for page 31.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK32</name>
                <addressOffset>0x00000080</addressOffset>
                <description>Software lock register for page 32.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK33</name>
                <addressOffset>0x00000084</addressOffset>
                <description>Software lock register for page 33.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK34</name>
                <addressOffset>0x00000088</addressOffset>
                <description>Software lock register for page 34.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK35</name>
                <addressOffset>0x0000008c</addressOffset>
                <description>Software lock register for page 35.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK36</name>
                <addressOffset>0x00000090</addressOffset>
                <description>Software lock register for page 36.

