raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK55</name>
                <addressOffset>0x000000dc</addressOffset>
                <description>Software lock register for page 55.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK56</name>
                <addressOffset>0x000000e0</addressOffset>
                <description>Software lock register for page 56.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK57</name>
                <addressOffset>0x000000e4</addressOffset>
                <description>Software lock register for page 57.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK58</name>
                <addressOffset>0x000000e8</addressOffset>
                <description>Software lock register for page 58.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK59</name>
                <addressOffset>0x000000ec</addressOffset>
                <description>Software lock register for page 59.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK60</name>
                <addressOffset>0x000000f0</addressOffset>
                <description>Software lock register for page 60.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK61</name>
                <addressOffset>0x000000f4</addressOffset>
                <description>Software lock register for page 61.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK62</name>
                <addressOffset>0x000000f8</addressOffset>
                <description>Software lock register for page 62.

                    Locks are initialised from the OTP lock pages at reset. This register can be written to further advance the lock state of each page (until next reset), and read to check the current lock state of a page.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NSEC</name>
                        <description>Non-secure lock status. Writes are OR'd with the current value.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SEC</name>
                        <description>Secure lock status. Writes are OR'd with the current value. This field is read-only to Non-secure code.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SW_LOCK63</name>
                <addressOffset>0x000000fc</addressOffset>
                <description>Software lock register for page 63.

