raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    This is measured at 1.1 V, at room temperature, with the ROSC configuration registers in their reset state.</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>ROSC_CALIB</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>LPOSC_CALIB</name>
                <addressOffset>0x0022</addressOffset>
                <description>Low-power oscillator frequency in Hz, measured during manufacturing (ECC)

                    This is measured at 1.1V, at room temperature, with the LPOSC trim register in its reset state.</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>LPOSC_CALIB</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NUM_GPIOS</name>
                <addressOffset>0x0030</addressOffset>
                <description>The number of main user GPIOs (bank 0). Should read 48 in the QFN80 package, and 30 in the QFN60 package. (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>NUM_GPIOS</name>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INFO_CRC0</name>
                <addressOffset>0x006c</addressOffset>
                <description>Lower 16 bits of CRC32 of OTP addresses 0x00 through 0x6b (polynomial 0x4c11db7, input reflected, output reflected, seed all-ones, final XOR all-ones) (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>INFO_CRC0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INFO_CRC1</name>
                <addressOffset>0x006e</addressOffset>
                <description>Upper 16 bits of CRC32 of OTP addresses 0x00 through 0x6b (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>INFO_CRC1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_DEVINFO</name>
                <addressOffset>0x00a8</addressOffset>
                <description>Stores information about external flash device(s). (ECC)

                    Assumed to be valid if BOOT_FLAGS0_FLASH_DEVINFO_ENABLE is set.</description>
                <size>16</size>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>CS1_SIZE</name>
                        <description>The size of the flash/PSRAM device on chip select 1 (addressable at 0x11000000 through 0x11ffffff).

                            A value of zero is decoded as a size of zero (no device). Nonzero values are decoded as 4kiB &lt;&lt; CS1_SIZE. For example, four megabytes is encoded with a CS1_SIZE value of 10, and 16 megabytes is encoded with a CS1_SIZE value of 12.

                            When BOOT_FLAGS0_FLASH_DEVINFO_ENABLE is not set, a default of zero is used.</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NONE</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8K</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>16K</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>32K</name>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>64k</name>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>128K</name>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>256K</name>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>512K</name>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1M</name>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>2M</name>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4M</name>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8M</name>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>16M</name>
                                <value>12</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CS0_SIZE</name>
                        <description>The size of the flash/PSRAM device on chip select 0 (addressable at 0x10000000 through 0x10ffffff).

                            A value of zero is decoded as a size of zero (no device). Nonzero values are decoded as 4kiB &lt;&lt; CS0_SIZE. For example, four megabytes is encoded with a CS0_SIZE value of 10, and 16 megabytes is encoded with a CS0_SIZE value of 12.

                            When BOOT_FLAGS0_FLASH_DEVINFO_ENABLE is not set, a default of 12 (16 MiB) is used.</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NONE</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8K</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>16K</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>32K</name>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>64k</name>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>128K</name>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>256K</name>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>512K</name>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1M</name>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>2M</name>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4M</name>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8M</name>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>16M</name>
                                <value>12</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>D8H_ERASE_SUPPORTED</name>
                        <description>If true, all attached devices are assumed to support (or ignore, in the case of PSRAM) a block erase command with a command prefix of D8h, an erase size of 64 kiB, and a 24-bit address. Almost all 25-series flash devices support this command.

                            If set, the bootrom will use the D8h erase command where it is able, to accelerate bulk erase operations. This makes flash programming faster.

                            When BOOT_FLAGS0_FLASH_DEVINFO_ENABLE is not set, this field defaults to false.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CS1_GPIO</name>
                        <description>Indicate a GPIO number to be used for the secondary flash chip select (CS1), which selects the external QSPI device mapped at system addresses 0x11000000 through 0x11ffffff. There is no such configuration for CS0, as the primary chip select has a dedicated pin.

                            On RP2350 the permissible GPIO numbers are 0, 8, 19 and 47.

                            Ignored if CS1_size is zero. If CS1_SIZE is nonzero, the bootrom will automatically configure this GPIO as a second chip select upon entering the flash boot path, or entering any other path that may use the QSPI flash interface, such as BOOTSEL mode (nsboot).</description>
                        <bitRange>[5:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLASH_PARTITION_SLOT_SIZE</name>
                <addressOffset>0x00aa</addressOffset>
                <description>Gap between partition table slot 0 and slot 1 at the start of flash (the default size is 4096 bytes) (ECC) Enabled by the OVERRIDE_FLASH_PARTITION_SLOT_SIZE bit in BOOT_FLAGS, the size is 4096 * (value + 1)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>FLASH_PARTITION_SLOT_SIZE</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTSEL_LED_CFG</name>
                <addressOffset>0x00ac</addressOffset>
                <description>Pin configuration for LED status, used by USB bootloader. (ECC) 
                    Must be valid if BOOT_FLAGS0_ENABLE_BOOTSEL_LED is set.</description>
                <size>16</size>
                <resetValue>0x0000</resetValue>
                <fields>
                    <field>
                        <name>ACTIVELOW</name>
                        <description>LED is active-low. (Default: active-high.)</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PIN</name>
                        <description>GPIO index to use for bootloader activity LED.</description>
                        <bitRange>[5:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTSEL_PLL_CFG</name>
                <addressOffset>0x00ae</addressOffset>
                <description>Optional PLL configuration for BOOTSEL mode. (ECC)

