raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    Note that if the USB_WHITE_LABEL structure or the corresponding strings are not readable by BOOTSEL mode based on OTP permissions, or if alignment requirements are not met, then the corresponding default values are used.

                    The index values indicate where each field is located (row USB_WHITE_LABEL_ADDR value + index):</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>USB_WHITE_LABEL_ADDR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>INDEX_USB_DEVICE_VID_VALUE</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_USB_DEVICE_PID_VALUE</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_USB_DEVICE_BCD_DEVICE_VALUE</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_USB_DEVICE_LANG_ID_VALUE</name>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_USB_DEVICE_MANUFACTURER_STRDEF</name>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_USB_DEVICE_PRODUCT_STRDEF</name>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_USB_DEVICE_SERIAL_NUMBER_STRDEF</name>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_USB_CONFIG_ATTRIBUTES_MAX_POWER_VALUES</name>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_VOLUME_LABEL_STRDEF</name>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_SCSI_INQUIRY_VENDOR_STRDEF</name>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_SCSI_INQUIRY_PRODUCT_STRDEF</name>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_SCSI_INQUIRY_VERSION_STRDEF</name>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_INDEX_HTM_REDIRECT_URL_STRDEF</name>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_INDEX_HTM_REDIRECT_NAME_STRDEF</name>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_INFO_UF2_TXT_MODEL_STRDEF</name>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>INDEX_INFO_UF2_TXT_BOARD_ID_STRDEF</name>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>OTPBOOT_SRC</name>
                <addressOffset>0x00bc</addressOffset>
                <description>OTP start row for the OTP boot image. (ECC)

                    If OTP boot is enabled, the bootrom will load from this location into SRAM and then directly enter the loaded image. Note that the image must be signed if SECURE_BOOT_ENABLE is set. The image itself is assumed to be ECC-protected.

                    This must be an even number. Equivalently, the OTP boot image must start at a word-aligned location in the ECC read data address window.</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>OTPBOOT_SRC</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>OTPBOOT_LEN</name>
                <addressOffset>0x00be</addressOffset>
                <description>Length in rows of the OTP boot image. (ECC)

                    OTPBOOT_LEN must be even. The total image size must be a multiple of 4 bytes (32 bits).</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>OTPBOOT_LEN</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>OTPBOOT_DST0</name>
                <addressOffset>0x00c0</addressOffset>
                <description>Bits 15:0 of the OTP boot image load destination (and entry point). (ECC)

                    This must be a location in main SRAM (main SRAM is addresses 0x20000000 through 0x20082000) and must be word-aligned.</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>OTPBOOT_DST0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>OTPBOOT_DST1</name>
                <addressOffset>0x00c2</addressOffset>
                <description>Bits 31:16 of the OTP boot image load destination (and entry point). (ECC)

                    This must be a location in main SRAM (main SRAM is addresses 0x20000000 through 0x20082000) and must be word-aligned.</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>OTPBOOT_DST1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_0</name>
                <addressOffset>0x0100</addressOffset>
                <description>Bits 15:0 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_1</name>
                <addressOffset>0x0102</addressOffset>
                <description>Bits 31:16 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_2</name>
                <addressOffset>0x0104</addressOffset>
                <description>Bits 47:32 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_3</name>
                <addressOffset>0x0106</addressOffset>
                <description>Bits 63:48 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_4</name>
                <addressOffset>0x0108</addressOffset>
                <description>Bits 79:64 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_5</name>
                <addressOffset>0x010a</addressOffset>
                <description>Bits 95:80 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_6</name>
                <addressOffset>0x010c</addressOffset>
                <description>Bits 111:96 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_7</name>
                <addressOffset>0x010e</addressOffset>
                <description>Bits 127:112 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_8</name>
                <addressOffset>0x0110</addressOffset>
                <description>Bits 143:128 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_8</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_9</name>
                <addressOffset>0x0112</addressOffset>
                <description>Bits 159:144 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_9</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_10</name>
                <addressOffset>0x0114</addressOffset>
                <description>Bits 175:160 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_10</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_11</name>
                <addressOffset>0x0116</addressOffset>
                <description>Bits 191:176 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_11</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_12</name>
                <addressOffset>0x0118</addressOffset>
                <description>Bits 207:192 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_12</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_13</name>
                <addressOffset>0x011a</addressOffset>
                <description>Bits 223:208 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_13</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_14</name>
                <addressOffset>0x011c</addressOffset>
                <description>Bits 239:224 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_14</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY0_15</name>
                <addressOffset>0x011e</addressOffset>
                <description>Bits 255:240 of SHA-256 hash of boot key 0 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY0_15</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_0</name>
                <addressOffset>0x0120</addressOffset>
                <description>Bits 15:0 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_1</name>
                <addressOffset>0x0122</addressOffset>
                <description>Bits 31:16 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_2</name>
                <addressOffset>0x0124</addressOffset>
                <description>Bits 47:32 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_3</name>
                <addressOffset>0x0126</addressOffset>
                <description>Bits 63:48 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_4</name>
                <addressOffset>0x0128</addressOffset>
                <description>Bits 79:64 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_5</name>
                <addressOffset>0x012a</addressOffset>
                <description>Bits 95:80 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_6</name>
                <addressOffset>0x012c</addressOffset>
                <description>Bits 111:96 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_7</name>
                <addressOffset>0x012e</addressOffset>
                <description>Bits 127:112 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_8</name>
                <addressOffset>0x0130</addressOffset>
                <description>Bits 143:128 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_8</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_9</name>
                <addressOffset>0x0132</addressOffset>
                <description>Bits 159:144 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_9</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_10</name>
                <addressOffset>0x0134</addressOffset>
                <description>Bits 175:160 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_10</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_11</name>
                <addressOffset>0x0136</addressOffset>
                <description>Bits 191:176 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_11</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
