raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>BOOTKEY1_12</name>
                <addressOffset>0x0138</addressOffset>
                <description>Bits 207:192 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_12</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_13</name>
                <addressOffset>0x013a</addressOffset>
                <description>Bits 223:208 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_13</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_14</name>
                <addressOffset>0x013c</addressOffset>
                <description>Bits 239:224 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_14</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_15</name>
                <addressOffset>0x013e</addressOffset>
                <description>Bits 255:240 of SHA-256 hash of boot key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_15</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_0</name>
                <addressOffset>0x0140</addressOffset>
                <description>Bits 15:0 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_1</name>
                <addressOffset>0x0142</addressOffset>
                <description>Bits 31:16 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_2</name>
                <addressOffset>0x0144</addressOffset>
                <description>Bits 47:32 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_3</name>
                <addressOffset>0x0146</addressOffset>
                <description>Bits 63:48 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_4</name>
                <addressOffset>0x0148</addressOffset>
                <description>Bits 79:64 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_5</name>
                <addressOffset>0x014a</addressOffset>
                <description>Bits 95:80 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_6</name>
                <addressOffset>0x014c</addressOffset>
                <description>Bits 111:96 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_7</name>
                <addressOffset>0x014e</addressOffset>
                <description>Bits 127:112 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_8</name>
                <addressOffset>0x0150</addressOffset>
                <description>Bits 143:128 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_8</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_9</name>
                <addressOffset>0x0152</addressOffset>
                <description>Bits 159:144 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_9</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_10</name>
                <addressOffset>0x0154</addressOffset>
                <description>Bits 175:160 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_10</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_11</name>
                <addressOffset>0x0156</addressOffset>
                <description>Bits 191:176 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_11</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_12</name>
                <addressOffset>0x0158</addressOffset>
                <description>Bits 207:192 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_12</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_13</name>
                <addressOffset>0x015a</addressOffset>
                <description>Bits 223:208 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_13</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_14</name>
                <addressOffset>0x015c</addressOffset>
                <description>Bits 239:224 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_14</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_15</name>
                <addressOffset>0x015e</addressOffset>
                <description>Bits 255:240 of SHA-256 hash of boot key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_15</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_0</name>
                <addressOffset>0x0160</addressOffset>
                <description>Bits 15:0 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_1</name>
                <addressOffset>0x0162</addressOffset>
                <description>Bits 31:16 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_2</name>
                <addressOffset>0x0164</addressOffset>
                <description>Bits 47:32 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_3</name>
                <addressOffset>0x0166</addressOffset>
                <description>Bits 63:48 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_4</name>
                <addressOffset>0x0168</addressOffset>
                <description>Bits 79:64 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_5</name>
                <addressOffset>0x016a</addressOffset>
                <description>Bits 95:80 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_6</name>
                <addressOffset>0x016c</addressOffset>
                <description>Bits 111:96 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_7</name>
                <addressOffset>0x016e</addressOffset>
                <description>Bits 127:112 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_8</name>
                <addressOffset>0x0170</addressOffset>
                <description>Bits 143:128 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_8</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_9</name>
                <addressOffset>0x0172</addressOffset>
                <description>Bits 159:144 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_9</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_10</name>
                <addressOffset>0x0174</addressOffset>
                <description>Bits 175:160 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_10</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_11</name>
                <addressOffset>0x0176</addressOffset>
                <description>Bits 191:176 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_11</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_12</name>
                <addressOffset>0x0178</addressOffset>
                <description>Bits 207:192 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_12</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_13</name>
                <addressOffset>0x017a</addressOffset>
                <description>Bits 223:208 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_13</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_14</name>
                <addressOffset>0x017c</addressOffset>
                <description>Bits 239:224 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_14</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_15</name>
                <addressOffset>0x017e</addressOffset>
                <description>Bits 255:240 of SHA-256 hash of boot key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_15</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_0</name>
                <addressOffset>0x1e90</addressOffset>
                <description>Bits 15:0 of OTP access key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_1</name>
                <addressOffset>0x1e92</addressOffset>
                <description>Bits 31:16 of OTP access key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_2</name>
                <addressOffset>0x1e94</addressOffset>
                <description>Bits 47:32 of OTP access key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_3</name>
                <addressOffset>0x1e96</addressOffset>
                <description>Bits 63:48 of OTP access key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_4</name>
                <addressOffset>0x1e98</addressOffset>
                <description>Bits 79:64 of OTP access key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_5</name>
                <addressOffset>0x1e9a</addressOffset>
                <description>Bits 95:80 of OTP access key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
