raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>KEY1_6</name>
                <addressOffset>0x1e9c</addressOffset>
                <description>Bits 111:96 of OTP access key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_7</name>
                <addressOffset>0x1e9e</addressOffset>
                <description>Bits 127:112 of OTP access key 1 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_0</name>
                <addressOffset>0x1ea0</addressOffset>
                <description>Bits 15:0 of OTP access key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_1</name>
                <addressOffset>0x1ea2</addressOffset>
                <description>Bits 31:16 of OTP access key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_2</name>
                <addressOffset>0x1ea4</addressOffset>
                <description>Bits 47:32 of OTP access key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_3</name>
                <addressOffset>0x1ea6</addressOffset>
                <description>Bits 63:48 of OTP access key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_4</name>
                <addressOffset>0x1ea8</addressOffset>
                <description>Bits 79:64 of OTP access key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_5</name>
                <addressOffset>0x1eaa</addressOffset>
                <description>Bits 95:80 of OTP access key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_6</name>
                <addressOffset>0x1eac</addressOffset>
                <description>Bits 111:96 of OTP access key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_7</name>
                <addressOffset>0x1eae</addressOffset>
                <description>Bits 127:112 of OTP access key 2 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_0</name>
                <addressOffset>0x1eb0</addressOffset>
                <description>Bits 15:0 of OTP access key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_1</name>
                <addressOffset>0x1eb2</addressOffset>
                <description>Bits 31:16 of OTP access key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_2</name>
                <addressOffset>0x1eb4</addressOffset>
                <description>Bits 47:32 of OTP access key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_3</name>
                <addressOffset>0x1eb6</addressOffset>
                <description>Bits 63:48 of OTP access key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_4</name>
                <addressOffset>0x1eb8</addressOffset>
                <description>Bits 79:64 of OTP access key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_5</name>
                <addressOffset>0x1eba</addressOffset>
                <description>Bits 95:80 of OTP access key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_6</name>
                <addressOffset>0x1ebc</addressOffset>
                <description>Bits 111:96 of OTP access key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_7</name>
                <addressOffset>0x1ebe</addressOffset>
                <description>Bits 127:112 of OTP access key 3 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_0</name>
                <addressOffset>0x1ec0</addressOffset>
                <description>Bits 15:0 of OTP access key 4 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_1</name>
                <addressOffset>0x1ec2</addressOffset>
                <description>Bits 31:16 of OTP access key 4 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_2</name>
                <addressOffset>0x1ec4</addressOffset>
                <description>Bits 47:32 of OTP access key 4 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_3</name>
                <addressOffset>0x1ec6</addressOffset>
                <description>Bits 63:48 of OTP access key 4 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_4</name>
                <addressOffset>0x1ec8</addressOffset>
                <description>Bits 79:64 of OTP access key 4 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_5</name>
                <addressOffset>0x1eca</addressOffset>
                <description>Bits 95:80 of OTP access key 4 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_6</name>
                <addressOffset>0x1ecc</addressOffset>
                <description>Bits 111:96 of OTP access key 4 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_7</name>
                <addressOffset>0x1ece</addressOffset>
                <description>Bits 127:112 of OTP access key 4 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_0</name>
                <addressOffset>0x1ed0</addressOffset>
                <description>Bits 15:0 of OTP access key 5 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_1</name>
                <addressOffset>0x1ed2</addressOffset>
                <description>Bits 31:16 of OTP access key 5 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_2</name>
                <addressOffset>0x1ed4</addressOffset>
                <description>Bits 47:32 of OTP access key 5 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_3</name>
                <addressOffset>0x1ed6</addressOffset>
                <description>Bits 63:48 of OTP access key 5 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_4</name>
                <addressOffset>0x1ed8</addressOffset>
                <description>Bits 79:64 of OTP access key 5 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_5</name>
                <addressOffset>0x1eda</addressOffset>
                <description>Bits 95:80 of OTP access key 5 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_6</name>
                <addressOffset>0x1edc</addressOffset>
                <description>Bits 111:96 of OTP access key 5 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_7</name>
                <addressOffset>0x1ede</addressOffset>
                <description>Bits 127:112 of OTP access key 5 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_0</name>
                <addressOffset>0x1ee0</addressOffset>
                <description>Bits 15:0 of OTP access key 6 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_1</name>
                <addressOffset>0x1ee2</addressOffset>
                <description>Bits 31:16 of OTP access key 6 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_2</name>
                <addressOffset>0x1ee4</addressOffset>
                <description>Bits 47:32 of OTP access key 6 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_3</name>
                <addressOffset>0x1ee6</addressOffset>
                <description>Bits 63:48 of OTP access key 6 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_4</name>
                <addressOffset>0x1ee8</addressOffset>
                <description>Bits 79:64 of OTP access key 6 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_5</name>
                <addressOffset>0x1eea</addressOffset>
                <description>Bits 95:80 of OTP access key 6 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_6</name>
                <addressOffset>0x1eec</addressOffset>
                <description>Bits 111:96 of OTP access key 6 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_7</name>
                <addressOffset>0x1eee</addressOffset>
                <description>Bits 127:112 of OTP access key 6 (ECC)</description>
                <size>16</size>
                <resetMask>0x0000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
