raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Note that this will cause bootrom APIs that access XIP to fail, including APIs that interact with the partition table.</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DISABLE_BOOTSEL_UART_BOOT</name>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DISABLE_BOOTSEL_USB_PICOBOOT_IFC</name>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DISABLE_BOOTSEL_USB_MSD_IFC</name>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DISABLE_WATCHDOG_SCRATCH</name>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DISABLE_POWER_SCRATCH</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE_OTP_BOOT</name>
                        <description>Enable OTP boot. A number of OTP rows specified by OTPBOOT_LEN will be loaded, starting from OTPBOOT_SRC, into the SRAM location specified by OTPBOOT_DST1 and OTPBOOT_DST0.

                            The loaded program image is stored with ECC, 16 bits per row, and must contain a valid IMAGE_DEF. Do not set this bit without first programming an image into OTP and configuring OTPBOOT_LEN, OTPBOOT_SRC, OTPBOOT_DST0 and OTPBOOT_DST1.

                            Note that OTPBOOT_LEN and OTPBOOT_SRC must be even numbers of OTP rows. Equivalently, the image must be a multiple of 32 bits in size, and must start at a 32-bit-aligned address in the ECC read data address window.</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DISABLE_OTP_BOOT</name>
                        <description>Takes precedence over ENABLE_OTP_BOOT.</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DISABLE_FLASH_BOOT</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ROLLBACK_REQUIRED</name>
                        <description>Require binaries to have a rollback version. Set automatically the first time a binary with a rollback version is booted.</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HASHED_PARTITION_TABLE</name>
                        <description>Require a partition table to be hashed (if not signed)</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SECURE_PARTITION_TABLE</name>
                        <description>Require a partition table to be signed</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DISABLE_AUTO_SWITCH_ARCH</name>
                        <description>Disable auto-switch of CPU architecture on boot when the (only) binary to be booted is for the other Arm/RISC-V architecture and both architectures are enabled</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SINGLE_FLASH_BINARY</name>
                        <description>Restrict flash boot path to use of a single binary at the start of flash</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OVERRIDE_FLASH_PARTITION_SLOT_SIZE</name>
                        <description>Override the limit for default flash metadata scanning.

                            The value is specified in FLASH_PARTITION_SLOT_SIZE. Make sure FLASH_PARTITION_SLOT_SIZE is valid before setting this bit</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FLASH_DEVINFO_ENABLE</name>
                        <description>Mark FLASH_DEVINFO as containing valid, ECC'd data which describes external flash devices.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FAST_SIGCHECK_ROSC_DIV</name>
                        <description>Enable quartering of ROSC divisor during signature check, to reduce secure boot time</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FLASH_IO_VOLTAGE_1V8</name>
                        <description>If 1, configure the QSPI pads for 1.8 V operation when accessing flash for the first time from the bootrom, using the VOLTAGE_SELECT register for the QSPI pads bank. This slightly improves the input timing of the pads at low voltages, but does not affect their output characteristics.

                            If 0, leave VOLTAGE_SELECT in its reset state (suitable for operation at and above 2.5 V)</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE_BOOTSEL_NON_DEFAULT_PLL_XOSC_CFG</name>
                        <description>Enable loading of the non-default XOSC and PLL configuration before entering BOOTSEL mode.

                            Ensure that BOOTSEL_XOSC_CFG and BOOTSEL_PLL_CFG are correctly programmed before setting this bit.

                            If this bit is set, user software may use the contents of BOOTSEL_PLL_CFG to calculated the expected XOSC frequency based on the fixed USB boot frequency of 48 MHz.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE_BOOTSEL_LED</name>
                        <description>Enable bootloader activity LED. If set, bootsel_led_cfg is assumed to be valid</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DISABLE_BOOTSEL_EXEC2</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOT_FLAGS0_R1</name>
                <addressOffset>0x00000124</addressOffset>
                <description>Redundant copy of BOOT_FLAGS0</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOT_FLAGS0_R1</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOT_FLAGS0_R2</name>
                <addressOffset>0x00000128</addressOffset>
                <description>Redundant copy of BOOT_FLAGS0</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOT_FLAGS0_R2</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOT_FLAGS1</name>
                <addressOffset>0x0000012c</addressOffset>
                <description>Disable/Enable boot paths/features in the RP2350 mask ROM. Disables always supersede enables. Enables are provided where there are other configurations in OTP that must be valid. (RBIT-3)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DOUBLE_TAP</name>
                        <description>Enable entering BOOTSEL mode via double-tap of the RUN/RSTn pin. Adds a significant delay to boot time, as configured by DOUBLE_TAP_DELAY.

                            This functions by waiting at startup (i.e. following a reset) to see if a second reset is applied soon afterward. The second reset is detected by the bootrom with help of the POWMAN_CHIP_RESET_DOUBLE_TAP flag, which is not reset by the external reset pin, and the bootrom enters BOOTSEL mode (NSBOOT) to await further instruction over USB or UART.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DOUBLE_TAP_DELAY</name>
                        <description>Adjust how long to wait for a second reset when double tap BOOTSEL mode is enabled via DOUBLE_TAP. The minimum is 50 milliseconds, and each unit of this field adds an additional 50 milliseconds.

                            For example, settings this field to its maximum value of 7 will cause the chip to wait for 400 milliseconds at boot to check for a second reset which requests entry to BOOTSEL mode.

                            200 milliseconds (DOUBLE_TAP_DELAY=3) is a good intermediate value.</description>
                        <bitRange>[18:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>KEY_INVALID</name>
                        <description>Mark a boot key as invalid, or prevent it from ever becoming valid. The bootrom will ignore any boot key marked as invalid during secure boot signature checks.

                            Each bit in this field corresponds to one of the four 256-bit boot key hashes that may be stored in page 2 of the OTP.

                            When provisioning boot keys, it's recommended to mark any boot key slots you don't intend to use as KEY_INVALID, so that spurious keys can not be installed at a later time.</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>KEY_VALID</name>
                        <description>Mark each of the possible boot keys as valid. The bootrom will check signatures against all valid boot keys, and ignore invalid boot keys.

                            Each bit in this field corresponds to one of the four 256-bit boot key hashes that may be stored in page 2 of the OTP.

