raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>BOOTKEY1_13</name>
                <addressOffset>0x00000274</addressOffset>
                <description>Bits 223:208 of SHA-256 hash of boot key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_13</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_14</name>
                <addressOffset>0x00000278</addressOffset>
                <description>Bits 239:224 of SHA-256 hash of boot key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_14</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY1_15</name>
                <addressOffset>0x0000027c</addressOffset>
                <description>Bits 255:240 of SHA-256 hash of boot key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY1_15</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_0</name>
                <addressOffset>0x00000280</addressOffset>
                <description>Bits 15:0 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_1</name>
                <addressOffset>0x00000284</addressOffset>
                <description>Bits 31:16 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_2</name>
                <addressOffset>0x00000288</addressOffset>
                <description>Bits 47:32 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_3</name>
                <addressOffset>0x0000028c</addressOffset>
                <description>Bits 63:48 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_4</name>
                <addressOffset>0x00000290</addressOffset>
                <description>Bits 79:64 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_5</name>
                <addressOffset>0x00000294</addressOffset>
                <description>Bits 95:80 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_6</name>
                <addressOffset>0x00000298</addressOffset>
                <description>Bits 111:96 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_7</name>
                <addressOffset>0x0000029c</addressOffset>
                <description>Bits 127:112 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_8</name>
                <addressOffset>0x000002a0</addressOffset>
                <description>Bits 143:128 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_8</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_9</name>
                <addressOffset>0x000002a4</addressOffset>
                <description>Bits 159:144 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_9</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_10</name>
                <addressOffset>0x000002a8</addressOffset>
                <description>Bits 175:160 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_10</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_11</name>
                <addressOffset>0x000002ac</addressOffset>
                <description>Bits 191:176 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_11</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_12</name>
                <addressOffset>0x000002b0</addressOffset>
                <description>Bits 207:192 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_12</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_13</name>
                <addressOffset>0x000002b4</addressOffset>
                <description>Bits 223:208 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_13</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_14</name>
                <addressOffset>0x000002b8</addressOffset>
                <description>Bits 239:224 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_14</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY2_15</name>
                <addressOffset>0x000002bc</addressOffset>
                <description>Bits 255:240 of SHA-256 hash of boot key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY2_15</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_0</name>
                <addressOffset>0x000002c0</addressOffset>
                <description>Bits 15:0 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_1</name>
                <addressOffset>0x000002c4</addressOffset>
                <description>Bits 31:16 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_2</name>
                <addressOffset>0x000002c8</addressOffset>
                <description>Bits 47:32 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_3</name>
                <addressOffset>0x000002cc</addressOffset>
                <description>Bits 63:48 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_4</name>
                <addressOffset>0x000002d0</addressOffset>
                <description>Bits 79:64 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_5</name>
                <addressOffset>0x000002d4</addressOffset>
                <description>Bits 95:80 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_6</name>
                <addressOffset>0x000002d8</addressOffset>
                <description>Bits 111:96 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_7</name>
                <addressOffset>0x000002dc</addressOffset>
                <description>Bits 127:112 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_8</name>
                <addressOffset>0x000002e0</addressOffset>
                <description>Bits 143:128 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_8</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_9</name>
                <addressOffset>0x000002e4</addressOffset>
                <description>Bits 159:144 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_9</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_10</name>
                <addressOffset>0x000002e8</addressOffset>
                <description>Bits 175:160 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_10</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_11</name>
                <addressOffset>0x000002ec</addressOffset>
                <description>Bits 191:176 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_11</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_12</name>
                <addressOffset>0x000002f0</addressOffset>
                <description>Bits 207:192 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_12</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_13</name>
                <addressOffset>0x000002f4</addressOffset>
                <description>Bits 223:208 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_13</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_14</name>
                <addressOffset>0x000002f8</addressOffset>
                <description>Bits 239:224 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_14</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTKEY3_15</name>
                <addressOffset>0x000002fc</addressOffset>
                <description>Bits 255:240 of SHA-256 hash of boot key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>BOOTKEY3_15</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_0</name>
                <addressOffset>0x00003d20</addressOffset>
                <description>Bits 15:0 of OTP access key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_1</name>
                <addressOffset>0x00003d24</addressOffset>
                <description>Bits 31:16 of OTP access key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_2</name>
                <addressOffset>0x00003d28</addressOffset>
                <description>Bits 47:32 of OTP access key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_3</name>
                <addressOffset>0x00003d2c</addressOffset>
                <description>Bits 63:48 of OTP access key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_4</name>
                <addressOffset>0x00003d30</addressOffset>
                <description>Bits 79:64 of OTP access key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_5</name>
                <addressOffset>0x00003d34</addressOffset>
                <description>Bits 95:80 of OTP access key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_6</name>
                <addressOffset>0x00003d38</addressOffset>
                <description>Bits 111:96 of OTP access key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_7</name>
                <addressOffset>0x00003d3c</addressOffset>
                <description>Bits 127:112 of OTP access key 1 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY1_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_0</name>
                <addressOffset>0x00003d40</addressOffset>
                <description>Bits 15:0 of OTP access key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
