raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>KEY2_1</name>
                <addressOffset>0x00003d44</addressOffset>
                <description>Bits 31:16 of OTP access key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_2</name>
                <addressOffset>0x00003d48</addressOffset>
                <description>Bits 47:32 of OTP access key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_3</name>
                <addressOffset>0x00003d4c</addressOffset>
                <description>Bits 63:48 of OTP access key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_4</name>
                <addressOffset>0x00003d50</addressOffset>
                <description>Bits 79:64 of OTP access key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_5</name>
                <addressOffset>0x00003d54</addressOffset>
                <description>Bits 95:80 of OTP access key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_6</name>
                <addressOffset>0x00003d58</addressOffset>
                <description>Bits 111:96 of OTP access key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_7</name>
                <addressOffset>0x00003d5c</addressOffset>
                <description>Bits 127:112 of OTP access key 2 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY2_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_0</name>
                <addressOffset>0x00003d60</addressOffset>
                <description>Bits 15:0 of OTP access key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_1</name>
                <addressOffset>0x00003d64</addressOffset>
                <description>Bits 31:16 of OTP access key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_2</name>
                <addressOffset>0x00003d68</addressOffset>
                <description>Bits 47:32 of OTP access key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_3</name>
                <addressOffset>0x00003d6c</addressOffset>
                <description>Bits 63:48 of OTP access key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_4</name>
                <addressOffset>0x00003d70</addressOffset>
                <description>Bits 79:64 of OTP access key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_5</name>
                <addressOffset>0x00003d74</addressOffset>
                <description>Bits 95:80 of OTP access key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_6</name>
                <addressOffset>0x00003d78</addressOffset>
                <description>Bits 111:96 of OTP access key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY3_7</name>
                <addressOffset>0x00003d7c</addressOffset>
                <description>Bits 127:112 of OTP access key 3 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY3_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_0</name>
                <addressOffset>0x00003d80</addressOffset>
                <description>Bits 15:0 of OTP access key 4 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_1</name>
                <addressOffset>0x00003d84</addressOffset>
                <description>Bits 31:16 of OTP access key 4 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_2</name>
                <addressOffset>0x00003d88</addressOffset>
                <description>Bits 47:32 of OTP access key 4 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_3</name>
                <addressOffset>0x00003d8c</addressOffset>
                <description>Bits 63:48 of OTP access key 4 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_4</name>
                <addressOffset>0x00003d90</addressOffset>
                <description>Bits 79:64 of OTP access key 4 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_5</name>
                <addressOffset>0x00003d94</addressOffset>
                <description>Bits 95:80 of OTP access key 4 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_6</name>
                <addressOffset>0x00003d98</addressOffset>
                <description>Bits 111:96 of OTP access key 4 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_7</name>
                <addressOffset>0x00003d9c</addressOffset>
                <description>Bits 127:112 of OTP access key 4 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY4_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_0</name>
                <addressOffset>0x00003da0</addressOffset>
                <description>Bits 15:0 of OTP access key 5 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_1</name>
                <addressOffset>0x00003da4</addressOffset>
                <description>Bits 31:16 of OTP access key 5 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_2</name>
                <addressOffset>0x00003da8</addressOffset>
                <description>Bits 47:32 of OTP access key 5 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_3</name>
                <addressOffset>0x00003dac</addressOffset>
                <description>Bits 63:48 of OTP access key 5 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_4</name>
                <addressOffset>0x00003db0</addressOffset>
                <description>Bits 79:64 of OTP access key 5 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_5</name>
                <addressOffset>0x00003db4</addressOffset>
                <description>Bits 95:80 of OTP access key 5 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_6</name>
                <addressOffset>0x00003db8</addressOffset>
                <description>Bits 111:96 of OTP access key 5 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_7</name>
                <addressOffset>0x00003dbc</addressOffset>
                <description>Bits 127:112 of OTP access key 5 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY5_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_0</name>
                <addressOffset>0x00003dc0</addressOffset>
                <description>Bits 15:0 of OTP access key 6 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_1</name>
                <addressOffset>0x00003dc4</addressOffset>
                <description>Bits 31:16 of OTP access key 6 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_2</name>
                <addressOffset>0x00003dc8</addressOffset>
                <description>Bits 47:32 of OTP access key 6 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_3</name>
                <addressOffset>0x00003dcc</addressOffset>
                <description>Bits 63:48 of OTP access key 6 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_4</name>
                <addressOffset>0x00003dd0</addressOffset>
                <description>Bits 79:64 of OTP access key 6 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_5</name>
                <addressOffset>0x00003dd4</addressOffset>
                <description>Bits 95:80 of OTP access key 6 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_6</name>
                <addressOffset>0x00003dd8</addressOffset>
                <description>Bits 111:96 of OTP access key 6 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_7</name>
                <addressOffset>0x00003ddc</addressOffset>
                <description>Bits 127:112 of OTP access key 6 (ECC)</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>KEY6_7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY1_VALID</name>
                <addressOffset>0x00003de4</addressOffset>
                <description>Valid flag for key 1. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY2_VALID</name>
                <addressOffset>0x00003de8</addressOffset>
                <description>Valid flag for key 2. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
