raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>KEY3_VALID</name>
                <addressOffset>0x00003dec</addressOffset>
                <description>Valid flag for key 3. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY4_VALID</name>
                <addressOffset>0x00003df0</addressOffset>
                <description>Valid flag for key 4. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY5_VALID</name>
                <addressOffset>0x00003df4</addressOffset>
                <description>Valid flag for key 5. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>KEY6_VALID</name>
                <addressOffset>0x00003df8</addressOffset>
                <description>Valid flag for key 6. Once the valid flag is set, the key can no longer be read or written, and becomes a valid fixed key for protecting OTP pages.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VALID_R2</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID_R1</name>
                        <description>Redundant copy of VALID, with 3-way majority vote</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VALID</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PAGE0_LOCK0</name>
                <addressOffset>0x00003e00</addressOffset>
                <description>Lock configuration LSBs for page 0 (rows 0x0 through 0x3f). Locks are stored with 3-way majority vote encoding, so that bits can be set independently.

                    This OTP location is always readable, and is write-protected by its own permissions.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>R2</name>
                        <description>Redundant copy of bits 7:0</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>R1</name>
                        <description>Redundant copy of bits 7:0</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NO_KEY_STATE</name>
                        <description>State when at least one key is registered for this page and no matching key has been entered.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>KEY_R</name>
                        <description>Index 1-6 of a hardware key which must be entered to grant read access, or 0 if no such key is required.</description>
                        <bitRange>[5:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>KEY_W</name>
                        <description>Index 1-6 of a hardware key which must be entered to grant write access, or 0 if no such key is required.</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PAGE0_LOCK1</name>
                <addressOffset>0x00003e04</addressOffset>
                <description>Lock configuration MSBs for page 0 (rows 0x0 through 0x3f). Locks are stored with 3-way majority vote encoding, so that bits can be set independently.

