raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    This OTP location is always readable, and is write-protected by its own permissions.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>R2</name>
                        <description>Redundant copy of bits 7:0</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>R1</name>
                        <description>Redundant copy of bits 7:0</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NO_KEY_STATE</name>
                        <description>State when at least one key is registered for this page and no matching key has been entered.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>KEY_R</name>
                        <description>Index 1-6 of a hardware key which must be entered to grant read access, or 0 if no such key is required.</description>
                        <bitRange>[5:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>KEY_W</name>
                        <description>Index 1-6 of a hardware key which must be entered to grant write access, or 0 if no such key is required.</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PAGE20_LOCK1</name>
                <addressOffset>0x00003ea4</addressOffset>
                <description>Lock configuration MSBs for page 20 (rows 0x500 through 0x53f). Locks are stored with 3-way majority vote encoding, so that bits can be set independently.

                    This OTP location is always readable, and is write-protected by its own permissions.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>R2</name>
                        <description>Redundant copy of bits 7:0</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>R1</name>
                        <description>Redundant copy of bits 7:0</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LOCK_BL</name>
                        <description>Dummy lock bits reserved for bootloaders (including the RP2350 USB bootloader) to store their own OTP access permissions. No hardware effect, and no corresponding SW_LOCKx registers.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                                <description>Bootloader permits user reads and writes to this page</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                                <description>Bootloader permits user reads of this page</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>reserved</name>
                                <value>2</value>
                                <description>Do not use. Behaves the same as INACCESSIBLE</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                                <description>Bootloader does not permit user access to this page</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LOCK_NS</name>
                        <description>Lock state for Non-secure accesses to this page. Thermometer-coded, so lock state can be advanced permanently from any state to any less-permissive state by programming OTP. Software can also advance the lock state temporarily (until next OTP reset) using the SW_LOCKx registers.

                            Note that READ_WRITE and READ_ONLY are equivalent in hardware, as the SBPI programming interface is not accessible to Non-secure software. However, Secure software may check these bits to apply write permissions to a Non-secure OTP programming API.</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                                <description>Page can be read by Non-secure software, and Secure software may permit Non-secure writes.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                                <description>Page can be read by Non-secure software</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>reserved</name>
                                <value>2</value>
                                <description>Do not use. Behaves the same as INACCESSIBLE.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                                <description>Page can not be accessed by Non-secure software.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LOCK_S</name>
                        <description>Lock state for Secure accesses to this page. Thermometer-coded, so lock state can be advanced permanently from any state to any less-permissive state by programming OTP. Software can also advance the lock state temporarily (until next OTP reset) using the SW_LOCKx registers.</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>read_write</name>
                                <value>0</value>
                                <description>Page is fully accessible by Secure software.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>read_only</name>
                                <value>1</value>
                                <description>Page can be read by Secure software, but can not be written.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>reserved</name>
                                <value>2</value>
                                <description>Do not use. Behaves the same as INACCESSIBLE.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>inaccessible</name>
                                <value>3</value>
                                <description>Page can not be accessed by Secure software.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>PAGE21_LOCK0</name>
                <addressOffset>0x00003ea8</addressOffset>
                <description>Lock configuration LSBs for page 21 (rows 0x540 through 0x57f). Locks are stored with 3-way majority vote encoding, so that bits can be set independently.

