raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>PADS_BANK0</name>
        <baseAddress>0x40038000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>204</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>VOLTAGE_SELECT</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Voltage select. Per bank control</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VOLTAGE_SELECT</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>3v3</name>
                                <value>0</value>
                                <description>Set voltage to 3.3V (DVDD &gt;= 2V5)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1v8</name>
                                <value>1</value>
                                <description>Set voltage to 1.8V (DVDD &lt;= 1V8)</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO0</name>
                <addressOffset>0x00000004</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO1</name>
                <addressOffset>0x00000008</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO2</name>
                <addressOffset>0x0000000c</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO3</name>
                <addressOffset>0x00000010</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO4</name>
                <addressOffset>0x00000014</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO5</name>
                <addressOffset>0x00000018</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
