raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>GPIO27</name>
                <addressOffset>0x00000070</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO28</name>
                <addressOffset>0x00000074</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO29</name>
                <addressOffset>0x00000078</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO30</name>
                <addressOffset>0x0000007c</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO31</name>
                <addressOffset>0x00000080</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO32</name>
                <addressOffset>0x00000084</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO33</name>
                <addressOffset>0x00000088</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
