raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>GPIO34</name>
                <addressOffset>0x0000008c</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO35</name>
                <addressOffset>0x00000090</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO36</name>
                <addressOffset>0x00000094</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO37</name>
                <addressOffset>0x00000098</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO38</name>
                <addressOffset>0x0000009c</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO39</name>
                <addressOffset>0x000000a0</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO40</name>
                <addressOffset>0x000000a4</addressOffset>
                <resetValue>0x00000116</resetValue>
                <fields>
                    <field>
                        <name>ISO</name>
                        <description>Pad isolation control. Remove this once the pad is configured by software.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OD</name>
                        <description>Output disable. Has priority over output enable from peripherals</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IE</name>
                        <description>Input enable</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DRIVE</name>
                        <description>Drive strength.</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>2mA</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4mA</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8mA</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12mA</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PUE</name>
                        <description>Pull up enable</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PDE</name>
                        <description>Pull down enable</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCHMITT</name>
                        <description>Enable schmitt trigger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEWFAST</name>
                        <description>Slew rate control. 1 = Fast, 0 = Slow</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
