raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>PIO0</name>
        <description>Programmable IO block</description>
        <baseAddress>0x50200000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>392</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>PIO0_IRQ_0</name>
            <value>15</value>
        </interrupt>
        <interrupt>
            <name>PIO0_IRQ_1</name>
            <value>16</value>
        </interrupt>
        <registers>
            <register>
                <name>CTRL</name>
                <addressOffset>0x00000000</addressOffset>
                <description>PIO control register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NEXTPREV_CLKDIV_RESTART</name>
                        <description>Write 1 to restart the clock dividers of state machines in neighbouring PIO blocks, as specified by NEXT_PIO_MASK and PREV_PIO_MASK in the same write.

                            This is equivalent to writing 1 to the corresponding CLKDIV_RESTART bits in those PIOs' CTRL registers.</description>
                        <bitRange>[26:26]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>NEXTPREV_SM_DISABLE</name>
                        <description>Write 1 to disable state machines in neighbouring PIO blocks, as specified by NEXT_PIO_MASK and PREV_PIO_MASK in the same write.

                            This is equivalent to clearing the corresponding SM_ENABLE bits in those PIOs' CTRL registers.</description>
                        <bitRange>[25:25]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>NEXTPREV_SM_ENABLE</name>
                        <description>Write 1 to enable state machines in neighbouring PIO blocks, as specified by NEXT_PIO_MASK and PREV_PIO_MASK in the same write.

                            This is equivalent to setting the corresponding SM_ENABLE bits in those PIOs' CTRL registers.

                            If both OTHERS_SM_ENABLE and OTHERS_SM_DISABLE are set, the disable takes precedence.</description>
                        <bitRange>[24:24]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>NEXT_PIO_MASK</name>
                        <description>A mask of state machines in the neighbouring higher-numbered PIO block in the system (or PIO block 0 if this is the highest-numbered PIO block) to which to apply the operations specified by NEXTPREV_CLKDIV_RESTART, NEXTPREV_SM_ENABLE, and NEXTPREV_SM_DISABLE in the same write.

                            This allows state machines in a neighbouring PIO block to be started/stopped/clock-synced exactly simultaneously with a write to this PIO block's CTRL register.

                            Note that in a system with two PIOs, NEXT_PIO_MASK and PREV_PIO_MASK actually indicate the same PIO block. In this case the effects are applied cumulatively (as though the masks were OR'd together).

                            Neighbouring PIO blocks are disconnected (status signals tied to 0 and control signals ignored) if one block is accessible to NonSecure code, and one is not.</description>
                        <bitRange>[23:20]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PREV_PIO_MASK</name>
                        <description>A mask of state machines in the neighbouring lower-numbered PIO block in the system (or the highest-numbered PIO block if this is PIO block 0) to which to apply the operations specified by OP_CLKDIV_RESTART, OP_ENABLE, OP_DISABLE in the same write.

                            This allows state machines in a neighbouring PIO block to be started/stopped/clock-synced exactly simultaneously with a write to this PIO block's CTRL register.

                            Neighbouring PIO blocks are disconnected (status signals tied to 0 and control signals ignored) if one block is accessible to NonSecure code, and one is not.</description>
                        <bitRange>[19:16]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>CLKDIV_RESTART</name>
                        <description>Restart a state machine's clock divider from an initial phase of 0. Clock dividers are free-running, so once started, their output (including fractional jitter) is completely determined by the integer/fractional divisor configured in SMx_CLKDIV. This means that, if multiple clock dividers with the same divisor are restarted simultaneously, by writing multiple 1 bits to this field, the execution clocks of those state machines will run in precise lockstep.

                            Note that setting/clearing SM_ENABLE does not stop the clock divider from running, so once multiple state machines' clocks are synchronised, it is safe to disable/reenable a state machine, whilst keeping the clock dividers in sync.

                            Note also that CLKDIV_RESTART can be written to whilst the state machine is running, and this is useful to resynchronise clock dividers after the divisors (SMx_CLKDIV) have been changed on-the-fly.</description>
                        <bitRange>[11:8]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SM_RESTART</name>
                        <description>Write 1 to instantly clear internal SM state which may be otherwise difficult to access and will affect future execution.

                            Specifically, the following are cleared: input and output shift counters; the contents of the input shift register; the delay counter; the waiting-on-IRQ state; any stalled instruction written to SMx_INSTR or run by OUT/MOV EXEC; any pin write left asserted due to OUT_STICKY.

                            The contents of the output shift register and the X/Y scratch registers are not affected.</description>
                        <bitRange>[7:4]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>SM_ENABLE</name>
                        <description>Enable/disable each of the four state machines by writing 1/0 to each of these four bits. When disabled, a state machine will cease executing instructions, except those written directly to SMx_INSTR by the system. Multiple bits can be set/cleared at once to run/halt multiple state machines simultaneously.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FSTAT</name>
                <addressOffset>0x00000004</addressOffset>
                <description>FIFO status register</description>
                <resetValue>0x0f000f00</resetValue>
                <fields>
                    <field>
                        <name>TXEMPTY</name>
                        <description>State machine TX FIFO is empty</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TXFULL</name>
                        <description>State machine TX FIFO is full</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXEMPTY</name>
                        <description>State machine RX FIFO is empty</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXFULL</name>
                        <description>State machine RX FIFO is full</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FDEBUG</name>
                <addressOffset>0x00000008</addressOffset>
                <description>FIFO debug register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TXSTALL</name>
                        <description>State machine has stalled on empty TX FIFO during a blocking PULL, or an OUT with autopull enabled. Write 1 to clear.</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>TXOVER</name>
                        <description>TX FIFO overflow (i.e. write-on-full by the system) has occurred. Write 1 to clear. Note that write-on-full does not alter the state or contents of the FIFO in any way, but the data that the system attempted to write is dropped, so if this flag is set, your software has quite likely dropped some data on the floor.</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RXUNDER</name>
                        <description>RX FIFO underflow (i.e. read-on-empty by the system) has occurred. Write 1 to clear. Note that read-on-empty does not perturb the state of the FIFO in any way, but the data returned by reading from an empty FIFO is undefined, so this flag generally only becomes set due to some kind of software error.</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RXSTALL</name>
                        <description>State machine has stalled on full RX FIFO during a blocking PUSH, or an IN with autopush enabled. This flag is also set when a nonblocking PUSH to a full FIFO took place, in which case the state machine has dropped data. Write 1 to clear.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>FLEVEL</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>FIFO levels</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RX3</name>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TX3</name>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX2</name>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TX2</name>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX1</name>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TX1</name>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX0</name>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TX0</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TXF0</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TXF0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TXF1</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TXF1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TXF2</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TXF2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TXF3</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Direct write access to the TX FIFO for this state machine. Each write pushes one word to the FIFO. Attempting to write to a full FIFO has no effect on the FIFO state or contents, and sets the sticky FDEBUG_TXOVER error flag for this FIFO.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TXF3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF0</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. Attempting to read from an empty FIFO has no effect on the FIFO state, and sets the sticky FDEBUG_RXUNDER error flag for this FIFO. The data returned to the system on a read from an empty FIFO is undefined.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>RXF0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF1</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. Attempting to read from an empty FIFO has no effect on the FIFO state, and sets the sticky FDEBUG_RXUNDER error flag for this FIFO. The data returned to the system on a read from an empty FIFO is undefined.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>RXF1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF2</name>
                <addressOffset>0x00000028</addressOffset>
                <description>Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. Attempting to read from an empty FIFO has no effect on the FIFO state, and sets the sticky FDEBUG_RXUNDER error flag for this FIFO. The data returned to the system on a read from an empty FIFO is undefined.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>RXF2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF3</name>
                <addressOffset>0x0000002c</addressOffset>
                <description>Direct read access to the RX FIFO for this state machine. Each read pops one word from the FIFO. Attempting to read from an empty FIFO has no effect on the FIFO state, and sets the sticky FDEBUG_RXUNDER error flag for this FIFO. The data returned to the system on a read from an empty FIFO is undefined.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>RXF3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQ</name>
                <addressOffset>0x00000030</addressOffset>
                <description>State machine IRQ flags register. Write 1 to clear. There are eight state machine IRQ flags, which can be set, cleared, and waited on by the state machines. There's no fixed association between flags and state machines -- any state machine can use any flag.

                    Any of the eight flags can be used for timing synchronisation between state machines, using IRQ and WAIT instructions. Any combination of the eight flags can also routed out to either of the two system-level interrupt requests, alongside FIFO status interrupts -- see e.g. IRQ0_INTE.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IRQ</name>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQ_FORCE</name>
                <addressOffset>0x00000034</addressOffset>
                <description>Writing a 1 to each of these bits will forcibly assert the corresponding IRQ. Note this is different to the INTF register: writing here affects PIO internal state. INTF just asserts the processor-facing IRQ signal for testing ISRs, and is not visible to the state machines.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IRQ_FORCE</name>
                        <bitRange>[7:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INPUT_SYNC_BYPASS</name>
                <addressOffset>0x00000038</addressOffset>
                <description>There is a 2-flipflop synchronizer on each GPIO input, which protects PIO logic from metastabilities. This increases input delay, and for fast synchronous IO (e.g. SPI) these synchronizers may need to be bypassed. Each bit in this register corresponds to one GPIO. 
                    0 -&gt; input is synchronized (default) 
                    1 -&gt; synchronizer is bypassed 
                    If in doubt, leave this register as all zeroes.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INPUT_SYNC_BYPASS</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DBG_PADOUT</name>
                <addressOffset>0x0000003c</addressOffset>
                <description>Read to sample the pad output values PIO is currently driving to the GPIOs. On RP2040 there are 30 GPIOs, so the two most significant bits are hardwired to 0.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DBG_PADOUT</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DBG_PADOE</name>
                <addressOffset>0x00000040</addressOffset>
                <description>Read to sample the pad output enables (direction) PIO is currently driving to the GPIOs. On RP2040 there are 30 GPIOs, so the two most significant bits are hardwired to 0.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DBG_PADOE</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
