raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>DBG_CFGINFO</name>
                <addressOffset>0x00000044</addressOffset>
                <description>The PIO hardware has some free parameters that may vary between chip products. 
                    These should be provided in the chip datasheet, but are also exposed here.</description>
                <resetValue>0x10000000</resetValue>
                <fields>
                    <field>
                        <name>VERSION</name>
                        <description>Version of the core PIO hardware.</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>v0</name>
                                <value>0</value>
                                <description>Version 0 (RP2040)</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>v1</name>
                                <value>1</value>
                                <description>Version 1 (RP2350)</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>IMEM_SIZE</name>
                        <description>The size of the instruction memory, measured in units of one instruction</description>
                        <bitRange>[21:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM_COUNT</name>
                        <description>The number of state machines this PIO instance is equipped with.</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FIFO_DEPTH</name>
                        <description>The depth of the state machine TX/RX FIFOs, measured in words. 
                            Joining fifos via SHIFTCTRL_FJOIN gives one FIFO with double 
                            this depth.</description>
                        <bitRange>[5:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM0</name>
                <addressOffset>0x00000048</addressOffset>
                <description>Write-only access to instruction memory location 0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM0</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM1</name>
                <addressOffset>0x0000004c</addressOffset>
                <description>Write-only access to instruction memory location 1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM1</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM2</name>
                <addressOffset>0x00000050</addressOffset>
                <description>Write-only access to instruction memory location 2</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM2</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM3</name>
                <addressOffset>0x00000054</addressOffset>
                <description>Write-only access to instruction memory location 3</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM3</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM4</name>
                <addressOffset>0x00000058</addressOffset>
                <description>Write-only access to instruction memory location 4</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM4</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM5</name>
                <addressOffset>0x0000005c</addressOffset>
                <description>Write-only access to instruction memory location 5</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM5</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM6</name>
                <addressOffset>0x00000060</addressOffset>
                <description>Write-only access to instruction memory location 6</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM6</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM7</name>
                <addressOffset>0x00000064</addressOffset>
                <description>Write-only access to instruction memory location 7</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM7</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM8</name>
                <addressOffset>0x00000068</addressOffset>
                <description>Write-only access to instruction memory location 8</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM8</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM9</name>
                <addressOffset>0x0000006c</addressOffset>
                <description>Write-only access to instruction memory location 9</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM9</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM10</name>
                <addressOffset>0x00000070</addressOffset>
                <description>Write-only access to instruction memory location 10</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM10</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM11</name>
                <addressOffset>0x00000074</addressOffset>
                <description>Write-only access to instruction memory location 11</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM11</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM12</name>
                <addressOffset>0x00000078</addressOffset>
                <description>Write-only access to instruction memory location 12</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM12</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM13</name>
                <addressOffset>0x0000007c</addressOffset>
                <description>Write-only access to instruction memory location 13</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM13</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM14</name>
                <addressOffset>0x00000080</addressOffset>
                <description>Write-only access to instruction memory location 14</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM14</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM15</name>
                <addressOffset>0x00000084</addressOffset>
                <description>Write-only access to instruction memory location 15</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM15</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM16</name>
                <addressOffset>0x00000088</addressOffset>
                <description>Write-only access to instruction memory location 16</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM16</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM17</name>
                <addressOffset>0x0000008c</addressOffset>
                <description>Write-only access to instruction memory location 17</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM17</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM18</name>
                <addressOffset>0x00000090</addressOffset>
                <description>Write-only access to instruction memory location 18</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM18</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM19</name>
                <addressOffset>0x00000094</addressOffset>
                <description>Write-only access to instruction memory location 19</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM19</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM20</name>
                <addressOffset>0x00000098</addressOffset>
                <description>Write-only access to instruction memory location 20</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM20</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM21</name>
                <addressOffset>0x0000009c</addressOffset>
                <description>Write-only access to instruction memory location 21</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM21</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM22</name>
                <addressOffset>0x000000a0</addressOffset>
                <description>Write-only access to instruction memory location 22</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM22</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM23</name>
                <addressOffset>0x000000a4</addressOffset>
                <description>Write-only access to instruction memory location 23</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM23</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM24</name>
                <addressOffset>0x000000a8</addressOffset>
                <description>Write-only access to instruction memory location 24</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM24</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM25</name>
                <addressOffset>0x000000ac</addressOffset>
                <description>Write-only access to instruction memory location 25</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM25</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM26</name>
                <addressOffset>0x000000b0</addressOffset>
                <description>Write-only access to instruction memory location 26</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM26</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM27</name>
                <addressOffset>0x000000b4</addressOffset>
                <description>Write-only access to instruction memory location 27</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM27</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM28</name>
                <addressOffset>0x000000b8</addressOffset>
                <description>Write-only access to instruction memory location 28</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM28</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM29</name>
                <addressOffset>0x000000bc</addressOffset>
                <description>Write-only access to instruction memory location 29</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM29</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM30</name>
                <addressOffset>0x000000c0</addressOffset>
                <description>Write-only access to instruction memory location 30</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM30</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INSTR_MEM31</name>
                <addressOffset>0x000000c4</addressOffset>
                <description>Write-only access to instruction memory location 31</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INSTR_MEM31</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM0_CLKDIV</name>
                <addressOffset>0x000000c8</addressOffset>
                <description>Clock divisor register for state machine 0 
                    Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)</description>
                <resetValue>0x00010000</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <description>Effective frequency is sysclk/(int + frac/256). 
                            Value of 0 is interpreted as 65536. If INT is 0, FRAC must also be 0.</description>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <description>Fractional part of clock divisor</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
