raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Note this masking is applied in addition to the masking usually performed by the IN instruction. This is mainly useful for the MOV x, PINS instruction, which otherwise has no way of masking pins.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM1_ADDR</name>
                <addressOffset>0x000000ec</addressOffset>
                <description>Current instruction address of state machine 1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SM1_ADDR</name>
                        <bitRange>[4:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM1_INSTR</name>
                <addressOffset>0x000000f0</addressOffset>
                <description>Read to see the instruction currently addressed by state machine 1's program counter 
                    Write to execute an instruction immediately (including jumps) and then resume execution.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>SM1_INSTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM1_PINCTRL</name>
                <addressOffset>0x000000f4</addressOffset>
                <description>State machine pin control</description>
                <resetValue>0x14000000</resetValue>
                <fields>
                    <field>
                        <name>SIDESET_COUNT</name>
                        <description>The number of MSBs of the Delay/Side-set instruction field which are used for side-set. Inclusive of the enable bit, if present. Minimum of 0 (all delay bits, no side-set) and maximum of 5 (all side-set, no delay).</description>
                        <bitRange>[31:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SET_COUNT</name>
                        <description>The number of pins asserted by a SET. In the range 0 to 5 inclusive.</description>
                        <bitRange>[28:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUT_COUNT</name>
                        <description>The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV PINS instruction. In the range 0 to 32 inclusive.</description>
                        <bitRange>[25:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IN_BASE</name>
                        <description>The pin which is mapped to the least-significant bit of a state machine's IN data bus. Higher-numbered pins are mapped to consecutively more-significant data bits, with a modulo of 32 applied to pin number.</description>
                        <bitRange>[19:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SIDESET_BASE</name>
                        <description>The lowest-numbered pin that will be affected by a side-set operation. The MSBs of an instruction's side-set/delay field (up to 5, determined by SIDESET_COUNT) are used for side-set data, with the remaining LSBs used for delay. The least-significant bit of the side-set portion is the bit written to this pin, with more-significant bits written to higher-numbered pins.</description>
                        <bitRange>[14:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SET_BASE</name>
                        <description>The lowest-numbered pin that will be affected by a SET PINS or SET PINDIRS instruction. The data written to this pin is the least-significant bit of the SET data.</description>
                        <bitRange>[9:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUT_BASE</name>
                        <description>The lowest-numbered pin that will be affected by an OUT PINS, OUT PINDIRS or MOV PINS instruction. The data written to this pin will always be the least-significant bit of the OUT or MOV data.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM2_CLKDIV</name>
                <addressOffset>0x000000f8</addressOffset>
                <description>Clock divisor register for state machine 2 
                    Frequency = clock freq / (CLKDIV_INT + CLKDIV_FRAC / 256)</description>
                <resetValue>0x00010000</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <description>Effective frequency is sysclk/(int + frac/256). 
                            Value of 0 is interpreted as 65536. If INT is 0, FRAC must also be 0.</description>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <description>Fractional part of clock divisor</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM2_EXECCTRL</name>
                <addressOffset>0x000000fc</addressOffset>
                <description>Execution/behavioural settings for state machine 2</description>
                <resetValue>0x0001f000</resetValue>
                <fields>
                    <field>
                        <name>EXEC_STALLED</name>
                        <description>If 1, an instruction written to SMx_INSTR is stalled, and latched by the state machine. Will clear to 0 once this instruction completes.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SIDE_EN</name>
                        <description>If 1, the MSB of the Delay/Side-set instruction field is used as side-set enable, rather than a side-set data bit. This allows instructions to perform side-set optionally, rather than on every instruction, but the maximum possible side-set width is reduced from 5 to 4. Note that the value of PINCTRL_SIDESET_COUNT is inclusive of this enable bit.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SIDE_PINDIR</name>
                        <description>If 1, side-set data is asserted to pin directions, instead of pin values</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>JMP_PIN</name>
                        <description>The GPIO number to use as condition for JMP PIN. Unaffected by input mapping.</description>
                        <bitRange>[28:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUT_EN_SEL</name>
                        <description>Which data bit to use for inline OUT enable</description>
                        <bitRange>[23:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INLINE_OUT_EN</name>
                        <description>If 1, use a bit of OUT data as an auxiliary write enable 
                            When used in conjunction with OUT_STICKY, writes with an enable of 0 will 
                            deassert the latest pin write. This can create useful masking/override behaviour 
                            due to the priority ordering of state machine pin writes (SM0 &lt; SM1 &lt; ...)</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUT_STICKY</name>
                        <description>Continuously assert the most recent OUT/SET to the pins</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WRAP_TOP</name>
                        <description>After reaching this address, execution is wrapped to wrap_bottom. 
                            If the instruction is a jump, and the jump condition is true, the jump takes priority.</description>
                        <bitRange>[16:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>WRAP_BOTTOM</name>
                        <description>After reaching wrap_top, execution is wrapped to this address.</description>
                        <bitRange>[11:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STATUS_SEL</name>
                        <description>Comparison used for the MOV x, STATUS instruction.</description>
                        <bitRange>[6:5]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TXLEVEL</name>
                                <value>0</value>
                                <description>All-ones if TX FIFO level &lt; N, otherwise all-zeroes</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>RXLEVEL</name>
                                <value>1</value>
                                <description>All-ones if RX FIFO level &lt; N, otherwise all-zeroes</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>IRQ</name>
                                <value>2</value>
                                <description>All-ones if the indexed IRQ flag is raised, otherwise all-zeroes</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>STATUS_N</name>
                        <description>Comparison level or IRQ index for the MOV x, STATUS instruction.

                            If STATUS_SEL is TXLEVEL or RXLEVEL, then values of STATUS_N greater than the current FIFO depth are reserved, and have undefined behaviour.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>IRQ</name>
                                <value>0</value>
                                <description>Index 0-7 of an IRQ flag in this PIO block</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>IRQ_PREVPIO</name>
                                <value>8</value>
                                <description>Index 0-7 of an IRQ flag in the next lower-numbered PIO block</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>IRQ_NEXTPIO</name>
                                <value>16</value>
                                <description>Index 0-7 of an IRQ flag in the next higher-numbered PIO block</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM2_SHIFTCTRL</name>
                <addressOffset>0x00000100</addressOffset>
                <description>Control behaviour of the input/output shift registers for state machine 2</description>
                <resetValue>0x000c0000</resetValue>
                <fields>
                    <field>
                        <name>FJOIN_RX</name>
                        <description>When 1, RX FIFO steals the TX FIFO's storage, and becomes twice as deep. 
                            TX FIFO is disabled as a result (always reads as both full and empty). 
                            FIFOs are flushed when this bit is changed.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FJOIN_TX</name>
                        <description>When 1, TX FIFO steals the RX FIFO's storage, and becomes twice as deep. 
                            RX FIFO is disabled as a result (always reads as both full and empty). 
                            FIFOs are flushed when this bit is changed.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PULL_THRESH</name>
                        <description>Number of bits shifted out of OSR before autopull, or conditional pull (PULL IFEMPTY), will take place. 
                            Write 0 for value of 32.</description>
                        <bitRange>[29:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PUSH_THRESH</name>
                        <description>Number of bits shifted into ISR before autopush, or conditional push (PUSH IFFULL), will take place. 
                            Write 0 for value of 32.</description>
                        <bitRange>[24:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUT_SHIFTDIR</name>
                        <description>1 = shift out of output shift register to right. 0 = to left.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IN_SHIFTDIR</name>
                        <description>1 = shift input shift register to right (data enters from left). 0 = to left.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AUTOPULL</name>
                        <description>Pull automatically when the output shift register is emptied, i.e. on or following an OUT instruction which causes the output shift counter to reach or exceed PULL_THRESH.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AUTOPUSH</name>
                        <description>Push automatically when the input shift register is filled, i.e. on an IN instruction which causes the input shift counter to reach or exceed PUSH_THRESH.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FJOIN_RX_PUT</name>
                        <description>If 1, disable this state machine's RX FIFO, make its storage available for random write access by the state machine (using the `put` instruction) and, unless FJOIN_RX_GET is also set, random read access by the processor (through the RXFx_PUTGETy registers).

                            If FJOIN_RX_PUT and FJOIN_RX_GET are both set, then the RX FIFO's registers can be randomly read/written by the state machine, but are completely inaccessible to the processor.

                            Setting this bit will clear the FJOIN_TX and FJOIN_RX bits.</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FJOIN_RX_GET</name>
                        <description>If 1, disable this state machine's RX FIFO, make its storage available for random read access by the state machine (using the `get` instruction) and, unless FJOIN_RX_PUT is also set, random write access by the processor (through the RXFx_PUTGETy registers).

                            If FJOIN_RX_PUT and FJOIN_RX_GET are both set, then the RX FIFO's registers can be randomly read/written by the state machine, but are completely inaccessible to the processor.

                            Setting this bit will clear the FJOIN_TX and FJOIN_RX bits.</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IN_COUNT</name>
                        <description>Set the number of pins which are not masked to 0 when read by an IN PINS, WAIT PIN or MOV x, PINS instruction.

                            For example, an IN_COUNT of 5 means that the 5 LSBs of the IN pin group are visible (bits 4:0), but the remaining 27 MSBs are masked to 0. A count of 32 is encoded with a field value of 0, so the default behaviour is to not perform any masking.

