raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Note this masking is applied in addition to the masking usually performed by the IN instruction. This is mainly useful for the MOV x, PINS instruction, which otherwise has no way of masking pins.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM3_ADDR</name>
                <addressOffset>0x0000011c</addressOffset>
                <description>Current instruction address of state machine 3</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SM3_ADDR</name>
                        <bitRange>[4:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM3_INSTR</name>
                <addressOffset>0x00000120</addressOffset>
                <description>Read to see the instruction currently addressed by state machine 3's program counter 
                    Write to execute an instruction immediately (including jumps) and then resume execution.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>SM3_INSTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM3_PINCTRL</name>
                <addressOffset>0x00000124</addressOffset>
                <description>State machine pin control</description>
                <resetValue>0x14000000</resetValue>
                <fields>
                    <field>
                        <name>SIDESET_COUNT</name>
                        <description>The number of MSBs of the Delay/Side-set instruction field which are used for side-set. Inclusive of the enable bit, if present. Minimum of 0 (all delay bits, no side-set) and maximum of 5 (all side-set, no delay).</description>
                        <bitRange>[31:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SET_COUNT</name>
                        <description>The number of pins asserted by a SET. In the range 0 to 5 inclusive.</description>
                        <bitRange>[28:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUT_COUNT</name>
                        <description>The number of pins asserted by an OUT PINS, OUT PINDIRS or MOV PINS instruction. In the range 0 to 32 inclusive.</description>
                        <bitRange>[25:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IN_BASE</name>
                        <description>The pin which is mapped to the least-significant bit of a state machine's IN data bus. Higher-numbered pins are mapped to consecutively more-significant data bits, with a modulo of 32 applied to pin number.</description>
                        <bitRange>[19:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SIDESET_BASE</name>
                        <description>The lowest-numbered pin that will be affected by a side-set operation. The MSBs of an instruction's side-set/delay field (up to 5, determined by SIDESET_COUNT) are used for side-set data, with the remaining LSBs used for delay. The least-significant bit of the side-set portion is the bit written to this pin, with more-significant bits written to higher-numbered pins.</description>
                        <bitRange>[14:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SET_BASE</name>
                        <description>The lowest-numbered pin that will be affected by a SET PINS or SET PINDIRS instruction. The data written to this pin is the least-significant bit of the SET data.</description>
                        <bitRange>[9:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>OUT_BASE</name>
                        <description>The lowest-numbered pin that will be affected by an OUT PINS, OUT PINDIRS or MOV PINS instruction. The data written to this pin will always be the least-significant bit of the OUT or MOV data.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF0_PUTGET0</name>
                <addressOffset>0x00000128</addressOffset>
                <description>Direct read/write access to entry 0 of SM0's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF0_PUTGET0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF0_PUTGET1</name>
                <addressOffset>0x0000012c</addressOffset>
                <description>Direct read/write access to entry 1 of SM0's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF0_PUTGET1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF0_PUTGET2</name>
                <addressOffset>0x00000130</addressOffset>
                <description>Direct read/write access to entry 2 of SM0's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF0_PUTGET2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF0_PUTGET3</name>
                <addressOffset>0x00000134</addressOffset>
                <description>Direct read/write access to entry 3 of SM0's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF0_PUTGET3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF1_PUTGET0</name>
                <addressOffset>0x00000138</addressOffset>
                <description>Direct read/write access to entry 0 of SM1's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF1_PUTGET0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF1_PUTGET1</name>
                <addressOffset>0x0000013c</addressOffset>
                <description>Direct read/write access to entry 1 of SM1's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF1_PUTGET1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF1_PUTGET2</name>
                <addressOffset>0x00000140</addressOffset>
                <description>Direct read/write access to entry 2 of SM1's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF1_PUTGET2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF1_PUTGET3</name>
                <addressOffset>0x00000144</addressOffset>
                <description>Direct read/write access to entry 3 of SM1's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF1_PUTGET3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF2_PUTGET0</name>
                <addressOffset>0x00000148</addressOffset>
                <description>Direct read/write access to entry 0 of SM2's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF2_PUTGET0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF2_PUTGET1</name>
                <addressOffset>0x0000014c</addressOffset>
                <description>Direct read/write access to entry 1 of SM2's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF2_PUTGET1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF2_PUTGET2</name>
                <addressOffset>0x00000150</addressOffset>
                <description>Direct read/write access to entry 2 of SM2's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF2_PUTGET2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF2_PUTGET3</name>
                <addressOffset>0x00000154</addressOffset>
                <description>Direct read/write access to entry 3 of SM2's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF2_PUTGET3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF3_PUTGET0</name>
                <addressOffset>0x00000158</addressOffset>
                <description>Direct read/write access to entry 0 of SM3's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF3_PUTGET0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF3_PUTGET1</name>
                <addressOffset>0x0000015c</addressOffset>
                <description>Direct read/write access to entry 1 of SM3's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF3_PUTGET1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF3_PUTGET2</name>
                <addressOffset>0x00000160</addressOffset>
                <description>Direct read/write access to entry 2 of SM3's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF3_PUTGET2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RXF3_PUTGET3</name>
                <addressOffset>0x00000164</addressOffset>
                <description>Direct read/write access to entry 3 of SM3's RX FIFO, if SHIFTCTRL_FJOIN_RX_PUT xor SHIFTCTRL_FJOIN_RX_GET is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RXF3_PUTGET3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIOBASE</name>
                <addressOffset>0x00000168</addressOffset>
                <description>Relocate GPIO 0 (from PIO's point of view) in the system GPIO numbering, to access more than 32 GPIOs from PIO.

                    Only the values 0 and 16 are supported (only bit 4 is writable).</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIOBASE</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTR</name>
                <addressOffset>0x0000016c</addressOffset>
                <description>Raw Interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SM7</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM6</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM5</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM4</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM3</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM2</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM1</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM0</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM3_TXNFULL</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM2_TXNFULL</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM1_TXNFULL</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM0_TXNFULL</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM3_RXNEMPTY</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM2_RXNEMPTY</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM1_RXNEMPTY</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SM0_RXNEMPTY</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>IRQ0_INTE</name>
                <addressOffset>0x00000170</addressOffset>
                <description>Interrupt Enable for irq0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SM7</name>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM6</name>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM5</name>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM4</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM3</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM2</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM1</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM0</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM3_TXNFULL</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM2_TXNFULL</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM1_TXNFULL</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM0_TXNFULL</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM3_RXNEMPTY</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM2_RXNEMPTY</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM1_RXNEMPTY</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SM0_RXNEMPTY</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
