raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral derivedFrom="PLL_SYS">
        <name>PLL_USB</name>
        <baseAddress>0x40058000</baseAddress>
        <interrupt>
            <name>PLL_USB_IRQ</name>
            <value>43</value>
        </interrupt>
    </peripheral>
    <peripheral>
        <name>POWMAN</name>
        <description>Controls vreg, bor, lposc, chip resets &amp; xosc startup, powman and provides scratch register for general use and for bootcode use</description>
        <baseAddress>0x40100000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>240</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>POWMAN_IRQ_POW</name>
            <value>44</value>
        </interrupt>
        <interrupt>
            <name>POWMAN_IRQ_TIMER</name>
            <value>45</value>
        </interrupt>
        <registers>
            <register>
                <name>BADPASSWD</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Indicates a bad password has been used</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BADPASSWD</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>VREG_CTRL</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Voltage Regulator Control</description>
                <resetValue>0x00008050</resetValue>
                <fields>
                    <field>
                        <name>RST_N</name>
                        <description>returns the regulator to its startup settings 
                            0 - reset 
                            1 - not reset (default)</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UNLOCK</name>
                        <description>unlocks the VREG control interface after power up 
                            0 - Locked (default) 
                            1 - Unlocked 
                            It cannot be relocked when it is unlocked.</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ISOLATE</name>
                        <description>isolates the VREG control interface 
                            0 - not isolated (default) 
                            1 - isolated</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DISABLE_VOLTAGE_LIMIT</name>
                        <description>0=not disabled, 1=enabled</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HT_TH</name>
                        <description>high temperature protection threshold 
                            regulator power transistors are disabled when junction temperature exceeds threshold 
                            000 - 100C 
                            001 - 105C 
                            010 - 110C 
                            011 - 115C 
                            100 - 120C 
                            101 - 125C 
                            110 - 135C 
                            111 - 150C</description>
                        <bitRange>[6:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>VREG_STS</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Voltage Regulator Status</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>VOUT_OK</name>
                        <description>output regulation status 
                            0=not in regulation, 1=in regulation</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STARTUP</name>
                        <description>startup status 
                            0=startup complete, 1=starting up</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>VREG</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Voltage Regulator Settings</description>
                <resetValue>0x000000b0</resetValue>
                <fields>
                    <field>
                        <name>UPDATE_IN_PROGRESS</name>
                        <description>regulator state is being updated 
                            writes to the vreg register will be ignored when this field is set</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VSEL</name>
                        <description>output voltage select 
                            the regulator output voltage is limited to 1.3V unless the voltage limit 
                            is disabled using the disable_voltage_limit field in the vreg_ctrl register 
                            00000 - 0.55V 
                            00001 - 0.60V 
                            00010 - 0.65V 
                            00011 - 0.70V 
                            00100 - 0.75V 
                            00101 - 0.80V 
                            00110 - 0.85V 
                            00111 - 0.90V 
                            01000 - 0.95V 
                            01001 - 1.00V 
                            01010 - 1.05V 
                            01011 - 1.10V (default) 
                            01100 - 1.15V 
                            01101 - 1.20V 
                            01110 - 1.25V 
                            01111 - 1.30V 
                            10000 - 1.35V 
                            10001 - 1.40V 
                            10010 - 1.50V 
                            10011 - 1.60V 
                            10100 - 1.65V 
                            10101 - 1.70V 
                            10110 - 1.80V 
                            10111 - 1.90V 
                            11000 - 2.00V 
                            11001 - 2.35V 
                            11010 - 2.50V 
                            11011 - 2.65V 
                            11100 - 2.80V 
                            11101 - 3.00V 
                            11110 - 3.15V 
                            11111 - 3.30V</description>
                        <bitRange>[8:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HIZ</name>
                        <description>high impedance mode select 
                            0=not in high impedance mode, 1=in high impedance mode</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>VREG_LP_ENTRY</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Voltage Regulator Low Power Entry Settings</description>
                <resetValue>0x000000b4</resetValue>
                <fields>
                    <field>
                        <name>VSEL</name>
                        <description>output voltage select 
                            the regulator output voltage is limited to 1.3V unless the voltage limit 
                            is disabled using the disable_voltage_limit field in the vreg_ctrl register 
                            00000 - 0.55V 
                            00001 - 0.60V 
                            00010 - 0.65V 
                            00011 - 0.70V 
                            00100 - 0.75V 
                            00101 - 0.80V 
                            00110 - 0.85V 
                            00111 - 0.90V 
                            01000 - 0.95V 
                            01001 - 1.00V 
                            01010 - 1.05V 
                            01011 - 1.10V (default) 
                            01100 - 1.15V 
                            01101 - 1.20V 
                            01110 - 1.25V 
                            01111 - 1.30V 
                            10000 - 1.35V 
                            10001 - 1.40V 
                            10010 - 1.50V 
                            10011 - 1.60V 
                            10100 - 1.65V 
                            10101 - 1.70V 
                            10110 - 1.80V 
                            10111 - 1.90V 
                            11000 - 2.00V 
                            11001 - 2.35V 
                            11010 - 2.50V 
                            11011 - 2.65V 
                            11100 - 2.80V 
                            11101 - 3.00V 
                            11110 - 3.15V 
                            11111 - 3.30V</description>
                        <bitRange>[8:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>selects either normal (switching) mode or low power (linear) mode 
                            low power mode can only be selected for output voltages up to 1.3V 
                            0 = normal mode (switching) 
                            1 = low power mode (linear)</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HIZ</name>
                        <description>high impedance mode select 
                            0=not in high impedance mode, 1=in high impedance mode</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>VREG_LP_EXIT</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Voltage Regulator Low Power Exit Settings</description>
                <resetValue>0x000000b0</resetValue>
                <fields>
                    <field>
                        <name>VSEL</name>
                        <description>output voltage select 
                            the regulator output voltage is limited to 1.3V unless the voltage limit 
                            is disabled using the disable_voltage_limit field in the vreg_ctrl register 
                            00000 - 0.55V 
                            00001 - 0.60V 
                            00010 - 0.65V 
                            00011 - 0.70V 
                            00100 - 0.75V 
                            00101 - 0.80V 
                            00110 - 0.85V 
                            00111 - 0.90V 
                            01000 - 0.95V 
                            01001 - 1.00V 
                            01010 - 1.05V 
                            01011 - 1.10V (default) 
                            01100 - 1.15V 
                            01101 - 1.20V 
                            01110 - 1.25V 
                            01111 - 1.30V 
                            10000 - 1.35V 
                            10001 - 1.40V 
                            10010 - 1.50V 
                            10011 - 1.60V 
                            10100 - 1.65V 
                            10101 - 1.70V 
                            10110 - 1.80V 
                            10111 - 1.90V 
                            11000 - 2.00V 
                            11001 - 2.35V 
                            11010 - 2.50V 
                            11011 - 2.65V 
                            11100 - 2.80V 
                            11101 - 3.00V 
                            11110 - 3.15V 
                            11111 - 3.30V</description>
                        <bitRange>[8:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>selects either normal (switching) mode or low power (linear) mode 
                            low power mode can only be selected for output voltages up to 1.3V 
                            0 = normal mode (switching) 
                            1 = low power mode (linear)</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HIZ</name>
                        <description>high impedance mode select 
                            0=not in high impedance mode, 1=in high impedance mode</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOD_CTRL</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Brown-out Detection Control</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ISOLATE</name>
                        <description>isolates the brown-out detection control interface 
                            0 - not isolated (default) 
                            1 - isolated</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOD</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Brown-out Detection Settings</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>VSEL</name>
                        <description>threshold select 
                            00000 - 0.473V 
                            00001 - 0.516V 
                            00010 - 0.559V 
                            00011 - 0.602V 
                            00100 - 0.645VS 
                            00101 - 0.688V 
                            00110 - 0.731V 
                            00111 - 0.774V 
                            01000 - 0.817V 
                            01001 - 0.860V (default) 
                            01010 - 0.903V 
                            01011 - 0.946V 
                            01100 - 0.989V 
                            01101 - 1.032V 
                            01110 - 1.075V 
                            01111 - 1.118V 
                            10000 - 1.161 
                            10001 - 1.204V</description>
                        <bitRange>[8:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>enable brown-out detection 
                            0=not enabled, 1=enabled</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOD_LP_ENTRY</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Brown-out Detection Low Power Entry Settings</description>
                <resetValue>0x000000b0</resetValue>
                <fields>
                    <field>
                        <name>VSEL</name>
                        <description>threshold select 
                            00000 - 0.473V 
                            00001 - 0.516V 
                            00010 - 0.559V 
                            00011 - 0.602V 
                            00100 - 0.645VS 
                            00101 - 0.688V 
                            00110 - 0.731V 
                            00111 - 0.774V 
                            01000 - 0.817V 
                            01001 - 0.860V (default) 
                            01010 - 0.903V 
                            01011 - 0.946V 
                            01100 - 0.989V 
                            01101 - 1.032V 
                            01110 - 1.075V 
                            01111 - 1.118V 
                            10000 - 1.161 
                            10001 - 1.204V</description>
                        <bitRange>[8:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>enable brown-out detection 
                            0=not enabled, 1=enabled</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOD_LP_EXIT</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Brown-out Detection Low Power Exit Settings</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>VSEL</name>
                        <description>threshold select 
                            00000 - 0.473V 
                            00001 - 0.516V 
                            00010 - 0.559V 
                            00011 - 0.602V 
                            00100 - 0.645VS 
                            00101 - 0.688V 
                            00110 - 0.731V 
                            00111 - 0.774V 
                            01000 - 0.817V 
                            01001 - 0.860V (default) 
                            01010 - 0.903V 
                            01011 - 0.946V 
                            01100 - 0.989V 
                            01101 - 1.032V 
                            01110 - 1.075V 
                            01111 - 1.118V 
                            10000 - 1.161 
                            10001 - 1.204V</description>
                        <bitRange>[8:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>enable brown-out detection 
                            0=not enabled, 1=enabled</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>LPOSC</name>
                <addressOffset>0x00000028</addressOffset>
                <description>Low power oscillator control register.</description>
                <resetValue>0x00000203</resetValue>
                <fields>
                    <field>
                        <name>TRIM</name>
                        <description>Frequency trim - the trim step is typically 1% of the reset frequency, but can be up to 3%</description>
                        <bitRange>[9:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>This feature has been removed</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
