raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>TIMER</name>
                <addressOffset>0x00000088</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>USING_GPIO_1HZ</name>
                        <description>Timer is synchronised to a 1hz gpio source</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USING_GPIO_1KHZ</name>
                        <description>Timer is running from a 1khz gpio source</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USING_LPOSC</name>
                        <description>Timer is running from lposc</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USING_XOSC</name>
                        <description>Timer is running from xosc</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USE_GPIO_1HZ</name>
                        <description>Selects the gpio source as the reference for the sec counter. The msec counter will continue to use the lposc or xosc reference.</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USE_GPIO_1KHZ</name>
                        <description>switch to gpio as the source of the 1kHz timer tick</description>
                        <bitRange>[10:10]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USE_XOSC</name>
                        <description>switch to xosc as the source of the 1kHz timer tick</description>
                        <bitRange>[9:9]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USE_LPOSC</name>
                        <description>Switch to lposc as the source of the 1kHz timer tick</description>
                        <bitRange>[8:8]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>ALARM</name>
                        <description>Alarm has fired. Write to 1 to clear the alarm.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>PWRUP_ON_ALARM</name>
                        <description>Alarm wakes the chip from low power mode</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ALARM_ENAB</name>
                        <description>Enables the alarm. The alarm must be disabled while writing the alarm time.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLEAR</name>
                        <description>Clears the timer, does not disable the timer and does not affect the alarm. This control can be written at any time.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>RUN</name>
                        <description>Timer enable. Setting this bit causes the timer to begin counting up from its current value. Clearing this bit stops the timer from counting.

                            Before enabling the timer, set the POWMAN_LPOSC_FREQ* and POWMAN_XOSC_FREQ* registers to configure the count rate, and initialise the current time by writing to SET_TIME_63TO48 through SET_TIME_15TO0. You must not write to the SET_TIME_x registers when the timer is running.

                            Once configured, start the timer by setting POWMAN_TIMER_RUN=1. This will start the timer running from the LPOSC. When the XOSC is available switch the reference clock to XOSC then select it as the timer clock by setting POWMAN_TIMER_USE_XOSC=1</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NONSEC_WRITE</name>
                        <description>Control whether Non-secure software can write to the timer registers. All other registers are hardwired to be inaccessible to Non-secure.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PWRUP0</name>
                <addressOffset>0x0000008c</addressOffset>
                <description>4 GPIO powerup events can be configured to wake the chip up from a low power state. 
                    The pwrups are level/edge sensitive and can be set to trigger on a high/rising or low/falling event 
                    The number of gpios available depends on the package option. An invalid selection will be ignored 
                    source = 0 selects gpio0 
                    . 
                    . 
                    source = 47 selects gpio47 
                    source = 48 selects qspi_ss 
                    source = 49 selects qspi_sd0 
                    source = 50 selects qspi_sd1 
                    source = 51 selects qspi_sd2 
                    source = 52 selects qspi_sd3 
                    source = 53 selects qspi_sclk 
                    level  = 0 triggers the pwrup when the source is low 
                    level  = 1 triggers the pwrup when the source is high</description>
                <resetValue>0x0000003f</resetValue>
                <fields>
                    <field>
                        <name>RAW_STATUS</name>
                        <description>Value of selected gpio pin (only if enable == 1)</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STATUS</name>
                        <description>Status of gpio wakeup. Write to 1 to clear a latched edge detect.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>Edge or level detect. Edge will detect a 0 to 1 transition (or 1 to 0 transition). Level will detect a 1 or 0. Both types of event get latched into the current_pwrup_req register.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>level</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>edge</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DIRECTION</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>low_falling</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>high_rising</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Set to 1 to enable the wakeup source. Set to 0 to disable the wakeup source and clear a pending wakeup event. 
                            If using edge detect a latched edge needs to be cleared by writing 1 to the status register also.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SOURCE</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PWRUP1</name>
                <addressOffset>0x00000090</addressOffset>
                <description>4 GPIO powerup events can be configured to wake the chip up from a low power state. 
                    The pwrups are level/edge sensitive and can be set to trigger on a high/rising or low/falling event 
                    The number of gpios available depends on the package option. An invalid selection will be ignored 
                    source = 0 selects gpio0 
                    . 
                    . 
                    source = 47 selects gpio47 
                    source = 48 selects qspi_ss 
                    source = 49 selects qspi_sd0 
                    source = 50 selects qspi_sd1 
                    source = 51 selects qspi_sd2 
                    source = 52 selects qspi_sd3 
                    source = 53 selects qspi_sclk 
                    level  = 0 triggers the pwrup when the source is low 
                    level  = 1 triggers the pwrup when the source is high</description>
                <resetValue>0x0000003f</resetValue>
                <fields>
                    <field>
                        <name>RAW_STATUS</name>
                        <description>Value of selected gpio pin (only if enable == 1)</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STATUS</name>
                        <description>Status of gpio wakeup. Write to 1 to clear a latched edge detect.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>Edge or level detect. Edge will detect a 0 to 1 transition (or 1 to 0 transition). Level will detect a 1 or 0. Both types of event get latched into the current_pwrup_req register.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>level</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>edge</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DIRECTION</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>low_falling</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>high_rising</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Set to 1 to enable the wakeup source. Set to 0 to disable the wakeup source and clear a pending wakeup event. 
                            If using edge detect a latched edge needs to be cleared by writing 1 to the status register also.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SOURCE</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PWRUP2</name>
                <addressOffset>0x00000094</addressOffset>
                <description>4 GPIO powerup events can be configured to wake the chip up from a low power state. 
                    The pwrups are level/edge sensitive and can be set to trigger on a high/rising or low/falling event 
                    The number of gpios available depends on the package option. An invalid selection will be ignored 
                    source = 0 selects gpio0 
                    . 
                    . 
                    source = 47 selects gpio47 
                    source = 48 selects qspi_ss 
                    source = 49 selects qspi_sd0 
                    source = 50 selects qspi_sd1 
                    source = 51 selects qspi_sd2 
                    source = 52 selects qspi_sd3 
                    source = 53 selects qspi_sclk 
                    level  = 0 triggers the pwrup when the source is low 
                    level  = 1 triggers the pwrup when the source is high</description>
                <resetValue>0x0000003f</resetValue>
                <fields>
                    <field>
                        <name>RAW_STATUS</name>
                        <description>Value of selected gpio pin (only if enable == 1)</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STATUS</name>
                        <description>Status of gpio wakeup. Write to 1 to clear a latched edge detect.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>Edge or level detect. Edge will detect a 0 to 1 transition (or 1 to 0 transition). Level will detect a 1 or 0. Both types of event get latched into the current_pwrup_req register.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>level</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>edge</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DIRECTION</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>low_falling</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>high_rising</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Set to 1 to enable the wakeup source. Set to 0 to disable the wakeup source and clear a pending wakeup event. 
                            If using edge detect a latched edge needs to be cleared by writing 1 to the status register also.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SOURCE</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PWRUP3</name>
                <addressOffset>0x00000098</addressOffset>
                <description>4 GPIO powerup events can be configured to wake the chip up from a low power state. 
                    The pwrups are level/edge sensitive and can be set to trigger on a high/rising or low/falling event 
                    The number of gpios available depends on the package option. An invalid selection will be ignored 
                    source = 0 selects gpio0 
                    . 
                    . 
                    source = 47 selects gpio47 
                    source = 48 selects qspi_ss 
                    source = 49 selects qspi_sd0 
                    source = 50 selects qspi_sd1 
                    source = 51 selects qspi_sd2 
                    source = 52 selects qspi_sd3 
                    source = 53 selects qspi_sclk 
                    level  = 0 triggers the pwrup when the source is low 
                    level  = 1 triggers the pwrup when the source is high</description>
                <resetValue>0x0000003f</resetValue>
                <fields>
                    <field>
                        <name>RAW_STATUS</name>
                        <description>Value of selected gpio pin (only if enable == 1)</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STATUS</name>
                        <description>Status of gpio wakeup. Write to 1 to clear a latched edge detect.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>MODE</name>
                        <description>Edge or level detect. Edge will detect a 0 to 1 transition (or 1 to 0 transition). Level will detect a 1 or 0. Both types of event get latched into the current_pwrup_req register.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>level</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>edge</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DIRECTION</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>low_falling</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>high_rising</name>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Set to 1 to enable the wakeup source. Set to 0 to disable the wakeup source and clear a pending wakeup event. 
                            If using edge detect a latched edge needs to be cleared by writing 1 to the status register also.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SOURCE</name>
                        <bitRange>[5:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CURRENT_PWRUP_REQ</name>
                <addressOffset>0x0000009c</addressOffset>
                <description>Indicates current powerup request state 
                    pwrup events can be cleared by removing the enable from the pwrup register. The alarm pwrup req can be cleared by clearing timer.alarm_enab 
                    0 = chip reset, for the source of the last reset see POWMAN_CHIP_RESET 
                    1 = pwrup0 
                    2 = pwrup1 
                    3 = pwrup2 
                    4 = pwrup3 
                    5 = coresight_pwrup 
                    6 = alarm_pwrup</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CURRENT_PWRUP_REQ</name>
                        <bitRange>[6:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
