raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>LAST_SWCORE_PWRUP</name>
                <addressOffset>0x000000a0</addressOffset>
                <description>Indicates which pwrup source triggered the last switched-core power up 
                    0 = chip reset, for the source of the last reset see POWMAN_CHIP_RESET 
                    1 = pwrup0 
                    2 = pwrup1 
                    3 = pwrup2 
                    4 = pwrup3 
                    5 = coresight_pwrup 
                    6 = alarm_pwrup</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LAST_SWCORE_PWRUP</name>
                        <bitRange>[6:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DBG_PWRCFG</name>
                <addressOffset>0x000000a4</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IGNORE</name>
                        <description>Ignore pwrup req from debugger. If pwrup req is asserted then this will prevent power down and set powerdown blocked. Set ignore to stop paying attention to pwrup_req</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOTDIS</name>
                <addressOffset>0x000000a8</addressOffset>
                <description>Tell the bootrom to ignore the BOOT0..3 registers following the next RSM reset (e.g. the next core power down/up).

                    If an early boot stage has soft-locked some OTP pages in order to protect their contents from later stages, there is a risk that Secure code running at a later stage can unlock the pages by powering the core up and down.

                    This register can be used to ensure that the bootloader runs as normal on the next power up, preventing Secure code at a later stage from accessing OTP in its unlocked state.

                    Should be used in conjunction with the OTP BOOTDIS register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NEXT</name>
                        <description>This flag always ORs writes into its current contents. It can be set but not cleared by software.

                            The BOOTDIS_NEXT bit is OR'd into the BOOTDIS_NOW bit when the core is powered down. Simultaneously, the BOOTDIS_NEXT bit is cleared. Setting this bit means that the BOOT0..3 registers will be ignored following the next reset of the RSM by powman.

                            This flag should be set by an early boot stage that has soft-locked OTP pages, to prevent later stages from unlocking it by power cycling.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NOW</name>
                        <description>When powman resets the RSM, the current value of BOOTDIS_NEXT is OR'd into BOOTDIS_NOW, and BOOTDIS_NEXT is cleared.

                            The bootrom checks this flag before reading the BOOT0..3 registers. If it is set, the bootrom clears it, and ignores the BOOT registers. This prevents Secure software from diverting the boot path before a bootloader has had the chance to soft lock OTP pages containing sensitive data.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>DBGCONFIG</name>
                <addressOffset>0x000000ac</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DP_INSTID</name>
                        <description>Configure DP instance ID for SWD multidrop selection. 
                            Recommend that this is NOT changed until you require debug access in multi-chip environment</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH0</name>
                <addressOffset>0x000000b0</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH1</name>
                <addressOffset>0x000000b4</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH2</name>
                <addressOffset>0x000000b8</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH3</name>
                <addressOffset>0x000000bc</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH4</name>
                <addressOffset>0x000000c0</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH4</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH5</name>
                <addressOffset>0x000000c4</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH6</name>
                <addressOffset>0x000000c8</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH7</name>
                <addressOffset>0x000000cc</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOT0</name>
                <addressOffset>0x000000d0</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOT0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOT1</name>
                <addressOffset>0x000000d4</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOT1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOT2</name>
                <addressOffset>0x000000d8</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOT2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>BOOT3</name>
                <addressOffset>0x000000dc</addressOffset>
                <description>Scratch register. Information persists in low power mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOT3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTR</name>
                <addressOffset>0x000000e0</addressOffset>
                <description>Raw Interrupts</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PWRUP_WHILE_WAITING</name>
                        <description>Source is state.pwrup_while_waiting</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STATE_REQ_IGNORED</name>
                        <description>Source is state.req_ignored</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TIMER</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VREG_OUTPUT_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTE</name>
                <addressOffset>0x000000e4</addressOffset>
                <description>Interrupt Enable</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PWRUP_WHILE_WAITING</name>
                        <description>Source is state.pwrup_while_waiting</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STATE_REQ_IGNORED</name>
                        <description>Source is state.req_ignored</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TIMER</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VREG_OUTPUT_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTF</name>
                <addressOffset>0x000000e8</addressOffset>
                <description>Interrupt Force</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PWRUP_WHILE_WAITING</name>
                        <description>Source is state.pwrup_while_waiting</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STATE_REQ_IGNORED</name>
                        <description>Source is state.req_ignored</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TIMER</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VREG_OUTPUT_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTS</name>
                <addressOffset>0x000000ec</addressOffset>
                <description>Interrupt status after masking &amp; forcing</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PWRUP_WHILE_WAITING</name>
                        <description>Source is state.pwrup_while_waiting</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STATE_REQ_IGNORED</name>
                        <description>Source is state.req_ignored</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TIMER</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VREG_OUTPUT_LOW</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
