raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>PPB</name>
        <description>TEAL registers accessible through the debug interface</description>
        <baseAddress>0xe0000000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>274432</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>ITM_STIM0</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM1</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM2</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM3</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM4</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM5</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM6</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM7</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM8</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM9</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM10</name>
                <addressOffset>0x00000028</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM11</name>
                <addressOffset>0x0000002c</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM12</name>
                <addressOffset>0x00000030</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM13</name>
                <addressOffset>0x00000034</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM14</name>
                <addressOffset>0x00000038</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM15</name>
                <addressOffset>0x0000003c</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM16</name>
                <addressOffset>0x00000040</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM17</name>
                <addressOffset>0x00000044</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM18</name>
                <addressOffset>0x00000048</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM19</name>
                <addressOffset>0x0000004c</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM20</name>
                <addressOffset>0x00000050</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM21</name>
                <addressOffset>0x00000054</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM22</name>
                <addressOffset>0x00000058</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM23</name>
                <addressOffset>0x0000005c</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM24</name>
                <addressOffset>0x00000060</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM25</name>
                <addressOffset>0x00000064</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM26</name>
                <addressOffset>0x00000068</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM27</name>
                <addressOffset>0x0000006c</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM28</name>
                <addressOffset>0x00000070</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITM_STIM29</name>
                <addressOffset>0x00000074</addressOffset>
                <description>Provides the interface for generating Instrumentation packets</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STIMULUS</name>
                        <description>Data to write to the Stimulus Port FIFO, for forwarding as an Instrumentation packet. The size of write access determines the type of Instrumentation packet generated.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
