raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>DWT_CTRL</name>
                <addressOffset>0x00001000</addressOffset>
                <description>Provides configuration and status information for the DWT unit, and used to control features of the unit</description>
                <resetValue>0x73741824</resetValue>
                <fields>
                    <field>
                        <name>NUMCOMP</name>
                        <description>Number of DWT comparators implemented</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NOTRCPKT</name>
                        <description>Indicates whether the implementation does not support trace</description>
                        <bitRange>[27:27]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NOEXTTRIG</name>
                        <description>Reserved, RAZ</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NOCYCCNT</name>
                        <description>Indicates whether the implementation does not include a cycle counter</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NOPRFCNT</name>
                        <description>Indicates whether the implementation does not include the profiling counters</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CYCDISS</name>
                        <description>Controls whether the cycle counter is disabled in Secure state</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CYCEVTENA</name>
                        <description>Enables Event Counter packet generation on POSTCNT underflow</description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FOLDEVTENA</name>
                        <description>Enables DWT_FOLDCNT counter</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSUEVTENA</name>
                        <description>Enables DWT_LSUCNT counter</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SLEEPEVTENA</name>
                        <description>Enable DWT_SLEEPCNT counter</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EXCEVTENA</name>
                        <description>Enables DWT_EXCCNT counter</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CPIEVTENA</name>
                        <description>Enables DWT_CPICNT counter</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EXTTRCENA</name>
                        <description>Enables generation of Exception Trace packets</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PCSAMPLENA</name>
                        <description>Enables use of POSTCNT counter as a timer for Periodic PC Sample packet generation</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SYNCTAP</name>
                        <description>Selects the position of the synchronization packet counter tap on the CYCCNT counter. This determines the Synchronization packet rate</description>
                        <bitRange>[11:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CYCTAP</name>
                        <description>Selects the position of the POSTCNT tap on the CYCCNT counter</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>POSTINIT</name>
                        <description>Initial value for the POSTCNT counter</description>
                        <bitRange>[8:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>POSTPRESET</name>
                        <description>Reload value for the POSTCNT counter</description>
                        <bitRange>[4:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CYCCNTENA</name>
                        <description>Enables CYCCNT</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_CYCCNT</name>
                <addressOffset>0x00001004</addressOffset>
                <description>Shows or sets the value of the processor cycle counter, CYCCNT</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CYCCNT</name>
                        <description>Increments one on each processor clock cycle when DWT_CTRL.CYCCNTENA == 1 and DEMCR.TRCENA == 1. On overflow, CYCCNT wraps to zero</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_EXCCNT</name>
                <addressOffset>0x0000100c</addressOffset>
                <description>Counts the total cycles spent in exception processing</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EXCCNT</name>
                        <description>Counts one on each cycle when all of the following are true: - DWT_CTRL.EXCEVTENA == 1 and DEMCR.TRCENA == 1. - No instruction is executed, see DWT_CPICNT. - An exception-entry or exception-exit related operation is in progress. - Either SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the operation is set to Non-secure and NoninvasiveDebugAllowed() == TRUE.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_LSUCNT</name>
                <addressOffset>0x00001014</addressOffset>
                <description>Increments on the additional cycles required to execute all load or store instructions</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LSUCNT</name>
                        <description>Counts one on each cycle when all of the following are true: - DWT_CTRL.LSUEVTENA == 1 and DEMCR.TRCENA == 1. - No instruction is executed, see DWT_CPICNT. - No exception-entry or exception-exit operation is in progress, see DWT_EXCCNT. - A load-store operation is in progress. - Either SecureNoninvasiveDebugAllowed() == TRUE, or NS-Req for the operation is set to Non-secure and NoninvasiveDebugAllowed() == TRUE.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_FOLDCNT</name>
                <addressOffset>0x00001018</addressOffset>
                <description>Increments on the additional cycles required to execute all load or store instructions</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FOLDCNT</name>
                        <description>Counts on each cycle when all of the following are true: - DWT_CTRL.FOLDEVTENA == 1 and DEMCR.TRCENA == 1. - At least two instructions are executed, see DWT_CPICNT. - Either SecureNoninvasiveDebugAllowed() == TRUE, or the PE is in Non-secure state and NoninvasiveDebugAllowed() == TRUE. The counter is incremented by the number of instructions executed, minus one</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_COMP0</name>
                <addressOffset>0x00001020</addressOffset>
                <description>Provides a reference value for use by watchpoint comparator 0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DWT_COMP0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_FUNCTION0</name>
                <addressOffset>0x00001028</addressOffset>
                <description>Controls the operation of watchpoint comparator 0</description>
                <resetValue>0x58000000</resetValue>
                <fields>
                    <field>
                        <name>ID</name>
                        <description>Identifies the capabilities for MATCH for comparator *n</description>
                        <bitRange>[31:27]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MATCHED</name>
                        <description>Set to 1 when the comparator matches</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DATAVSIZE</name>
                        <description>Defines the size of the object being watched for by Data Value and Data Address comparators</description>
                        <bitRange>[11:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ACTION</name>
                        <description>Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MATCH</name>
                        <description>Controls the type of match generated by this comparator</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_COMP1</name>
                <addressOffset>0x00001030</addressOffset>
                <description>Provides a reference value for use by watchpoint comparator 1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DWT_COMP1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_FUNCTION1</name>
                <addressOffset>0x00001038</addressOffset>
                <description>Controls the operation of watchpoint comparator 1</description>
                <resetValue>0x89000828</resetValue>
                <fields>
                    <field>
                        <name>ID</name>
                        <description>Identifies the capabilities for MATCH for comparator *n</description>
                        <bitRange>[31:27]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MATCHED</name>
                        <description>Set to 1 when the comparator matches</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DATAVSIZE</name>
                        <description>Defines the size of the object being watched for by Data Value and Data Address comparators</description>
                        <bitRange>[11:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ACTION</name>
                        <description>Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MATCH</name>
                        <description>Controls the type of match generated by this comparator</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_COMP2</name>
                <addressOffset>0x00001040</addressOffset>
                <description>Provides a reference value for use by watchpoint comparator 2</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DWT_COMP2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_FUNCTION2</name>
                <addressOffset>0x00001048</addressOffset>
                <description>Controls the operation of watchpoint comparator 2</description>
                <resetValue>0x50000000</resetValue>
                <fields>
                    <field>
                        <name>ID</name>
                        <description>Identifies the capabilities for MATCH for comparator *n</description>
                        <bitRange>[31:27]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MATCHED</name>
                        <description>Set to 1 when the comparator matches</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DATAVSIZE</name>
                        <description>Defines the size of the object being watched for by Data Value and Data Address comparators</description>
                        <bitRange>[11:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ACTION</name>
                        <description>Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MATCH</name>
                        <description>Controls the type of match generated by this comparator</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_COMP3</name>
                <addressOffset>0x00001050</addressOffset>
                <description>Provides a reference value for use by watchpoint comparator 3</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DWT_COMP3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_FUNCTION3</name>
                <addressOffset>0x00001058</addressOffset>
                <description>Controls the operation of watchpoint comparator 3</description>
                <resetValue>0x20000800</resetValue>
                <fields>
                    <field>
                        <name>ID</name>
                        <description>Identifies the capabilities for MATCH for comparator *n</description>
                        <bitRange>[31:27]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MATCHED</name>
                        <description>Set to 1 when the comparator matches</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DATAVSIZE</name>
                        <description>Defines the size of the object being watched for by Data Value and Data Address comparators</description>
                        <bitRange>[11:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ACTION</name>
                        <description>Defines the action on a match. This field is ignored and the comparator generates no actions if it is disabled by MATCH</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MATCH</name>
                        <description>Controls the type of match generated by this comparator</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_DEVARCH</name>
                <addressOffset>0x00001fbc</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x47701a02</resetValue>
                <fields>
                    <field>
                        <name>ARCHITECT</name>
                        <description>Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
                        <bitRange>[31:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRESENT</name>
                        <description>Defines that the DEVARCH register is present</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REVISION</name>
                        <description>Defines the architecture revision of the component</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHVER</name>
                        <description>Defines the architecture version of the component</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHPART</name>
                        <description>Defines the architecture of the component</description>
                        <bitRange>[11:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_DEVTYPE</name>
                <addressOffset>0x00001fcc</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SUB</name>
                        <description>Component sub-type</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MAJOR</name>
                        <description>Component major type</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_PIDR4</name>
                <addressOffset>0x00001fd0</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>SIZE</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_2</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
