raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>DWT_PIDR5</name>
                <addressOffset>0x00001fd4</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DWT_PIDR5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_PIDR6</name>
                <addressOffset>0x00001fd8</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DWT_PIDR6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_PIDR7</name>
                <addressOffset>0x00001fdc</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DWT_PIDR7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_PIDR0</name>
                <addressOffset>0x00001fe0</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x00000021</resetValue>
                <fields>
                    <field>
                        <name>PART_0</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_PIDR1</name>
                <addressOffset>0x00001fe4</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x000000bd</resetValue>
                <fields>
                    <field>
                        <name>DES_0</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PART_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_PIDR2</name>
                <addressOffset>0x00001fe8</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x0000000b</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>JEDEC</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_PIDR3</name>
                <addressOffset>0x00001fec</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REVAND</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CMOD</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_CIDR0</name>
                <addressOffset>0x00001ff0</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_0</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_CIDR1</name>
                <addressOffset>0x00001ff4</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x00000090</resetValue>
                <fields>
                    <field>
                        <name>CLASS</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRMBL_1</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_CIDR2</name>
                <addressOffset>0x00001ff8</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_2</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DWT_CIDR3</name>
                <addressOffset>0x00001ffc</addressOffset>
                <description>Provides CoreSight discovery information for the DWT</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_3</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_CTRL</name>
                <addressOffset>0x00002000</addressOffset>
                <description>Provides FPB implementation information, and the global enable for the FPB unit</description>
                <resetValue>0x60005580</resetValue>
                <fields>
                    <field>
                        <name>REV</name>
                        <description>Flash Patch and Breakpoint Unit architecture revision</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUM_CODE_14_12_</name>
                        <description>Indicates the number of implemented instruction address comparators. Zero indicates no Instruction Address comparators are implemented. The Instruction Address comparators are numbered from 0 to NUM_CODE - 1</description>
                        <bitRange>[14:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUM_LIT</name>
                        <description>Indicates the number of implemented literal address comparators. The Literal Address comparators are numbered from NUM_CODE to NUM_CODE + NUM_LIT - 1</description>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUM_CODE_7_4_</name>
                        <description>Indicates the number of implemented instruction address comparators. Zero indicates no Instruction Address comparators are implemented. The Instruction Address comparators are numbered from 0 to NUM_CODE - 1</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>KEY</name>
                        <description>Writes to the FP_CTRL are ignored unless KEY is concurrently written to one</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Enables the FPB</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_REMAP</name>
                <addressOffset>0x00002004</addressOffset>
                <description>Indicates whether the implementation supports Flash Patch remap and, if it does, holds the target address for remap</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RMPSPT</name>
                        <description>Indicates whether the FPB unit supports the Flash Patch remap function</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REMAP</name>
                        <description>Holds the bits[28:5] of the Flash Patch remap address</description>
                        <bitRange>[28:5]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_COMP0</name>
                <addressOffset>0x00002008</addressOffset>
                <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BE</name>
                        <description>Selects between flashpatch and breakpoint functionality</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_COMP1</name>
                <addressOffset>0x0000200c</addressOffset>
                <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BE</name>
                        <description>Selects between flashpatch and breakpoint functionality</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_COMP2</name>
                <addressOffset>0x00002010</addressOffset>
                <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BE</name>
                        <description>Selects between flashpatch and breakpoint functionality</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_COMP3</name>
                <addressOffset>0x00002014</addressOffset>
                <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BE</name>
                        <description>Selects between flashpatch and breakpoint functionality</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_COMP4</name>
                <addressOffset>0x00002018</addressOffset>
                <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BE</name>
                        <description>Selects between flashpatch and breakpoint functionality</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_COMP5</name>
                <addressOffset>0x0000201c</addressOffset>
                <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BE</name>
                        <description>Selects between flashpatch and breakpoint functionality</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_COMP6</name>
                <addressOffset>0x00002020</addressOffset>
                <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BE</name>
                        <description>Selects between flashpatch and breakpoint functionality</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_COMP7</name>
                <addressOffset>0x00002024</addressOffset>
                <description>Holds an address for comparison. The effect of the match depends on the configuration of the FPB and whether the comparator is an instruction address comparator or a literal address comparator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BE</name>
                        <description>Selects between flashpatch and breakpoint functionality</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_DEVARCH</name>
                <addressOffset>0x00002fbc</addressOffset>
                <description>Provides CoreSight discovery information for the FPB</description>
                <resetValue>0x47701a03</resetValue>
                <fields>
                    <field>
                        <name>ARCHITECT</name>
                        <description>Defines the architect of the component. Bits [31:28] are the JEP106 continuation code (JEP106 bank ID, minus 1) and bits [27:21] are the JEP106 ID code.</description>
                        <bitRange>[31:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRESENT</name>
                        <description>Defines that the DEVARCH register is present</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REVISION</name>
                        <description>Defines the architecture revision of the component</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHVER</name>
                        <description>Defines the architecture version of the component</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHPART</name>
                        <description>Defines the architecture of the component</description>
                        <bitRange>[11:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_DEVTYPE</name>
                <addressOffset>0x00002fcc</addressOffset>
                <description>Provides CoreSight discovery information for the FPB</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SUB</name>
                        <description>Component sub-type</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MAJOR</name>
                        <description>Component major type</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_PIDR4</name>
                <addressOffset>0x00002fd0</addressOffset>
                <description>Provides CoreSight discovery information for the FP</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>SIZE</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_2</name>
                        <description>See CoreSight Architecture Specification</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_PIDR5</name>
                <addressOffset>0x00002fd4</addressOffset>
                <description>Provides CoreSight discovery information for the FP</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FP_PIDR5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_PIDR6</name>
                <addressOffset>0x00002fd8</addressOffset>
                <description>Provides CoreSight discovery information for the FP</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FP_PIDR6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FP_PIDR7</name>
                <addressOffset>0x00002fdc</addressOffset>
                <description>Provides CoreSight discovery information for the FP</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FP_PIDR7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
