raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>NVIC_IPR0</name>
                <addressOffset>0x0000e400</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR1</name>
                <addressOffset>0x0000e404</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR2</name>
                <addressOffset>0x0000e408</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR3</name>
                <addressOffset>0x0000e40c</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR4</name>
                <addressOffset>0x0000e410</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR5</name>
                <addressOffset>0x0000e414</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR6</name>
                <addressOffset>0x0000e418</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR7</name>
                <addressOffset>0x0000e41c</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR8</name>
                <addressOffset>0x0000e420</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR9</name>
                <addressOffset>0x0000e424</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR10</name>
                <addressOffset>0x0000e428</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR11</name>
                <addressOffset>0x0000e42c</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>NVIC_IPR12</name>
                <addressOffset>0x0000e430</addressOffset>
                <description>Sets or reads interrupt priorities</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PRI_N3</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+3, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N2</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+2, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N1</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+1, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRI_N0</name>
                        <description>For register NVIC_IPRn, the priority of interrupt number 4*n+0, or RES0 if the PE does not implement this interrupt</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
