raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>MPU_RBAR_A1</name>
                <addressOffset>0x0000eda4</addressOffset>
                <description>Provides indirect read and write access to the base address of the MPU region selected by MPU_RNR[7:2]:(1[1:0]) `FTSSS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BASE</name>
                        <description>Contains bits [31:5] of the lower inclusive limit of the selected MPU memory region. This value is zero extended to provide the base address to be checked against</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SH</name>
                        <description>Defines the Shareability domain of this region for Normal memory</description>
                        <bitRange>[4:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AP</name>
                        <description>Defines the access permissions for this region</description>
                        <bitRange>[2:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>XN</name>
                        <description>Defines whether code can be executed from this region</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_RLAR_A1</name>
                <addressOffset>0x0000eda8</addressOffset>
                <description>Provides indirect read and write access to the limit address of the currently selected MPU region selected by MPU_RNR[7:2]:(1[1:0]) `FTSSS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LIMIT</name>
                        <description>Contains bits [31:5] of the upper inclusive limit of the selected MPU memory region. This value is postfixed with 0x1F to provide the limit address to be checked against</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTRINDX</name>
                        <description>Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1 fields</description>
                        <bitRange>[3:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Region enable</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_RBAR_A2</name>
                <addressOffset>0x0000edac</addressOffset>
                <description>Provides indirect read and write access to the base address of the MPU region selected by MPU_RNR[7:2]:(2[1:0]) `FTSSS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BASE</name>
                        <description>Contains bits [31:5] of the lower inclusive limit of the selected MPU memory region. This value is zero extended to provide the base address to be checked against</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SH</name>
                        <description>Defines the Shareability domain of this region for Normal memory</description>
                        <bitRange>[4:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AP</name>
                        <description>Defines the access permissions for this region</description>
                        <bitRange>[2:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>XN</name>
                        <description>Defines whether code can be executed from this region</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_RLAR_A2</name>
                <addressOffset>0x0000edb0</addressOffset>
                <description>Provides indirect read and write access to the limit address of the currently selected MPU region selected by MPU_RNR[7:2]:(2[1:0]) `FTSSS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LIMIT</name>
                        <description>Contains bits [31:5] of the upper inclusive limit of the selected MPU memory region. This value is postfixed with 0x1F to provide the limit address to be checked against</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTRINDX</name>
                        <description>Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1 fields</description>
                        <bitRange>[3:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Region enable</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_RBAR_A3</name>
                <addressOffset>0x0000edb4</addressOffset>
                <description>Provides indirect read and write access to the base address of the MPU region selected by MPU_RNR[7:2]:(3[1:0]) `FTSSS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BASE</name>
                        <description>Contains bits [31:5] of the lower inclusive limit of the selected MPU memory region. This value is zero extended to provide the base address to be checked against</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SH</name>
                        <description>Defines the Shareability domain of this region for Normal memory</description>
                        <bitRange>[4:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AP</name>
                        <description>Defines the access permissions for this region</description>
                        <bitRange>[2:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>XN</name>
                        <description>Defines whether code can be executed from this region</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_RLAR_A3</name>
                <addressOffset>0x0000edb8</addressOffset>
                <description>Provides indirect read and write access to the limit address of the currently selected MPU region selected by MPU_RNR[7:2]:(3[1:0]) `FTSSS</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LIMIT</name>
                        <description>Contains bits [31:5] of the upper inclusive limit of the selected MPU memory region. This value is postfixed with 0x1F to provide the limit address to be checked against</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTRINDX</name>
                        <description>Associates a set of attributes in the MPU_MAIR0 and MPU_MAIR1 fields</description>
                        <bitRange>[3:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Region enable</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_MAIR0</name>
                <addressOffset>0x0000edc0</addressOffset>
                <description>Along with MPU_MAIR1, provides the memory attribute encodings corresponding to the AttrIndex values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ATTR3</name>
                        <description>Memory attribute encoding for MPU regions with an AttrIndex of 3</description>
                        <bitRange>[31:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTR2</name>
                        <description>Memory attribute encoding for MPU regions with an AttrIndex of 2</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTR1</name>
                        <description>Memory attribute encoding for MPU regions with an AttrIndex of 1</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTR0</name>
                        <description>Memory attribute encoding for MPU regions with an AttrIndex of 0</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MPU_MAIR1</name>
                <addressOffset>0x0000edc4</addressOffset>
                <description>Along with MPU_MAIR0, provides the memory attribute encodings corresponding to the AttrIndex values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ATTR7</name>
                        <description>Memory attribute encoding for MPU regions with an AttrIndex of 7</description>
                        <bitRange>[31:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTR6</name>
                        <description>Memory attribute encoding for MPU regions with an AttrIndex of 6</description>
                        <bitRange>[23:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTR5</name>
                        <description>Memory attribute encoding for MPU regions with an AttrIndex of 5</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATTR4</name>
                        <description>Memory attribute encoding for MPU regions with an AttrIndex of 4</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SAU_CTRL</name>
                <addressOffset>0x0000edd0</addressOffset>
                <description>Allows enabling of the Security Attribution Unit</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ALLNS</name>
                        <description>When SAU_CTRL.ENABLE is 0 this bit controls if the memory is marked as Non-secure or Secure</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>Enables the SAU</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SAU_TYPE</name>
                <addressOffset>0x0000edd4</addressOffset>
                <description>Indicates the number of regions implemented by the Security Attribution Unit</description>
                <resetValue>0x00000008</resetValue>
                <fields>
                    <field>
                        <name>SREGION</name>
                        <description>The number of implemented SAU regions</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SAU_RNR</name>
                <addressOffset>0x0000edd8</addressOffset>
                <description>Selects the region currently accessed by SAU_RBAR and SAU_RLAR</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REGION</name>
                        <description>Indicates the SAU region accessed by SAU_RBAR and SAU_RLAR</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SAU_RBAR</name>
                <addressOffset>0x0000eddc</addressOffset>
                <description>Provides indirect read and write access to the base address of the currently selected SAU region</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BADDR</name>
                        <description>Holds bits [31:5] of the base address for the selected SAU region</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SAU_RLAR</name>
                <addressOffset>0x0000ede0</addressOffset>
                <description>Provides indirect read and write access to the limit address of the currently selected SAU region</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LADDR</name>
                        <description>Holds bits [31:5] of the limit address for the selected SAU region</description>
                        <bitRange>[31:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NSC</name>
                        <description>Controls whether Non-secure state is permitted to execute an SG instruction from this region</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>SAU region enable</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SFSR</name>
                <addressOffset>0x0000ede4</addressOffset>
                <description>Provides information about any security related faults</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LSERR</name>
                        <description>Sticky flag indicating that an error occurred during lazy state activation or deactivation</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SFARVALID</name>
                        <description>This bit is set when the SFAR register contains a valid value. As with similar fields, such as BFSR.BFARVALID and MMFSR.MMARVALID, this bit can be cleared by other exceptions, such as BusFault</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSPERR</name>
                        <description>Stick flag indicating that an SAU or IDAU violation occurred during the lazy preservation of floating-point state</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INVTRAN</name>
                        <description>Sticky flag indicating that an exception was raised due to a branch that was not flagged as being domain crossing causing a transition from Secure to Non-secure memory</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AUVIOL</name>
                        <description>Sticky flag indicating that an attempt was made to access parts of the address space that are marked as Secure with NS-Req for the transaction set to Non-secure. This bit is not set if the violation occurred during lazy state preservation. See LSPERR</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INVER</name>
                        <description>This can be caused by EXC_RETURN.DCRS being set to 0 when returning from an exception in the Non-secure state, or by EXC_RETURN.ES being set to 1 when returning from an exception in the Non-secure state</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INVIS</name>
                        <description>This bit is set if the integrity signature in an exception stack frame is found to be invalid during the unstacking operation</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INVEP</name>
                        <description>This bit is set if a function call from the Non-secure state or exception targets a non-SG instruction in the Secure state. This bit is also set if the target address is a SG instruction, but there is no matching SAU/IDAU region with the NSC flag set</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SFAR</name>
                <addressOffset>0x0000ede8</addressOffset>
                <description>Shows the address of the memory location that caused a Security violation</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDRESS</name>
                        <description>The address of an access that caused a attribution unit violation. This field is only valid when SFSR.SFARVALID is set. This allows the actual flip flops associated with this register to be shared with other fault address registers. If an implementation chooses to share the storage in this way, care must be taken to not leak Secure address information to the Non-secure state. One way of achieving this is to share the SFAR register with the MMFAR_S register, which is not accessible to the Non-secure state</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
