raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>DHCSR</name>
                <addressOffset>0x0000edf0</addressOffset>
                <description>Controls halting debug</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>S_RESTART_ST</name>
                        <description>Indicates the PE has processed a request to clear DHCSR.C_HALT to 0. That is, either a write to DHCSR that clears DHCSR.C_HALT from 1 to 0, or an External Restart Request</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_RESET_ST</name>
                        <description>Indicates whether the PE has been reset since the last read of the DHCSR</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_RETIRE_ST</name>
                        <description>Set to 1 every time the PE retires one of more instructions</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_SDE</name>
                        <description>Indicates whether Secure invasive debug is allowed</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_LOCKUP</name>
                        <description>Indicates whether the PE is in Lockup state</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_SLEEP</name>
                        <description>Indicates whether the PE is sleeping</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_HALT</name>
                        <description>Indicates whether the PE is in Debug state</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>S_REGRDY</name>
                        <description>Handshake flag to transfers through the DCRDR</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>C_SNAPSTALL</name>
                        <description>Allow imprecise entry to Debug state</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C_MASKINTS</name>
                        <description>When debug is enabled, the debugger can write to this bit to mask PendSV, SysTick and external configurable interrupts</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C_STEP</name>
                        <description>Enable single instruction step</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C_HALT</name>
                        <description>PE enter Debug state halt request</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>C_DEBUGEN</name>
                        <description>Enable Halting debug</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DCRSR</name>
                <addressOffset>0x0000edf4</addressOffset>
                <description>With the DCRDR, provides debug access to the general-purpose registers, special-purpose registers, and the FP extension registers. A write to the DCRSR specifies the register to transfer, whether the transfer is a read or write, and starts the transfer</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REGWNR</name>
                        <description>Specifies the access type for the transfer</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>REGSEL</name>
                        <description>Specifies the general-purpose register, special-purpose register, or FP register to transfer</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DCRDR</name>
                <addressOffset>0x0000edf8</addressOffset>
                <description>With the DCRSR, provides debug access to the general-purpose registers, special-purpose registers, and the FP Extension registers. If the Main Extension is implemented, it can also be used for message passing between an external debugger and a debug agent running on the PE</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DBGTMP</name>
                        <description>Provides debug access for reading and writing the general-purpose registers, special-purpose registers, and Floating-point Extension registers</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEMCR</name>
                <addressOffset>0x0000edfc</addressOffset>
                <description>Manages vector catch behavior and DebugMonitor handling when debugging</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCENA</name>
                        <description>Global enable for all DWT and ITM features</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SDME</name>
                        <description>Indicates whether the DebugMonitor targets the Secure or the Non-secure state and whether debug events are allowed in Secure state</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MON_REQ</name>
                        <description>DebugMonitor semaphore bit</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MON_STEP</name>
                        <description>Enable DebugMonitor stepping</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MON_PEND</name>
                        <description>Sets or clears the pending state of the DebugMonitor exception</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MON_EN</name>
                        <description>Enable the DebugMonitor exception</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_SFERR</name>
                        <description>SecureFault exception halting debug vector catch enable</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_HARDERR</name>
                        <description>HardFault exception halting debug vector catch enable</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_INTERR</name>
                        <description>Enable halting debug vector catch for faults during exception entry and return</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_BUSERR</name>
                        <description>BusFault exception halting debug vector catch enable</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_STATERR</name>
                        <description>Enable halting debug trap on a UsageFault exception caused by a state information error, for example an Undefined Instruction exception</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_CHKERR</name>
                        <description>Enable halting debug trap on a UsageFault exception caused by a checking error, for example an alignment check error</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_NOCPERR</name>
                        <description>Enable halting debug trap on a UsageFault caused by an access to a coprocessor</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_MMERR</name>
                        <description>Enable halting debug trap on a MemManage exception</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VC_CORERESET</name>
                        <description>Enable Reset Vector Catch. This causes a warm reset to halt a running system</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DSCSR</name>
                <addressOffset>0x0000ee08</addressOffset>
                <description>Provides control and status information for Secure debug</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CDSKEY</name>
                        <description>Writes to the CDS bit are ignored unless CDSKEY is concurrently written to zero</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CDS</name>
                        <description>This field indicates the current Security state of the processor</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SBRSEL</name>
                        <description>If SBRSELEN is 1 this bit selects whether the Non-secure or the Secure version of the memory-mapped Banked registers are accessible to the debugger</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SBRSELEN</name>
                        <description>Controls whether the SBRSEL field or the current Security state of the processor selects which version of the memory-mapped Banked registers are accessed to the debugger</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>STIR</name>
                <addressOffset>0x0000ef00</addressOffset>
                <description>Provides a mechanism for software to generate an interrupt</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTID</name>
                        <description>Indicates the interrupt to be pended. The value written is (ExceptionNumber - 16)</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FPCCR</name>
                <addressOffset>0x0000ef34</addressOffset>
                <description>Holds control data for the Floating-point extension</description>
                <resetValue>0x20000472</resetValue>
                <fields>
                    <field>
                        <name>ASPEN</name>
                        <description>When this bit is set to 1, execution of a floating-point instruction sets the CONTROL.FPCA bit to 1</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSPEN</name>
                        <description>Enables lazy context save of floating-point state</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSPENS</name>
                        <description>This bit controls whether the LSPEN bit is writeable from the Non-secure state</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLRONRET</name>
                        <description>Clear floating-point caller saved registers on exception return</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLRONRETS</name>
                        <description>This bit controls whether the CLRONRET bit is writeable from the Non-secure state</description>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TS</name>
                        <description>Treat floating-point registers as Secure enable</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UFRDY</name>
                        <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the UsageFault exception to pending</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SPLIMVIOL</name>
                        <description>This bit is banked between the Security states and indicates whether the floating-point context violates the stack pointer limit that was active when lazy state preservation was activated. SPLIMVIOL modifies the lazy floating-point state preservation behavior</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MONRDY</name>
                        <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the DebugMonitor exception to pending</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SFRDY</name>
                        <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the SecureFault exception to pending. This bit is only present in the Secure version of the register, and behaves as RAZ/WI when accessed from the Non-secure state</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFRDY</name>
                        <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the BusFault exception to pending</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MMRDY</name>
                        <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the MemManage exception to pending</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HFRDY</name>
                        <description>Indicates whether the software executing when the PE allocated the floating-point stack frame was able to set the HardFault exception to pending</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>THREAD</name>
                        <description>Indicates the PE mode when it allocated the floating-point stack frame</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>S</name>
                        <description>Security status of the floating-point context. This bit is only present in the Secure version of the register, and behaves as RAZ/WI when accessed from the Non-secure state. This bit is updated whenever lazy state preservation is activated, or when a floating-point instruction is executed</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USER</name>
                        <description>Indicates the privilege level of the software executing when the PE allocated the floating-point stack frame</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSPACT</name>
                        <description>Indicates whether lazy preservation of the floating-point state is active</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FPCAR</name>
                <addressOffset>0x0000ef38</addressOffset>
                <description>Holds the location of the unpopulated floating-point register space allocated on an exception stack frame</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ADDRESS</name>
                        <description>The location of the unpopulated floating-point register space allocated on an exception stack frame</description>
                        <bitRange>[31:3]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FPDSCR</name>
                <addressOffset>0x0000ef3c</addressOffset>
                <description>Holds the default values for the floating-point status control data that the PE assigns to the FPSCR when it creates a new floating-point context</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>AHP</name>
                        <description>Default value for FPSCR.AHP</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DN</name>
                        <description>Default value for FPSCR.DN</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FZ</name>
                        <description>Default value for FPSCR.FZ</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RMODE</name>
                        <description>Default value for FPSCR.RMode</description>
                        <bitRange>[23:22]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
