raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>TRCIDR4</name>
                <addressOffset>0x000411f0</addressOffset>
                <description>TRCIDR4</description>
                <resetValue>0x00114000</resetValue>
                <fields>
                    <field>
                        <name>NUMVMIDC</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMCIDC</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[27:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMSSCC</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[23:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMRSPAIR</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMPC</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[15:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SUPPDAC</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMDVC</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMACPAIRS</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCIDR5</name>
                <addressOffset>0x000411f4</addressOffset>
                <description>TRCIDR5</description>
                <resetValue>0x90c70004</resetValue>
                <fields>
                    <field>
                        <name>REDFUNCNTR</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMCNTR</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[30:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMSEQSTATE</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[27:25]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>LPOVERRIDE</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ATBTRIG</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TRACEIDSIZE</name>
                        <description>reads as 0x07</description>
                        <bitRange>[21:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMEXTINSEL</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[11:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMEXTIN</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCIDR6</name>
                <addressOffset>0x000411f8</addressOffset>
                <description>TRCIDR6</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCIDR6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCIDR7</name>
                <addressOffset>0x000411fc</addressOffset>
                <description>TRCIDR7</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCIDR7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCRSCTLR2</name>
                <addressOffset>0x00041208</addressOffset>
                <description>The TRCRSCTLR controls the trace resources</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PAIRINV</name>
                        <description>Inverts the result of a combined pair of resources.  This bit is only implemented on the lower register for a pair of resource selectors</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Inverts the selected resources</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GROUP</name>
                        <description>Selects a group of resource</description>
                        <bitRange>[18:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SELECT</name>
                        <description>Selects one or more resources from the wanted group. One bit is provided per resource from the group</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCRSCTLR3</name>
                <addressOffset>0x0004120c</addressOffset>
                <description>The TRCRSCTLR controls the trace resources</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PAIRINV</name>
                        <description>Inverts the result of a combined pair of resources.  This bit is only implemented on the lower register for a pair of resource selectors</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INV</name>
                        <description>Inverts the selected resources</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GROUP</name>
                        <description>Selects a group of resource</description>
                        <bitRange>[18:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SELECT</name>
                        <description>Selects one or more resources from the wanted group. One bit is provided per resource from the group</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCSSCSR</name>
                <addressOffset>0x000412a0</addressOffset>
                <description>Controls the corresponding single-shot comparator resource</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STATUS</name>
                        <description>Single-shot status bit. Indicates if any of the comparators, that TRCSSCCRn.SAC or TRCSSCCRn.ARC selects, have matched</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PC</name>
                        <description>Reserved, RES1</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DV</name>
                        <description>Reserved, RES0</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DA</name>
                        <description>Reserved, RES0</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>INST</name>
                        <description>Reserved, RES0</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCSSPCICR</name>
                <addressOffset>0x000412c0</addressOffset>
                <description>Selects the PE comparator inputs for Single-shot control</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PC</name>
                        <description>Selects one or more PE comparator inputs for Single-shot control.  TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each implemented PE comparator input.  For example, if bit[1] == 1 this selects PE comparator input 1 for Single-shot control</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPDCR</name>
                <addressOffset>0x00041310</addressOffset>
                <description>Requests the system to provide power to the trace unit</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PU</name>
                        <description>Powerup request bit:</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPDSR</name>
                <addressOffset>0x00041314</addressOffset>
                <description>Returns the following information about the trace unit: - OS Lock status.  - Core power domain status.  - Power interruption status</description>
                <resetValue>0x00000003</resetValue>
                <fields>
                    <field>
                        <name>OSLK</name>
                        <description>OS Lock status bit:</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STICKYPD</name>
                        <description>Sticky powerdown status bit. Indicates whether the trace register state is valid:</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>POWER</name>
                        <description>Power status bit:</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCITATBIDR</name>
                <addressOffset>0x00041ee4</addressOffset>
                <description>Trace Integration ATB Identification Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ID</name>
                        <description>Trace ID</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCITIATBINR</name>
                <addressOffset>0x00041ef4</addressOffset>
                <description>Trace Integration Instruction ATB In Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>AFVALIDM</name>
                        <description>Integration Mode instruction AFVALIDM in</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATREADYM</name>
                        <description>Integration Mode instruction ATREADYM in</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCITIATBOUTR</name>
                <addressOffset>0x00041efc</addressOffset>
                <description>Trace Integration Instruction ATB Out Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>AFREADY</name>
                        <description>Integration Mode instruction AFREADY out</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ATVALID</name>
                        <description>Integration Mode instruction ATVALID out</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCLAIMSET</name>
                <addressOffset>0x00041fa0</addressOffset>
                <description>Claim Tag Set Register</description>
                <resetValue>0x0000000f</resetValue>
                <fields>
                    <field>
                        <name>SET3</name>
                        <description>When a write to one of these bits occurs, with the value:</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SET2</name>
                        <description>When a write to one of these bits occurs, with the value:</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SET1</name>
                        <description>When a write to one of these bits occurs, with the value:</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SET0</name>
                        <description>When a write to one of these bits occurs, with the value:</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCLAIMCLR</name>
                <addressOffset>0x00041fa4</addressOffset>
                <description>Claim Tag Clear Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLR3</name>
                        <description>When a write to one of these bits occurs, with the value:</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLR2</name>
                        <description>When a write to one of these bits occurs, with the value:</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLR1</name>
                        <description>When a write to one of these bits occurs, with the value:</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLR0</name>
                        <description>When a write to one of these bits occurs, with the value:</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCAUTHSTATUS</name>
                <addressOffset>0x00041fb8</addressOffset>
                <description>Returns the level of tracing that the trace unit can support</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SNID</name>
                        <description>Indicates whether the system enables the trace unit to support Secure non-invasive debug:</description>
                        <bitRange>[7:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SID</name>
                        <description>Indicates whether the trace unit supports Secure invasive debug:</description>
                        <bitRange>[5:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NSNID</name>
                        <description>Indicates whether the system enables the trace unit to support Non-secure non-invasive debug:</description>
                        <bitRange>[3:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NSID</name>
                        <description>Indicates whether the trace unit supports Non-secure invasive debug:</description>
                        <bitRange>[1:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCDEVARCH</name>
                <addressOffset>0x00041fbc</addressOffset>
                <description>TRCDEVARCH</description>
                <resetValue>0x47724a13</resetValue>
                <fields>
                    <field>
                        <name>ARCHITECT</name>
                        <description>reads as 0b01000111011</description>
                        <bitRange>[31:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRESENT</name>
                        <description>reads as 0b1</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REVISION</name>
                        <description>reads as 0b0000</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHID</name>
                        <description>reads as 0b0100101000010011</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCDEVID</name>
                <addressOffset>0x00041fc8</addressOffset>
                <description>TRCDEVID</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCDEVID</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCDEVTYPE</name>
                <addressOffset>0x00041fcc</addressOffset>
                <description>TRCDEVTYPE</description>
                <resetValue>0x00000013</resetValue>
                <fields>
                    <field>
                        <name>SUB</name>
                        <description>reads as 0b0001</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MAJOR</name>
                        <description>reads as 0b0011</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
