raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>TRCPIDR4</name>
                <addressOffset>0x00041fd0</addressOffset>
                <description>TRCPIDR4</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>SIZE</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_2</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR5</name>
                <addressOffset>0x00041fd4</addressOffset>
                <description>TRCPIDR5</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCPIDR5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR6</name>
                <addressOffset>0x00041fd8</addressOffset>
                <description>TRCPIDR6</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCPIDR6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR7</name>
                <addressOffset>0x00041fdc</addressOffset>
                <description>TRCPIDR7</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRCPIDR7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR0</name>
                <addressOffset>0x00041fe0</addressOffset>
                <description>TRCPIDR0</description>
                <resetValue>0x00000021</resetValue>
                <fields>
                    <field>
                        <name>PART_0</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR1</name>
                <addressOffset>0x00041fe4</addressOffset>
                <description>TRCPIDR1</description>
                <resetValue>0x000000bd</resetValue>
                <fields>
                    <field>
                        <name>DES_0</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PART_0</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR2</name>
                <addressOffset>0x00041fe8</addressOffset>
                <description>TRCPIDR2</description>
                <resetValue>0x0000002b</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>JEDEC</name>
                        <description>reads as 0b1</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_0</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCPIDR3</name>
                <addressOffset>0x00041fec</addressOffset>
                <description>TRCPIDR3</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REVAND</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CMOD</name>
                        <description>reads as `ImpDef</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCIDR0</name>
                <addressOffset>0x00041ff0</addressOffset>
                <description>TRCCIDR0</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_0</name>
                        <description>reads as 0b00001101</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCIDR1</name>
                <addressOffset>0x00041ff4</addressOffset>
                <description>TRCCIDR1</description>
                <resetValue>0x00000090</resetValue>
                <fields>
                    <field>
                        <name>CLASS</name>
                        <description>reads as 0b1001</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRMBL_1</name>
                        <description>reads as 0b0000</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCIDR2</name>
                <addressOffset>0x00041ff8</addressOffset>
                <description>TRCCIDR2</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_2</name>
                        <description>reads as 0b00000101</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TRCCIDR3</name>
                <addressOffset>0x00041ffc</addressOffset>
                <description>TRCCIDR3</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_3</name>
                        <description>reads as 0b10110001</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTICONTROL</name>
                <addressOffset>0x00042000</addressOffset>
                <description>CTI Control Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GLBEN</name>
                        <description>Enables or disables the CTI</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINTACK</name>
                <addressOffset>0x00042010</addressOffset>
                <description>CTI Interrupt Acknowledge Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTACK</name>
                        <description>Acknowledges the corresponding ctitrigout output. There is one bit of the register for each ctitrigout output. When a 1 is written to a bit in this register, the corresponding ctitrigout is acknowledged, causing it to be cleared.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIAPPSET</name>
                <addressOffset>0x00042014</addressOffset>
                <description>CTI Application Trigger Set Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APPSET</name>
                        <description>Setting a bit HIGH generates a channel event for the selected channel. There is one bit of the register for each channel</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIAPPCLEAR</name>
                <addressOffset>0x00042018</addressOffset>
                <description>CTI Application Trigger Clear Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APPCLEAR</name>
                        <description>Sets the corresponding bits in the CTIAPPSET to 0. There is one bit of the register for each channel.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIAPPPULSE</name>
                <addressOffset>0x0004201c</addressOffset>
                <description>CTI Application Pulse Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>APPULSE</name>
                        <description>Setting a bit HIGH generates a channel event pulse for the selected channel. There is one bit of the register for each channel.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINEN0</name>
                <addressOffset>0x00042020</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINEN</name>
                        <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINEN1</name>
                <addressOffset>0x00042024</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINEN</name>
                        <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINEN2</name>
                <addressOffset>0x00042028</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINEN</name>
                        <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINEN3</name>
                <addressOffset>0x0004202c</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINEN</name>
                        <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINEN4</name>
                <addressOffset>0x00042030</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINEN</name>
                        <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINEN5</name>
                <addressOffset>0x00042034</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINEN</name>
                        <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINEN6</name>
                <addressOffset>0x00042038</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINEN</name>
                        <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIINEN7</name>
                <addressOffset>0x0004203c</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINEN</name>
                        <description>Enables a cross trigger event to the corresponding channel when a ctitrigin input is activated. There is one bit of the field for each of the four channels</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIOUTEN0</name>
                <addressOffset>0x000420a0</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTEN</name>
                        <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIOUTEN1</name>
                <addressOffset>0x000420a4</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTEN</name>
                        <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIOUTEN2</name>
                <addressOffset>0x000420a8</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTEN</name>
                        <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIOUTEN3</name>
                <addressOffset>0x000420ac</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTEN</name>
                        <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIOUTEN4</name>
                <addressOffset>0x000420b0</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTEN</name>
                        <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIOUTEN5</name>
                <addressOffset>0x000420b4</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTEN</name>
                        <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIOUTEN6</name>
                <addressOffset>0x000420b8</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTEN</name>
                        <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIOUTEN7</name>
                <addressOffset>0x000420bc</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTEN</name>
                        <description>Enables a cross trigger event to ctitrigout when the corresponding channel is activated. There is one bit of the field for each of the four channels.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
