raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>CTITRIGINSTATUS</name>
                <addressOffset>0x00042130</addressOffset>
                <description>CTI Trigger to Channel Enable Registers</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGINSTATUS</name>
                        <description>Shows the status of the ctitrigin inputs. There is one bit of the field for each trigger input.Because the register provides a view of the raw ctitrigin inputs, the reset value is UNKNOWN.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTITRIGOUTSTATUS</name>
                <addressOffset>0x00042134</addressOffset>
                <description>CTI Trigger In Status Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGOUTSTATUS</name>
                        <description>Shows the status of the ctitrigout outputs. There is one bit of the field for each trigger output.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTICHINSTATUS</name>
                <addressOffset>0x00042138</addressOffset>
                <description>CTI Channel In Status Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTICHOUTSTATUS</name>
                        <description>Shows the status of the ctichout outputs. There is one bit of the field for each channel output</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTIGATE</name>
                <addressOffset>0x00042140</addressOffset>
                <description>Enable CTI Channel Gate register</description>
                <resetValue>0x0000000f</resetValue>
                <fields>
                    <field>
                        <name>CTIGATEEN3</name>
                        <description>Enable ctichout3. Set to 0 to disable channel propagation.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CTIGATEEN2</name>
                        <description>Enable ctichout2. Set to 0 to disable channel propagation.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CTIGATEEN1</name>
                        <description>Enable ctichout1. Set to 0 to disable channel propagation.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CTIGATEEN0</name>
                        <description>Enable ctichout0. Set to 0 to disable channel propagation.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ASICCTL</name>
                <addressOffset>0x00042144</addressOffset>
                <description>External Multiplexer Control register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ASICCTL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITCHOUT</name>
                <addressOffset>0x00042ee4</addressOffset>
                <description>Integration Test Channel Output register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTCHOUT</name>
                        <description>Sets the value of the ctichout outputs</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITTRIGOUT</name>
                <addressOffset>0x00042ee8</addressOffset>
                <description>Integration Test Trigger Output register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTTRIGOUT</name>
                        <description>Sets the value of the ctitrigout outputs</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITCHIN</name>
                <addressOffset>0x00042ef4</addressOffset>
                <description>Integration Test Channel Input register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTCHIN</name>
                        <description>Reads the value of the ctichin inputs.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ITCTRL</name>
                <addressOffset>0x00042f00</addressOffset>
                <description>Integration Mode Control register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>IME</name>
                        <description>Integration Mode Enable</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEVARCH</name>
                <addressOffset>0x00042fbc</addressOffset>
                <description>Device Architecture register</description>
                <resetValue>0x47701a14</resetValue>
                <fields>
                    <field>
                        <name>ARCHITECT</name>
                        <description>Indicates the component architect</description>
                        <bitRange>[31:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRESENT</name>
                        <description>Indicates whether the DEVARCH register is present</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REVISION</name>
                        <description>Indicates the architecture revision</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ARCHID</name>
                        <description>Indicates the component</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEVID</name>
                <addressOffset>0x00042fc8</addressOffset>
                <description>Device Configuration register</description>
                <resetValue>0x00040800</resetValue>
                <fields>
                    <field>
                        <name>NUMCH</name>
                        <description>Number of ECT channels available</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>NUMTRIG</name>
                        <description>Number of ECT triggers available.</description>
                        <bitRange>[15:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EXTMUXNUM</name>
                        <description>Indicates the number of multiplexers available on Trigger Inputs and Trigger Outputs that are using asicctl. The default value of 0b00000 indicates that no multiplexing is present. This value of this bit depends on the Verilog define EXTMUXNUM that you must change accordingly.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DEVTYPE</name>
                <addressOffset>0x00042fcc</addressOffset>
                <description>Device Type Identifier register</description>
                <resetValue>0x00000014</resetValue>
                <fields>
                    <field>
                        <name>SUB</name>
                        <description>Sub-classification of the type of the debug component as specified in the ARM Architecture Specification within the major classification as specified in the MAJOR field.</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MAJOR</name>
                        <description>Major classification of the type of the debug component as specified in the ARM Architecture Specification for this debug and trace component.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PIDR4</name>
                <addressOffset>0x00042fd0</addressOffset>
                <description>CoreSight Peripheral ID4</description>
                <resetValue>0x00000004</resetValue>
                <fields>
                    <field>
                        <name>SIZE</name>
                        <description>Always 0b0000. Indicates that the device only occupies 4KB of memory</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_2</name>
                        <description>Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PIDR5</name>
                <addressOffset>0x00042fd4</addressOffset>
                <description>CoreSight Peripheral ID5</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PIDR5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PIDR6</name>
                <addressOffset>0x00042fd8</addressOffset>
                <description>CoreSight Peripheral ID6</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PIDR6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PIDR7</name>
                <addressOffset>0x00042fdc</addressOffset>
                <description>CoreSight Peripheral ID7</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PIDR7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PIDR0</name>
                <addressOffset>0x00042fe0</addressOffset>
                <description>CoreSight Peripheral ID0</description>
                <resetValue>0x00000021</resetValue>
                <fields>
                    <field>
                        <name>PART_0</name>
                        <description>Bits[7:0] of the 12-bit part number of the component. The designer of the component assigns this part number.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PIDR1</name>
                <addressOffset>0x00042fe4</addressOffset>
                <description>CoreSight Peripheral ID1</description>
                <resetValue>0x000000bd</resetValue>
                <fields>
                    <field>
                        <name>DES_0</name>
                        <description>Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PART_1</name>
                        <description>Bits[11:8] of the 12-bit part number of the component. The designer of the component assigns this part number.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PIDR2</name>
                <addressOffset>0x00042fe8</addressOffset>
                <description>CoreSight Peripheral ID2</description>
                <resetValue>0x0000000b</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <description>This device is at r1p0</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>JEDEC</name>
                        <description>Always 1. Indicates that the JEDEC-assigned designer ID is used.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DES_1</name>
                        <description>Together, PIDR1.DES_0, PIDR2.DES_1, and PIDR4.DES_2 identify the designer of the component.</description>
                        <bitRange>[2:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PIDR3</name>
                <addressOffset>0x00042fec</addressOffset>
                <description>CoreSight Peripheral ID3</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>REVAND</name>
                        <description>Indicates minor errata fixes specific to the revision of the component being used, for example metal fixes after implementation. In most cases, this field is 0b0000. ARM recommends that the component designers ensure that a metal fix can change this field if required, for example, by driving it from registers that reset to 0b0000.</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CMOD</name>
                        <description>Customer Modified. Indicates whether the customer has modified the behavior of the component. In most cases, this field is 0b0000. Customers change this value when they make authorized modifications to this component.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CIDR0</name>
                <addressOffset>0x00042ff0</addressOffset>
                <description>CoreSight Component ID0</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_0</name>
                        <description>Preamble[0]. Contains bits[7:0] of the component identification code</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CIDR1</name>
                <addressOffset>0x00042ff4</addressOffset>
                <description>CoreSight Component ID1</description>
                <resetValue>0x00000090</resetValue>
                <fields>
                    <field>
                        <name>CLASS</name>
                        <description>Class of the component, for example, whether the component is a ROM table or a generic CoreSight component. Contains bits[15:12] of the component identification code.</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PRMBL_1</name>
                        <description>Preamble[1]. Contains bits[11:8] of the component identification code.</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CIDR2</name>
                <addressOffset>0x00042ff8</addressOffset>
                <description>CoreSight Component ID2</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_2</name>
                        <description>Preamble[2]. Contains bits[23:16] of the component identification code.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CIDR3</name>
                <addressOffset>0x00042ffc</addressOffset>
                <description>CoreSight Component ID3</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>PRMBL_3</name>
                        <description>Preamble[3]. Contains bits[31:24] of the component identification code.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
