raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>CH3_CSR</name>
                <addressOffset>0x0000003c</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PH_ADV</name>
                        <description>Advance the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running 
                            at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
                        <bitRange>[7:7]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PH_RET</name>
                        <description>Retard the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DIVMODE</name>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>div</name>
                                <value>0</value>
                                <description>Free-running counting at rate dictated by fractional divider</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>level</name>
                                <value>1</value>
                                <description>Fractional divider operation is gated by the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>rise</name>
                                <value>2</value>
                                <description>Counter advances with each rising edge of the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>fall</name>
                                <value>3</value>
                                <description>Counter advances with each falling edge of the PWM B pin.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>B_INV</name>
                        <description>Invert output B</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A_INV</name>
                        <description>Invert output A</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PH_CORRECT</name>
                        <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable the PWM channel.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH3_DIV</name>
                <addressOffset>0x00000040</addressOffset>
                <description>INT and FRAC form a fixed-point fractional number. 
                    Counting rate is system clock frequency divided by this number. 
                    Fractional division uses simple 1st-order sigma-delta.</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <bitRange>[11:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH3_CTR</name>
                <addressOffset>0x00000044</addressOffset>
                <description>Direct access to the PWM counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH3_CTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH3_CC</name>
                <addressOffset>0x00000048</addressOffset>
                <description>Counter compare values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>B</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH3_TOP</name>
                <addressOffset>0x0000004c</addressOffset>
                <description>Counter wrap value</description>
                <resetValue>0x0000ffff</resetValue>
                <fields>
                    <field>
                        <name>CH3_TOP</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH4_CSR</name>
                <addressOffset>0x00000050</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PH_ADV</name>
                        <description>Advance the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running 
                            at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
                        <bitRange>[7:7]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PH_RET</name>
                        <description>Retard the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DIVMODE</name>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>div</name>
                                <value>0</value>
                                <description>Free-running counting at rate dictated by fractional divider</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>level</name>
                                <value>1</value>
                                <description>Fractional divider operation is gated by the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>rise</name>
                                <value>2</value>
                                <description>Counter advances with each rising edge of the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>fall</name>
                                <value>3</value>
                                <description>Counter advances with each falling edge of the PWM B pin.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>B_INV</name>
                        <description>Invert output B</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A_INV</name>
                        <description>Invert output A</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PH_CORRECT</name>
                        <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable the PWM channel.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH4_DIV</name>
                <addressOffset>0x00000054</addressOffset>
                <description>INT and FRAC form a fixed-point fractional number. 
                    Counting rate is system clock frequency divided by this number. 
                    Fractional division uses simple 1st-order sigma-delta.</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <bitRange>[11:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH4_CTR</name>
                <addressOffset>0x00000058</addressOffset>
                <description>Direct access to the PWM counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH4_CTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH4_CC</name>
                <addressOffset>0x0000005c</addressOffset>
                <description>Counter compare values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>B</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH4_TOP</name>
                <addressOffset>0x00000060</addressOffset>
                <description>Counter wrap value</description>
                <resetValue>0x0000ffff</resetValue>
                <fields>
                    <field>
                        <name>CH4_TOP</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH5_CSR</name>
                <addressOffset>0x00000064</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PH_ADV</name>
                        <description>Advance the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running 
                            at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
                        <bitRange>[7:7]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PH_RET</name>
                        <description>Retard the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DIVMODE</name>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>div</name>
                                <value>0</value>
                                <description>Free-running counting at rate dictated by fractional divider</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>level</name>
                                <value>1</value>
                                <description>Fractional divider operation is gated by the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>rise</name>
                                <value>2</value>
                                <description>Counter advances with each rising edge of the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>fall</name>
                                <value>3</value>
                                <description>Counter advances with each falling edge of the PWM B pin.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>B_INV</name>
                        <description>Invert output B</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A_INV</name>
                        <description>Invert output A</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PH_CORRECT</name>
                        <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable the PWM channel.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH5_DIV</name>
                <addressOffset>0x00000068</addressOffset>
                <description>INT and FRAC form a fixed-point fractional number. 
                    Counting rate is system clock frequency divided by this number. 
                    Fractional division uses simple 1st-order sigma-delta.</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <bitRange>[11:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH5_CTR</name>
                <addressOffset>0x0000006c</addressOffset>
                <description>Direct access to the PWM counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH5_CTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH5_CC</name>
                <addressOffset>0x00000070</addressOffset>
                <description>Counter compare values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>B</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH5_TOP</name>
                <addressOffset>0x00000074</addressOffset>
                <description>Counter wrap value</description>
                <resetValue>0x0000ffff</resetValue>
                <fields>
                    <field>
                        <name>CH5_TOP</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH6_CSR</name>
                <addressOffset>0x00000078</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PH_ADV</name>
                        <description>Advance the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running 
                            at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
                        <bitRange>[7:7]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PH_RET</name>
                        <description>Retard the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DIVMODE</name>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>div</name>
                                <value>0</value>
                                <description>Free-running counting at rate dictated by fractional divider</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>level</name>
                                <value>1</value>
                                <description>Fractional divider operation is gated by the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>rise</name>
                                <value>2</value>
                                <description>Counter advances with each rising edge of the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>fall</name>
                                <value>3</value>
                                <description>Counter advances with each falling edge of the PWM B pin.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>B_INV</name>
                        <description>Invert output B</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A_INV</name>
                        <description>Invert output A</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PH_CORRECT</name>
                        <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable the PWM channel.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
