raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>CH6_DIV</name>
                <addressOffset>0x0000007c</addressOffset>
                <description>INT and FRAC form a fixed-point fractional number. 
                    Counting rate is system clock frequency divided by this number. 
                    Fractional division uses simple 1st-order sigma-delta.</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <bitRange>[11:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH6_CTR</name>
                <addressOffset>0x00000080</addressOffset>
                <description>Direct access to the PWM counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH6_CTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH6_CC</name>
                <addressOffset>0x00000084</addressOffset>
                <description>Counter compare values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>B</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH6_TOP</name>
                <addressOffset>0x00000088</addressOffset>
                <description>Counter wrap value</description>
                <resetValue>0x0000ffff</resetValue>
                <fields>
                    <field>
                        <name>CH6_TOP</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH7_CSR</name>
                <addressOffset>0x0000008c</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PH_ADV</name>
                        <description>Advance the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running 
                            at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
                        <bitRange>[7:7]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PH_RET</name>
                        <description>Retard the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DIVMODE</name>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>div</name>
                                <value>0</value>
                                <description>Free-running counting at rate dictated by fractional divider</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>level</name>
                                <value>1</value>
                                <description>Fractional divider operation is gated by the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>rise</name>
                                <value>2</value>
                                <description>Counter advances with each rising edge of the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>fall</name>
                                <value>3</value>
                                <description>Counter advances with each falling edge of the PWM B pin.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>B_INV</name>
                        <description>Invert output B</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A_INV</name>
                        <description>Invert output A</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PH_CORRECT</name>
                        <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable the PWM channel.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH7_DIV</name>
                <addressOffset>0x00000090</addressOffset>
                <description>INT and FRAC form a fixed-point fractional number. 
                    Counting rate is system clock frequency divided by this number. 
                    Fractional division uses simple 1st-order sigma-delta.</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <bitRange>[11:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH7_CTR</name>
                <addressOffset>0x00000094</addressOffset>
                <description>Direct access to the PWM counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH7_CTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH7_CC</name>
                <addressOffset>0x00000098</addressOffset>
                <description>Counter compare values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>B</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH7_TOP</name>
                <addressOffset>0x0000009c</addressOffset>
                <description>Counter wrap value</description>
                <resetValue>0x0000ffff</resetValue>
                <fields>
                    <field>
                        <name>CH7_TOP</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH8_CSR</name>
                <addressOffset>0x000000a0</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PH_ADV</name>
                        <description>Advance the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running 
                            at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
                        <bitRange>[7:7]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PH_RET</name>
                        <description>Retard the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DIVMODE</name>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>div</name>
                                <value>0</value>
                                <description>Free-running counting at rate dictated by fractional divider</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>level</name>
                                <value>1</value>
                                <description>Fractional divider operation is gated by the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>rise</name>
                                <value>2</value>
                                <description>Counter advances with each rising edge of the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>fall</name>
                                <value>3</value>
                                <description>Counter advances with each falling edge of the PWM B pin.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>B_INV</name>
                        <description>Invert output B</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A_INV</name>
                        <description>Invert output A</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PH_CORRECT</name>
                        <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable the PWM channel.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH8_DIV</name>
                <addressOffset>0x000000a4</addressOffset>
                <description>INT and FRAC form a fixed-point fractional number. 
                    Counting rate is system clock frequency divided by this number. 
                    Fractional division uses simple 1st-order sigma-delta.</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <bitRange>[11:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH8_CTR</name>
                <addressOffset>0x000000a8</addressOffset>
                <description>Direct access to the PWM counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH8_CTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH8_CC</name>
                <addressOffset>0x000000ac</addressOffset>
                <description>Counter compare values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>B</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH8_TOP</name>
                <addressOffset>0x000000b0</addressOffset>
                <description>Counter wrap value</description>
                <resetValue>0x0000ffff</resetValue>
                <fields>
                    <field>
                        <name>CH8_TOP</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH9_CSR</name>
                <addressOffset>0x000000b4</addressOffset>
                <description>Control and status register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PH_ADV</name>
                        <description>Advance the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running 
                            at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
                        <bitRange>[7:7]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PH_RET</name>
                        <description>Retard the phase of the counter by 1 count, while it is running. 
                            Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DIVMODE</name>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>div</name>
                                <value>0</value>
                                <description>Free-running counting at rate dictated by fractional divider</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>level</name>
                                <value>1</value>
                                <description>Fractional divider operation is gated by the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>rise</name>
                                <value>2</value>
                                <description>Counter advances with each rising edge of the PWM B pin.</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>fall</name>
                                <value>3</value>
                                <description>Counter advances with each falling edge of the PWM B pin.</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>B_INV</name>
                        <description>Invert output B</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A_INV</name>
                        <description>Invert output A</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PH_CORRECT</name>
                        <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable the PWM channel.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH9_DIV</name>
                <addressOffset>0x000000b8</addressOffset>
                <description>INT and FRAC form a fixed-point fractional number. 
                    Counting rate is system clock frequency divided by this number. 
                    Fractional division uses simple 1st-order sigma-delta.</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>INT</name>
                        <bitRange>[11:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FRAC</name>
                        <bitRange>[3:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH9_CTR</name>
                <addressOffset>0x000000bc</addressOffset>
                <description>Direct access to the PWM counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CH9_CTR</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH9_CC</name>
                <addressOffset>0x000000c0</addressOffset>
                <description>Counter compare values</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>B</name>
                        <bitRange>[31:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>A</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CH9_TOP</name>
                <addressOffset>0x000000c4</addressOffset>
                <description>Counter wrap value</description>
                <resetValue>0x0000ffff</resetValue>
                <fields>
                    <field>
                        <name>CH9_TOP</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
