raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>QMI</name>
        <description>QSPI Memory Interface.

            Provides a memory-mapped interface to up to two SPI/DSPI/QSPI flash or PSRAM devices. Also provides a serial interface for programming and configuration of the external device.</description>
        <baseAddress>0x400d0000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>84</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>DIRECT_CSR</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Control and status for direct serial mode

                    Direct serial mode allows the processor to send and receive raw serial frames, for programming, configuration and control of the external memory devices. Only SPI mode 0 (CPOL=0 CPHA=0) is supported.</description>
                <resetValue>0x01800000</resetValue>
                <fields>
                    <field>
                        <name>RXDELAY</name>
                        <description>Delay the read data sample timing, in units of one half of a system clock cycle. (Not necessarily half of an SCK cycle.)</description>
                        <bitRange>[31:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CLKDIV</name>
                        <description>Clock divisor for direct serial mode. Divisors of 1..255 are encoded directly, and the maximum divisor of 256 is encoded by a value of CLKDIV=0.

                            The clock divisor can be changed on-the-fly by software, without halting or otherwise coordinating with the serial interface. The serial interface will sample the latest clock divisor each time it begins the transmission of a new byte.</description>
                        <bitRange>[29:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RXLEVEL</name>
                        <description>Current level of DIRECT_RX FIFO</description>
                        <bitRange>[20:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXFULL</name>
                        <description>When 1, the DIRECT_RX FIFO is currently full. The serial interface will be stalled until data is popped; the interface will not begin a new serial frame when the DIRECT_TX FIFO is empty or the DIRECT_RX FIFO is full.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RXEMPTY</name>
                        <description>When 1, the DIRECT_RX FIFO is currently empty. If the processor attempts to read more data, the FIFO state is not affected, but the value returned to the processor is undefined.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TXLEVEL</name>
                        <description>Current level of DIRECT_TX FIFO</description>
                        <bitRange>[14:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TXEMPTY</name>
                        <description>When 1, the DIRECT_TX FIFO is currently empty. Unless the processor pushes more data, transmission will stop and BUSY will go low once the current 8-bit serial frame completes.</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TXFULL</name>
                        <description>When 1, the DIRECT_TX FIFO is currently full. If the processor tries to write more data, that data will be ignored.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>AUTO_CS1N</name>
                        <description>When 1, automatically assert the CS1n chip select line whenever the BUSY flag is set.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AUTO_CS0N</name>
                        <description>When 1, automatically assert the CS0n chip select line whenever the BUSY flag is set.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ASSERT_CS1N</name>
                        <description>When 1, assert (i.e. drive low) the CS1n chip select line.

                            Note that this applies even when DIRECT_CSR_EN is 0.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ASSERT_CS0N</name>
                        <description>When 1, assert (i.e. drive low) the CS0n chip select line.

                            Note that this applies even when DIRECT_CSR_EN is 0.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUSY</name>
                        <description>Direct mode busy flag. If 1, data is currently being shifted in/out (or would be if the interface were not stalled on the RX FIFO), and the chip select must not yet be deasserted.

