raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            The busy flag will also be set to 1 if a memory-mapped transfer is still in progress when direct mode is enabled. Direct mode blocks new memory-mapped transfers, but can't halt a transfer that is already in progress. If there is a chance that memory-mapped transfers may be in progress, the busy flag should be polled for 0 before asserting the chip select.

                            (In practice you will usually discover this timing condition through other means, because any subsequent memory-mapped transfers when direct mode is enabled will return bus errors, which are difficult to ignore.)</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Enable direct mode.

                            In direct mode, software controls the chip select lines, and can perform direct SPI transfers by pushing data to the DIRECT_TX FIFO, and popping the same amount of data from the DIRECT_RX FIFO.

                            Memory-mapped accesses will generate bus errors when direct serial mode is enabled.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DIRECT_TX</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Transmit FIFO for direct mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NOPUSH</name>
                        <description>Inhibit the RX FIFO push that would correspond to this TX FIFO entry.

                            Useful to avoid garbage appearing in the RX FIFO when pushing the command at the beginning of a SPI transfer.</description>
                        <bitRange>[20:20]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>OE</name>
                        <description>Output enable (active-high). For single width (SPI), this field is ignored, and SD0 is always set to output, with SD1 always set to input.

                            For dual and quad width (DSPI/QSPI), this sets whether the relevant SDx pads are set to output whilst transferring this FIFO record. In this case the command/address should have OE set, and the data transfer should have OE set or clear depending on the direction of the transfer.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DWIDTH</name>
                        <description>Data width. If 0, hardware will transmit the 8 LSBs of the DIRECT_TX DATA field, and return an 8-bit value in the 8 LSBs of DIRECT_RX. If 1, the full 16-bit width is used. 8-bit and 16-bit transfers can be mixed freely.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>IWIDTH</name>
                        <description>Configure whether this FIFO record is transferred with single/dual/quad interface width (0/1/2). Different widths can be mixed freely.</description>
                        <bitRange>[17:16]</bitRange>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>S</name>
                                <value>0</value>
                                <description>Single width</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>D</name>
                                <value>1</value>
                                <description>Dual width</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Q</name>
                                <value>2</value>
                                <description>Quad width</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DATA</name>
                        <description>Data pushed here will be clocked out falling edges of SCK (or before the very first rising edge of SCK, if this is the first pulse). For each byte clocked out, the interface will simultaneously sample one byte, on rising edges of SCK, and push this to the DIRECT_RX FIFO.

                            For 16-bit data, the least-significant byte is transmitted first.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DIRECT_RX</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Receive FIFO for direct mode</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DIRECT_RX</name>
                        <description>With each byte clocked out on the serial interface, one byte will simultaneously be clocked in, and will appear in this FIFO. The serial interface will stall when this FIFO is full, to avoid dropping data.

                            When 16-bit data is pushed into the TX FIFO, the corresponding RX FIFO push will also contain 16 bits of data. The least-significant byte is the first one received.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>M0_TIMING</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Timing configuration register for memory address window 0.</description>
                <resetValue>0x40000004</resetValue>
                <fields>
                    <field>
                        <name>COOLDOWN</name>
                        <description>Chip select cooldown period. When a memory transfer finishes, the chip select remains asserted for 64 x COOLDOWN system clock cycles, plus half an SCK clock period (rounded up for odd SCK divisors). After this cooldown expires, the chip select is always deasserted to save power.

