raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    Configure the bus width of each transfer phase individually, and configure the length or presence of the command prefix, command suffix and dummy/turnaround transfer phases. Only 24-bit addresses are supported.

                    The reset value of the M0_WFMT register is configured to support a basic 02h serial write transfer. However, writes to this window must first be enabled via the XIP_CTRL_WRITABLE_M0 bit, as XIP memory is read-only by default.</description>
                <resetValue>0x00001000</resetValue>
                <fields>
                    <field>
                        <name>DTR</name>
                        <description>Enable double transfer rate (DTR) for write commands: address, suffix and write data phases are active on both edges of SCK. SDO data is launched centre-aligned on each SCK edge, and SDI data is captured on the SCK edge that follows its launch.

                            DTR is implemented by halving the clock rate; SCK has a period of 2 x CLK_DIV throughout the transfer. The prefix and dummy phases are still single transfer rate.

                            If the suffix is quad-width, it must be 0 or 8 bits in length, to ensure an even number of SCK edges.</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DUMMY_LEN</name>
                        <description>Length of dummy phase between command suffix and data phase, in units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4 for single)</description>
                        <bitRange>[18:16]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NONE</name>
                                <value>0</value>
                                <description>No dummy phase</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>4</name>
                                <value>1</value>
                                <description>4 dummy bits</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8</name>
                                <value>2</value>
                                <description>8 dummy bits</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>12</name>
                                <value>3</value>
                                <description>12 dummy bits</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>16</name>
                                <value>4</value>
                                <description>16 dummy bits</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>20</name>
                                <value>5</value>
                                <description>20 dummy bits</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>24</name>
                                <value>6</value>
                                <description>24 dummy bits</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>28</name>
                                <value>7</value>
                                <description>28 dummy bits</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SUFFIX_LEN</name>
                        <description>Length of post-address command suffix, in units of 4 bits. (i.e. 1 cycle for quad width, 2 for dual, 4 for single)

                            Only values of 0 and 8 bits are supported.</description>
                        <bitRange>[15:14]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NONE</name>
                                <value>0</value>
                                <description>No suffix</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8</name>
                                <value>2</value>
                                <description>8-bit suffix</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PREFIX_LEN</name>
                        <description>Length of command prefix, in units of 8 bits. (i.e. 2 cycles for quad width, 4 for dual, 8 for single)</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>NONE</name>
                                <value>0</value>
                                <description>No prefix</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>8</name>
                                <value>1</value>
                                <description>8-bit prefix</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DATA_WIDTH</name>
                        <description>The width used for the data transfer</description>
                        <bitRange>[9:8]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>S</name>
                                <value>0</value>
                                <description>Single width</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>D</name>
                                <value>1</value>
                                <description>Dual width</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Q</name>
                                <value>2</value>
                                <description>Quad width</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DUMMY_WIDTH</name>
                        <description>The width used for the dummy phase, if any.

