raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>SIO</name>
        <description>Single-cycle IO block 
            Provides core-local and inter-core hardware for the two processors, with single-cycle access.</description>
        <baseAddress>0xd0000000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>488</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>SIO_IRQ_FIFO</name>
            <value>25</value>
        </interrupt>
        <interrupt>
            <name>SIO_IRQ_BELL</name>
            <value>26</value>
        </interrupt>
        <interrupt>
            <name>SIO_IRQ_FIFO_NS</name>
            <value>27</value>
        </interrupt>
        <interrupt>
            <name>SIO_IRQ_BELL_NS</name>
            <value>28</value>
        </interrupt>
        <interrupt>
            <name>SIO_IRQ_MTIMECMP</name>
            <value>29</value>
        </interrupt>
        <registers>
            <register>
                <name>CPUID</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Processor core identifier</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>CPUID</name>
                        <description>Value is 0 when read from processor core 0, and 1 when read from processor core 1.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_IN</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Input value for GPIO0...31.

                    In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL) appear as zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_IN</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_HI_IN</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Input value on GPIO32...47, QSPI IOs and USB pins

                    In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL) appear as zero.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <description>Input value on QSPI SD0 (MOSI), SD1 (MISO), SD2 and SD3 pins</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <description>Input value on QSPI CSn pin</description>
                        <bitRange>[27:27]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <description>Input value on QSPI SCK pin</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <description>Input value on USB D- pin</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <description>Input value on USB D+ pin</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <description>Input value on GPIO32...47</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_OUT</name>
                <addressOffset>0x00000010</addressOffset>
                <description>GPIO0...31 output value</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_OUT</name>
                        <description>Set output level (1/0 -&gt; high/low) for GPIO0...31. Reading back gives the last value written, NOT the input value from the pins.

                            If core 0 and core 1 both write to GPIO_OUT simultaneously (or to a SET/CLR/XOR alias), the result is as though the write from core 0 took place first, and the write from core 1 was then applied to that intermediate result.

                            In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL) ignore writes, and their output status reads back as zero. This is also true for SET/CLR/XOR aliases of this register.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_HI_OUT</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Output value for GPIO32...47, QSPI IOs and USB pins.

                    Write to set output level (1/0 -&gt; high/low). Reading back gives the last value written, NOT the input value from the pins. If core 0 and core 1 both write to GPIO_HI_OUT simultaneously (or to a SET/CLR/XOR alias), the result is as though the write from core 0 took place first, and the write from core 1 was then applied to that intermediate result.

                    In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL) ignore writes, and their output status reads back as zero. This is also true for SET/CLR/XOR aliases of this register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <description>Output value for QSPI SD0 (MOSI), SD1 (MISO), SD2 and SD3 pins</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <description>Output value for QSPI CSn pin</description>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <description>Output value for QSPI SCK pin</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <description>Output value for USB D- pin</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <description>Output value for USB D+ pin</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <description>Output value for GPIO32...47</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_OUT_SET</name>
                <addressOffset>0x00000018</addressOffset>
                <description>GPIO0...31 output value set</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_OUT_SET</name>
                        <description>Perform an atomic bit-set on GPIO_OUT, i.e. `GPIO_OUT |= wdata`</description>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_HI_OUT_SET</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Output value set for GPIO32..47, QSPI IOs and USB pins. 
                    Perform an atomic bit-set on GPIO_HI_OUT, i.e. `GPIO_HI_OUT |= wdata`</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <bitRange>[31:28]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <bitRange>[27:27]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <bitRange>[26:26]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <bitRange>[24:24]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_OUT_CLR</name>
                <addressOffset>0x00000020</addressOffset>
                <description>GPIO0...31 output value clear</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_OUT_CLR</name>
                        <description>Perform an atomic bit-clear on GPIO_OUT, i.e. `GPIO_OUT &amp;= ~wdata`</description>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_HI_OUT_CLR</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Output value clear for GPIO32..47, QSPI IOs and USB pins. 
                    Perform an atomic bit-clear on GPIO_HI_OUT, i.e. `GPIO_HI_OUT &amp;= ~wdata`</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <bitRange>[31:28]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <bitRange>[27:27]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <bitRange>[26:26]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <bitRange>[24:24]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_OUT_XOR</name>
                <addressOffset>0x00000028</addressOffset>
                <description>GPIO0...31 output value XOR</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_OUT_XOR</name>
                        <description>Perform an atomic bitwise XOR on GPIO_OUT, i.e. `GPIO_OUT ^= wdata`</description>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_HI_OUT_XOR</name>
                <addressOffset>0x0000002c</addressOffset>
                <description>Output value XOR for GPIO32..47, QSPI IOs and USB pins. 
                    Perform an atomic bitwise XOR on GPIO_HI_OUT, i.e. `GPIO_HI_OUT ^= wdata`</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <bitRange>[31:28]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <bitRange>[27:27]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <bitRange>[26:26]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <bitRange>[24:24]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_OE</name>
                <addressOffset>0x00000030</addressOffset>
                <description>GPIO0...31 output enable</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_OE</name>
                        <description>Set output enable (1/0 -&gt; output/input) for GPIO0...31. Reading back gives the last value written.

                            If core 0 and core 1 both write to GPIO_OE simultaneously (or to a SET/CLR/XOR alias), the result is as though the write from core 0 took place first, and the write from core 1 was then applied to that intermediate result.

                            In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL) ignore writes, and their output status reads back as zero. This is also true for SET/CLR/XOR aliases of this register.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_HI_OE</name>
                <addressOffset>0x00000034</addressOffset>
                <description>Output enable value for GPIO32...47, QSPI IOs and USB pins.

                    Write output enable (1/0 -&gt; output/input). Reading back gives the last value written. If core 0 and core 1 both write to GPIO_HI_OE simultaneously (or to a SET/CLR/XOR alias), the result is as though the write from core 0 took place first, and the write from core 1 was then applied to that intermediate result.

                    In the Non-secure SIO, Secure-only GPIOs (as per ACCESSCTRL) ignore writes, and their output status reads back as zero. This is also true for SET/CLR/XOR aliases of this register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <description>Output enable value for QSPI SD0 (MOSI), SD1 (MISO), SD2 and SD3 pins</description>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <description>Output enable value for QSPI CSn pin</description>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <description>Output enable value for QSPI SCK pin</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <description>Output enable value for USB D- pin</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <description>Output enable value for USB D+ pin</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <description>Output enable value for GPIO32...47</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_OE_SET</name>
                <addressOffset>0x00000038</addressOffset>
                <description>GPIO0...31 output enable set</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_OE_SET</name>
                        <description>Perform an atomic bit-set on GPIO_OE, i.e. `GPIO_OE |= wdata`</description>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_HI_OE_SET</name>
                <addressOffset>0x0000003c</addressOffset>
                <description>Output enable set for GPIO32...47, QSPI IOs and USB pins. 
                    Perform an atomic bit-set on GPIO_HI_OE, i.e. `GPIO_HI_OE |= wdata`</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <bitRange>[31:28]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <bitRange>[27:27]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <bitRange>[26:26]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <bitRange>[24:24]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_OE_CLR</name>
                <addressOffset>0x00000040</addressOffset>
                <description>GPIO0...31 output enable clear</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_OE_CLR</name>
                        <description>Perform an atomic bit-clear on GPIO_OE, i.e. `GPIO_OE &amp;= ~wdata`</description>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_HI_OE_CLR</name>
                <addressOffset>0x00000044</addressOffset>
                <description>Output enable clear for GPIO32...47, QSPI IOs and USB pins. 
                    Perform an atomic bit-clear on GPIO_HI_OE, i.e. `GPIO_HI_OE &amp;= ~wdata`</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <bitRange>[31:28]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <bitRange>[27:27]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <bitRange>[26:26]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <bitRange>[24:24]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
