raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>GPIO_OE_XOR</name>
                <addressOffset>0x00000048</addressOffset>
                <description>GPIO0...31 output enable XOR</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO_OE_XOR</name>
                        <description>Perform an atomic bitwise XOR on GPIO_OE, i.e. `GPIO_OE ^= wdata`</description>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GPIO_HI_OE_XOR</name>
                <addressOffset>0x0000004c</addressOffset>
                <description>Output enable XOR for GPIO32...47, QSPI IOs and USB pins. 
                    Perform an atomic bitwise XOR on GPIO_HI_OE, i.e. `GPIO_HI_OE ^= wdata`</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <bitRange>[31:28]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <bitRange>[27:27]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <bitRange>[26:26]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <bitRange>[24:24]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FIFO_ST</name>
                <addressOffset>0x00000050</addressOffset>
                <description>Status register for inter-core FIFOs (mailboxes). 
                    There is one FIFO in the core 0 -&gt; core 1 direction, and one core 1 -&gt; core 0. Both are 32 bits wide and 8 words deep. 
                    Core 0 can see the read side of the 1-&gt;0 FIFO (RX), and the write side of 0-&gt;1 FIFO (TX). 
                    Core 1 can see the read side of the 0-&gt;1 FIFO (RX), and the write side of 1-&gt;0 FIFO (TX). 
                    The SIO IRQ for each core is the logical OR of the VLD, WOF and ROE fields of its FIFO_ST register.</description>
                <resetValue>0x00000002</resetValue>
                <fields>
                    <field>
                        <name>ROE</name>
                        <description>Sticky flag indicating the RX FIFO was read when empty. This read was ignored by the FIFO.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>WOF</name>
                        <description>Sticky flag indicating the TX FIFO was written when full. This write was ignored by the FIFO.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RDY</name>
                        <description>Value is 1 if this core's TX FIFO is not full (i.e. if FIFO_WR is ready for more data)</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VLD</name>
                        <description>Value is 1 if this core's RX FIFO is not empty (i.e. if FIFO_RD is valid)</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FIFO_WR</name>
                <addressOffset>0x00000054</addressOffset>
                <description>Write access to this core's TX FIFO</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FIFO_WR</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>FIFO_RD</name>
                <addressOffset>0x00000058</addressOffset>
                <description>Read access to this core's RX FIFO</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>FIFO_RD</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK_ST</name>
                <addressOffset>0x0000005c</addressOffset>
                <description>Spinlock state 
                    A bitmap containing the state of all 32 spinlocks (1=locked). 
                    Mainly intended for debugging.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK_ST</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_ACCUM0</name>
                <addressOffset>0x00000080</addressOffset>
                <description>Read/write access to accumulator 0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_ACCUM0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_ACCUM1</name>
                <addressOffset>0x00000084</addressOffset>
                <description>Read/write access to accumulator 1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_ACCUM1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_BASE0</name>
                <addressOffset>0x00000088</addressOffset>
                <description>Read/write access to BASE0 register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_BASE0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_BASE1</name>
                <addressOffset>0x0000008c</addressOffset>
                <description>Read/write access to BASE1 register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_BASE1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_BASE2</name>
                <addressOffset>0x00000090</addressOffset>
                <description>Read/write access to BASE2 register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_BASE2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_POP_LANE0</name>
                <addressOffset>0x00000094</addressOffset>
                <description>Read LANE0 result, and simultaneously write lane results to both accumulators (POP).</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_POP_LANE0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_POP_LANE1</name>
                <addressOffset>0x00000098</addressOffset>
                <description>Read LANE1 result, and simultaneously write lane results to both accumulators (POP).</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_POP_LANE1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_POP_FULL</name>
                <addressOffset>0x0000009c</addressOffset>
                <description>Read FULL result, and simultaneously write lane results to both accumulators (POP).</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_POP_FULL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_PEEK_LANE0</name>
                <addressOffset>0x000000a0</addressOffset>
                <description>Read LANE0 result, without altering any internal state (PEEK).</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_PEEK_LANE0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_PEEK_LANE1</name>
                <addressOffset>0x000000a4</addressOffset>
                <description>Read LANE1 result, without altering any internal state (PEEK).</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_PEEK_LANE1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_PEEK_FULL</name>
                <addressOffset>0x000000a8</addressOffset>
                <description>Read FULL result, without altering any internal state (PEEK).</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_PEEK_FULL</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_CTRL_LANE0</name>
                <addressOffset>0x000000ac</addressOffset>
                <description>Control register for lane 0</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OVERF</name>
                        <description>Set if either OVERF0 or OVERF1 is set.</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OVERF1</name>
                        <description>Indicates if any masked-off MSBs in ACCUM1 are set.</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>OVERF0</name>
                        <description>Indicates if any masked-off MSBs in ACCUM0 are set.</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BLEND</name>
                        <description>Only present on INTERP0 on each core. If BLEND mode is enabled: 
                            - LANE1 result is a linear interpolation between BASE0 and BASE1, controlled 
                            by the 8 LSBs of lane 1 shift and mask value (a fractional number between 
                            0 and 255/256ths) 
                            - LANE0 result does not have BASE0 added (yields only the 8 LSBs of lane 1 shift+mask value) 
                            - FULL result does not have lane 1 shift+mask value added (BASE2 + lane 0 shift+mask) 
                            LANE1 SIGNED flag controls whether the interpolation is signed or unsigned.</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FORCE_MSB</name>
                        <description>ORed into bits 29:28 of the lane result presented to the processor on the bus. 
                            No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence 
                            of pointers into flash or SRAM.</description>
                        <bitRange>[20:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADD_RAW</name>
                        <description>If 1, mask + shift is bypassed for LANE0 result. This does not affect FULL result.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CROSS_RESULT</name>
                        <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CROSS_INPUT</name>
                        <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware. 
                            Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SIGNED</name>
                        <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits 
                            before adding to BASE0, and LANE0 PEEK/POP appear extended to 32 bits when read by processor.</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MASK_MSB</name>
                        <description>The most-significant bit allowed to pass by the mask (inclusive) 
                            Setting MSB &lt; LSB may cause chip to turn inside-out</description>
                        <bitRange>[14:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MASK_LSB</name>
                        <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
                        <bitRange>[9:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SHIFT</name>
                        <description>Right-rotate applied to accumulator before masking. By appropriately configuring the masks, left and right shifts can be synthesised.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_CTRL_LANE1</name>
                <addressOffset>0x000000b0</addressOffset>
                <description>Control register for lane 1</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FORCE_MSB</name>
                        <description>ORed into bits 29:28 of the lane result presented to the processor on the bus. 
                            No effect on the internal 32-bit datapath. Handy for using a lane to generate sequence 
                            of pointers into flash or SRAM.</description>
                        <bitRange>[20:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADD_RAW</name>
                        <description>If 1, mask + shift is bypassed for LANE1 result. This does not affect FULL result.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CROSS_RESULT</name>
                        <description>If 1, feed the opposite lane's result into this lane's accumulator on POP.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CROSS_INPUT</name>
                        <description>If 1, feed the opposite lane's accumulator into this lane's shift + mask hardware. 
                            Takes effect even if ADD_RAW is set (the CROSS_INPUT mux is before the shift+mask bypass)</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SIGNED</name>
                        <description>If SIGNED is set, the shifted and masked accumulator value is sign-extended to 32 bits 
                            before adding to BASE1, and LANE1 PEEK/POP appear extended to 32 bits when read by processor.</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MASK_MSB</name>
                        <description>The most-significant bit allowed to pass by the mask (inclusive) 
                            Setting MSB &lt; LSB may cause chip to turn inside-out</description>
                        <bitRange>[14:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MASK_LSB</name>
                        <description>The least-significant bit allowed to pass by the mask (inclusive)</description>
                        <bitRange>[9:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SHIFT</name>
                        <description>Right-rotate applied to accumulator before masking. By appropriately configuring the masks, left and right shifts can be synthesised.</description>
                        <bitRange>[4:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_ACCUM0_ADD</name>
                <addressOffset>0x000000b4</addressOffset>
                <description>Values written here are atomically added to ACCUM0 
                    Reading yields lane 0's raw shift and mask value (BASE0 not added).</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_ACCUM0_ADD</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_ACCUM1_ADD</name>
                <addressOffset>0x000000b8</addressOffset>
                <description>Values written here are atomically added to ACCUM1 
                    Reading yields lane 1's raw shift and mask value (BASE1 not added).</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_ACCUM1_ADD</name>
                        <bitRange>[23:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTERP0_BASE_1AND0</name>
                <addressOffset>0x000000bc</addressOffset>
                <description>On write, the lower 16 bits go to BASE0, upper bits to BASE1 simultaneously. 
                    Each half is sign-extended to 32 bits if that lane's SIGNED flag is set.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTERP0_BASE_1AND0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
