raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>SPINLOCK7</name>
                <addressOffset>0x0000011c</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK8</name>
                <addressOffset>0x00000120</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK8</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK9</name>
                <addressOffset>0x00000124</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK9</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK10</name>
                <addressOffset>0x00000128</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK10</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK11</name>
                <addressOffset>0x0000012c</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK11</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK12</name>
                <addressOffset>0x00000130</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK12</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK13</name>
                <addressOffset>0x00000134</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK13</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK14</name>
                <addressOffset>0x00000138</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK14</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK15</name>
                <addressOffset>0x0000013c</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK15</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK16</name>
                <addressOffset>0x00000140</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK16</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK17</name>
                <addressOffset>0x00000144</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK17</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK18</name>
                <addressOffset>0x00000148</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK18</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK19</name>
                <addressOffset>0x0000014c</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK19</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK20</name>
                <addressOffset>0x00000150</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK20</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK21</name>
                <addressOffset>0x00000154</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK21</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK22</name>
                <addressOffset>0x00000158</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK22</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK23</name>
                <addressOffset>0x0000015c</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK23</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK24</name>
                <addressOffset>0x00000160</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK24</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK25</name>
                <addressOffset>0x00000164</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK25</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK26</name>
                <addressOffset>0x00000168</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK26</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK27</name>
                <addressOffset>0x0000016c</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK27</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK28</name>
                <addressOffset>0x00000170</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK28</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK29</name>
                <addressOffset>0x00000174</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK29</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK30</name>
                <addressOffset>0x00000178</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK30</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>SPINLOCK31</name>
                <addressOffset>0x0000017c</addressOffset>
                <description>Reading from a spinlock address will: 
                    - Return 0 if lock is already locked 
                    - Otherwise return nonzero, and simultaneously claim the lock

