raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    Writing (any value) releases the lock. 
                    If core 0 and core 1 attempt to claim the same lock simultaneously, core 0 wins. 
                    The value returned on success is 0x1 &lt;&lt; lock number.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SPINLOCK31</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>DOORBELL_OUT_SET</name>
                <addressOffset>0x00000180</addressOffset>
                <description>Trigger a doorbell interrupt on the opposite core.

                    Write 1 to a bit to set the corresponding bit in DOORBELL_IN on the opposite core. This raises the opposite core's doorbell interrupt.

                    Read to get the status of the doorbells currently asserted on the opposite core. This is equivalent to that core reading its own DOORBELL_IN status.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DOORBELL_OUT_SET</name>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DOORBELL_OUT_CLR</name>
                <addressOffset>0x00000184</addressOffset>
                <description>Clear doorbells which have been posted to the opposite core. This register is intended for debugging and initialisation purposes.

                    Writing 1 to a bit in DOORBELL_OUT_CLR clears the corresponding bit in DOORBELL_IN on the opposite core. Clearing all bits will cause that core's doorbell interrupt to deassert. Since the usual order of events is for software to send events using DOORBELL_OUT_SET, and acknowledge incoming events by writing to DOORBELL_IN_CLR, this register should be used with caution to avoid race conditions.

                    Reading returns the status of the doorbells currently asserted on the other core, i.e. is equivalent to that core reading its own DOORBELL_IN status.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DOORBELL_OUT_CLR</name>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>DOORBELL_IN_SET</name>
                <addressOffset>0x00000188</addressOffset>
                <description>Write 1s to trigger doorbell interrupts on this core. Read to get status of doorbells currently asserted on this core.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DOORBELL_IN_SET</name>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DOORBELL_IN_CLR</name>
                <addressOffset>0x0000018c</addressOffset>
                <description>Check and acknowledge doorbells posted to this core. This core's doorbell interrupt is asserted when any bit in this register is 1.

                    Write 1 to each bit to clear that bit. The doorbell interrupt deasserts once all bits are cleared. Read to get status of doorbells currently asserted on this core.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DOORBELL_IN_CLR</name>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>PERI_NONSEC</name>
                <addressOffset>0x00000190</addressOffset>
                <description>Detach certain core-local peripherals from Secure SIO, and attach them to Non-secure SIO, so that Non-secure software can use them. Attempting to access one of these peripherals from the Secure SIO when it is attached to the Non-secure SIO, or vice versa, will generate a bus error.

                    This register is per-core, and is only present on the Secure SIO.

                    Most SIO hardware is duplicated across the Secure and Non-secure SIO, so is not listed in this register.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TMDS</name>
                        <description>IF 1, detach TMDS encoder (of this core) from the Secure SIO, and attach to the Non-secure SIO.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERP1</name>
                        <description>If 1, detach interpolator 1 (of this core) from the Secure SIO, and attach to the Non-secure SIO.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERP0</name>
                        <description>If 1, detach interpolator 0 (of this core) from the Secure SIO, and attach to the Non-secure SIO.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RISCV_SOFTIRQ</name>
                <addressOffset>0x000001a0</addressOffset>
                <description>Control the assertion of the standard software interrupt (MIP.MSIP) on the RISC-V cores.

