raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                    Unlike the RISC-V timer, this interrupt is not routed to a normal system-level interrupt line, so can not be used by the Arm cores.

                    It is safe for both cores to write to this register on the same cycle. The set/clear effect is accumulated across both cores, and then applied. If a flag is both set and cleared on the same cycle, only the set takes effect.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CORE1_CLR</name>
                        <description>Write 1 to atomically clear the core 1 software interrupt flag. Read to get the status of this flag.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0_CLR</name>
                        <description>Write 1 to atomically clear the core 0 software interrupt flag. Read to get the status of this flag.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE1_SET</name>
                        <description>Write 1 to atomically set the core 1 software interrupt flag. Read to get the status of this flag.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CORE0_SET</name>
                        <description>Write 1 to atomically set the core 0 software interrupt flag. Read to get the status of this flag.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MTIME_CTRL</name>
                <addressOffset>0x000001a4</addressOffset>
                <description>Control register for the RISC-V 64-bit Machine-mode timer. This timer is only present in the Secure SIO, so is only accessible to an Arm core in Secure mode or a RISC-V core in Machine mode.

                    Note whilst this timer follows the RISC-V privileged specification, it is equally usable by the Arm cores. The interrupts are routed to normal system-level interrupt lines as well as to the MIP.MTIP inputs on the RISC-V cores.</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>DBGPAUSE_CORE1</name>
                        <description>If 1, the timer pauses when core 1 is in the debug halt state.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DBGPAUSE_CORE0</name>
                        <description>If 1, the timer pauses when core 0 is in the debug halt state.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FULLSPEED</name>
                        <description>If 1, increment the timer every cycle (i.e. run directly from the system clock), rather than incrementing on the system-level timer tick input.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EN</name>
                        <description>Timer enable bit. When 0, the timer will not increment automatically.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MTIME</name>
                <addressOffset>0x000001b0</addressOffset>
                <description>Read/write access to the high half of RISC-V Machine-mode timer. This register is shared between both cores. If both cores write on the same cycle, core 1 takes precedence.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MTIME</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MTIMEH</name>
                <addressOffset>0x000001b4</addressOffset>
                <description>Read/write access to the high half of RISC-V Machine-mode timer. This register is shared between both cores. If both cores write on the same cycle, core 1 takes precedence.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>MTIMEH</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MTIMECMP</name>
                <addressOffset>0x000001b8</addressOffset>
                <description>Low half of RISC-V Machine-mode timer comparator. This register is core-local, i.e., each core gets a copy of this register, with the comparison result routed to its own interrupt line.

                    The timer interrupt is asserted whenever MTIME is greater than or equal to MTIMECMP. This comparison is unsigned, and performed on the full 64-bit values.</description>
                <resetValue>0xffffffff</resetValue>
                <fields>
                    <field>
                        <name>MTIMECMP</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MTIMECMPH</name>
                <addressOffset>0x000001bc</addressOffset>
                <description>High half of RISC-V Machine-mode timer comparator. This register is core-local.

                    The timer interrupt is asserted whenever MTIME is greater than or equal to MTIMECMP. This comparison is unsigned, and performed on the full 64-bit values.</description>
                <resetValue>0xffffffff</resetValue>
                <fields>
                    <field>
                        <name>MTIMECMPH</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TMDS_CTRL</name>
                <addressOffset>0x000001c0</addressOffset>
                <description>Control register for TMDS encoder.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CLEAR_BALANCE</name>
                        <description>Clear the running DC balance state of the TMDS encoders. This bit should be written once at the beginning of each scanline.</description>
                        <bitRange>[28:28]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>PIX2_NOSHIFT</name>
                        <description>When encoding two pixels's worth of symbols in one cycle (a read of a PEEK/POP_DOUBLE register), the second encoder sees a shifted version of the colour data register.

                            This control disables that shift, so that both encoder layers see the same pixel data. This is used for pixel doubling.</description>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PIX_SHIFT</name>
                        <description>Shift applied to the colour data register with each read of a POP alias register.

