raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>SSPPCELLID2</name>
                <addressOffset>0x00000ff8</addressOffset>
                <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>SSPPCELLID2</name>
                        <description>These bits read back as 0x05</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SSPPCELLID3</name>
                <addressOffset>0x00000ffc</addressOffset>
                <description>PrimeCell identification registers, SSPPCellID0-3 on page 3-16</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>SSPPCELLID3</name>
                        <description>These bits read back as 0xB1</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral derivedFrom="SPI0">
        <name>SPI1</name>
        <baseAddress>0x40088000</baseAddress>
        <interrupt>
            <name>SPI1_IRQ</name>
            <value>32</value>
        </interrupt>
    </peripheral>
    <peripheral>
        <name>SYSCFG</name>
        <description>Register block for various chip control signals</description>
        <baseAddress>0x40008000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>24</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>PROC_CONFIG</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Configuration for processors</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PROC1_HALTED</name>
                        <description>Indication that proc1 has halted</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PROC0_HALTED</name>
                        <description>Indication that proc0 has halted</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC_IN_SYNC_BYPASS</name>
                <addressOffset>0x00000004</addressOffset>
                <description>For each bit, if 1, bypass the input synchronizer between that GPIO 
                    and the GPIO input register in the SIO. The input synchronizers should 
                    generally be unbypassed, to avoid injecting metastabilities into processors. 
                    If you're feeling brave, you can bypass to save two cycles of input 
                    latency. This register applies to GPIO 0...31.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC_IN_SYNC_BYPASS_HI</name>
                <addressOffset>0x00000008</addressOffset>
                <description>For each bit, if 1, bypass the input synchronizer between that GPIO 
                    and the GPIO input register in the SIO. The input synchronizers should 
                    generally be unbypassed, to avoid injecting metastabilities into processors. 
                    If you're feeling brave, you can bypass to save two cycles of input 
                    latency. This register applies to GPIO 32...47. USB GPIO 56..57 QSPI GPIO 58..63</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QSPI_SD</name>
                        <bitRange>[31:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_CSN</name>
                        <bitRange>[27:27]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>QSPI_SCK</name>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DM</name>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB_DP</name>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>GPIO</name>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>DBGFORCE</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Directly control the chip SWD debug port</description>
                <resetValue>0x00000006</resetValue>
                <fields>
                    <field>
                        <name>ATTACH</name>
                        <description>Attach chip debug port to syscfg controls, and disconnect it from external SWD pads.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SWCLK</name>
                        <description>Directly drive SWCLK, if ATTACH is set</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SWDI</name>
                        <description>Directly drive SWDIO input, if ATTACH is set</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SWDO</name>
                        <description>Observe the value of SWDIO output.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>MEMPOWERDOWN</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Control PD pins to memories. 
                    Set high to put memories to a low power state. In this state the memories will retain contents but not be accessible 
                    Use with caution</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>BOOTRAM</name>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ROM</name>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>USB</name>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM9</name>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM8</name>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM7</name>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM6</name>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM5</name>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM4</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM3</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM2</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM1</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SRAM0</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>AUXCTRL</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Auxiliary system control register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>AUXCTRL</name>
                        <description>* Bits 7:3: Reserved
                            * Bit 2: Set to mask OTP power analogue power supply detection from resetting OTP controller and PSM

                            * Bit 1: When clear, the LPOSC output is XORed into the TRNG ROSC output as an additional, uncorrelated entropy source. When set, this behaviour is disabled.

                            * Bit 0: Force POWMAN clock to switch to LPOSC, by asserting its WDRESET input. This must be set before initiating a watchdog reset of the RSM from a stage that includes CLOCKS, if POWMAN is running from clk_ref at the point that the watchdog reset takes place. Otherwise, the short pulse generated on clk_ref by the reset of the CLOCKS block may affect POWMAN register state.</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
