raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>SYSINFO</name>
        <baseAddress>0x40000000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>24</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CHIP_ID</name>
                <addressOffset>0x00000000</addressOffset>
                <description>JEDEC JEP-106 compliant chip identifier.</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <bitRange>[31:28]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PART</name>
                        <bitRange>[27:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>MANUFACTURER</name>
                        <bitRange>[11:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STOP_BIT</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PACKAGE_SEL</name>
                <addressOffset>0x00000004</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PACKAGE_SEL</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PLATFORM</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Platform register. Allows software to know what environment it is running in during pre-production development. Post-production, the PLATFORM is always ASIC, non-SIM.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>GATESIM</name>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BATCHSIM</name>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HDLSIM</name>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ASIC</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPGA</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>GITREF_RP2350</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Git hash of the chip source. Used to identify chip version.</description>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>GITREF_RP2350</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>TBMAN</name>
        <description>For managing simulation testbenches</description>
        <baseAddress>0x40160000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>4</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>PLATFORM</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Indicates the type of platform in use</description>
                <resetValue>0x00000001</resetValue>
                <fields>
                    <field>
                        <name>HDLSIM</name>
                        <description>Indicates the platform is a simulation</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FPGA</name>
                        <description>Indicates the platform is an FPGA</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ASIC</name>
                        <description>Indicates the platform is an ASIC</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>TICKS</name>
        <baseAddress>0x40108000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>72</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>PROC0_CTRL</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC0_CYCLES</name>
                <addressOffset>0x00000004</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PROC0_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC0_COUNT</name>
                <addressOffset>0x00000008</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>PROC0_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC1_CTRL</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC1_CYCLES</name>
                <addressOffset>0x00000010</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>PROC1_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>PROC1_COUNT</name>
                <addressOffset>0x00000014</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>PROC1_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER0_CTRL</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER0_CYCLES</name>
                <addressOffset>0x0000001c</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMER0_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER0_COUNT</name>
                <addressOffset>0x00000020</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>TIMER0_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER1_CTRL</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER1_CYCLES</name>
                <addressOffset>0x00000028</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>TIMER1_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>TIMER1_COUNT</name>
                <addressOffset>0x0000002c</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>TIMER1_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>WATCHDOG_CTRL</name>
                <addressOffset>0x00000030</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>WATCHDOG_CYCLES</name>
                <addressOffset>0x00000034</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>WATCHDOG_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>WATCHDOG_COUNT</name>
                <addressOffset>0x00000038</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>WATCHDOG_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RISCV_CTRL</name>
                <addressOffset>0x0000003c</addressOffset>
                <description>Controls the tick generator</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RUNNING</name>
                        <description>Is the tick generator running?</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>start / stop tick generation</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RISCV_CYCLES</name>
                <addressOffset>0x00000040</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RISCV_CYCLES</name>
                        <description>Total number of clk_tick cycles before the next tick.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>RISCV_COUNT</name>
                <addressOffset>0x00000044</addressOffset>
                <resetMask>0x00000000</resetMask>
                <fields>
                    <field>
                        <name>RISCV_COUNT</name>
                        <description>Count down timer: the remaining number clk_tick cycles before the next tick is generated.</description>
                        <bitRange>[8:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
