raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>UARTICR</name>
                <addressOffset>0x00000044</addressOffset>
                <description>Interrupt Clear Register, UARTICR</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>OEIC</name>
                        <description>Overrun error interrupt clear. Clears the UARTOEINTR interrupt.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>BEIC</name>
                        <description>Break error interrupt clear. Clears the UARTBEINTR interrupt.</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>PEIC</name>
                        <description>Parity error interrupt clear. Clears the UARTPEINTR interrupt.</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>FEIC</name>
                        <description>Framing error interrupt clear. Clears the UARTFEINTR interrupt.</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RTIC</name>
                        <description>Receive timeout interrupt clear. Clears the UARTRTINTR interrupt.</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>TXIC</name>
                        <description>Transmit interrupt clear. Clears the UARTTXINTR interrupt.</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RXIC</name>
                        <description>Receive interrupt clear. Clears the UARTRXINTR interrupt.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>DSRMIC</name>
                        <description>nUARTDSR modem interrupt clear. Clears the UARTDSRINTR interrupt.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>DCDMIC</name>
                        <description>nUARTDCD modem interrupt clear. Clears the UARTDCDINTR interrupt.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>CTSMIC</name>
                        <description>nUARTCTS modem interrupt clear. Clears the UARTCTSINTR interrupt.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>RIMIC</name>
                        <description>nUARTRI modem interrupt clear. Clears the UARTRIINTR interrupt.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTDMACR</name>
                <addressOffset>0x00000048</addressOffset>
                <description>DMA Control Register, UARTDMACR</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>DMAONERR</name>
                        <description>DMA on error. If this bit is set to 1, the DMA receive request outputs, UARTRXDMASREQ or UARTRXDMABREQ, are disabled when the UART error interrupt is asserted.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TXDMAE</name>
                        <description>Transmit DMA enable. If this bit is set to 1, DMA for the transmit FIFO is enabled.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RXDMAE</name>
                        <description>Receive DMA enable. If this bit is set to 1, DMA for the receive FIFO is enabled.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPERIPHID0</name>
                <addressOffset>0x00000fe0</addressOffset>
                <description>UARTPeriphID0 Register</description>
                <resetValue>0x00000011</resetValue>
                <fields>
                    <field>
                        <name>PARTNUMBER0</name>
                        <description>These bits read back as 0x11</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPERIPHID1</name>
                <addressOffset>0x00000fe4</addressOffset>
                <description>UARTPeriphID1 Register</description>
                <resetValue>0x00000010</resetValue>
                <fields>
                    <field>
                        <name>DESIGNER0</name>
                        <description>These bits read back as 0x1</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>PARTNUMBER1</name>
                        <description>These bits read back as 0x0</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPERIPHID2</name>
                <addressOffset>0x00000fe8</addressOffset>
                <description>UARTPeriphID2 Register</description>
                <resetValue>0x00000034</resetValue>
                <fields>
                    <field>
                        <name>REVISION</name>
                        <description>This field depends on the revision of the UART: r1p0 0x0 r1p1 0x1 r1p3 0x2 r1p4 0x2 r1p5 0x3</description>
                        <bitRange>[7:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DESIGNER1</name>
                        <description>These bits read back as 0x4</description>
                        <bitRange>[3:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPERIPHID3</name>
                <addressOffset>0x00000fec</addressOffset>
                <description>UARTPeriphID3 Register</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CONFIGURATION</name>
                        <description>These bits read back as 0x00</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPCELLID0</name>
                <addressOffset>0x00000ff0</addressOffset>
                <description>UARTPCellID0 Register</description>
                <resetValue>0x0000000d</resetValue>
                <fields>
                    <field>
                        <name>UARTPCELLID0</name>
                        <description>These bits read back as 0x0D</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPCELLID1</name>
                <addressOffset>0x00000ff4</addressOffset>
                <description>UARTPCellID1 Register</description>
                <resetValue>0x000000f0</resetValue>
                <fields>
                    <field>
                        <name>UARTPCELLID1</name>
                        <description>These bits read back as 0xF0</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPCELLID2</name>
                <addressOffset>0x00000ff8</addressOffset>
                <description>UARTPCellID2 Register</description>
                <resetValue>0x00000005</resetValue>
                <fields>
                    <field>
                        <name>UARTPCELLID2</name>
                        <description>These bits read back as 0x05</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>UARTPCELLID3</name>
                <addressOffset>0x00000ffc</addressOffset>
                <description>UARTPCellID3 Register</description>
                <resetValue>0x000000b1</resetValue>
                <fields>
                    <field>
                        <name>UARTPCELLID3</name>
                        <description>These bits read back as 0xB1</description>
                        <bitRange>[7:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
