raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
        <name>UART1</name>
        <baseAddress>0x40078000</baseAddress>
        <interrupt>
            <name>UART1_IRQ</name>
            <value>34</value>
        </interrupt>
    </peripheral>
    <peripheral>
        <name>USB</name>
        <description>USB FS/LS controller device registers</description>
        <baseAddress>0x50110000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>280</size>
            <usage>registers</usage>
        </addressBlock>
        <interrupt>
            <name>USBCTRL_IRQ</name>
            <value>14</value>
        </interrupt>
        <registers>
            <register>
                <name>ADDR_ENDP</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Device address and endpoint control</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Device endpoint to send data to. Only valid for HOST mode.</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>In device mode, the address that the device should respond to. Set in response to a SET_ADDR setup packet from the host. In host mode set to the address of the device to communicate with.</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP1</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Interrupt endpoint 1. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP2</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Interrupt endpoint 2. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP3</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Interrupt endpoint 3. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP4</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Interrupt endpoint 4. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP5</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Interrupt endpoint 5. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP6</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Interrupt endpoint 6. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP7</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Interrupt endpoint 7. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP8</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Interrupt endpoint 8. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP9</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Interrupt endpoint 9. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP10</name>
                <addressOffset>0x00000028</addressOffset>
                <description>Interrupt endpoint 10. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP11</name>
                <addressOffset>0x0000002c</addressOffset>
                <description>Interrupt endpoint 11. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP12</name>
                <addressOffset>0x00000030</addressOffset>
                <description>Interrupt endpoint 12. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP13</name>
                <addressOffset>0x00000034</addressOffset>
                <description>Interrupt endpoint 13. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>ADDR_ENDP14</name>
                <addressOffset>0x00000038</addressOffset>
                <description>Interrupt endpoint 14. Only valid for HOST mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>INTEP_PREAMBLE</name>
                        <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTEP_DIR</name>
                        <description>Direction of the interrupt endpoint. In=0, Out=1</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT</name>
                        <description>Endpoint number of the interrupt endpoint</description>
                        <bitRange>[19:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ADDRESS</name>
                        <description>Device address</description>
                        <bitRange>[6:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
