raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>INTF</name>
                <addressOffset>0x00000094</addressOffset>
                <description>Interrupt Force</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EPX_STOPPED_ON_NAK</name>
                        <description>Source: NAK_POLL.EPX_STOPPED_ON_NAK</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_SM_WATCHDOG_FIRED</name>
                        <description>Source: DEV_SM_WATCHDOG.FIRED</description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT_ERROR</name>
                        <description>Source: SIE_STATUS.ENDPOINT_ERROR</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RX_SHORT_PACKET</name>
                        <description>Source: SIE_STATUS.RX_SHORT_PACKET</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>EP_STALL_NAK</name>
                        <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ABORT_DONE</name>
                        <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_SOF</name>
                        <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SETUP_REQ</name>
                        <description>Device. Source: SIE_STATUS.SETUP_REC</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_RESUME_FROM_HOST</name>
                        <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_SUSPEND</name>
                        <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEV_CONN_DIS</name>
                        <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUS_RESET</name>
                        <description>Source: SIE_STATUS.BUS_RESET</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>VBUS_DETECT</name>
                        <description>Source: SIE_STATUS.VBUS_DETECTED</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STALL</name>
                        <description>Source: SIE_STATUS.STALL_REC</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_CRC</name>
                        <description>Source: SIE_STATUS.CRC_ERROR</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_BIT_STUFF</name>
                        <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_RX_OVERFLOW</name>
                        <description>Source: SIE_STATUS.RX_OVERFLOW</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_RX_TIMEOUT</name>
                        <description>Source: SIE_STATUS.RX_TIMEOUT</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ERROR_DATA_SEQ</name>
                        <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFF_STATUS</name>
                        <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TRANS_COMPLETE</name>
                        <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HOST_SOF</name>
                        <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HOST_RESUME</name>
                        <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HOST_CONN_DIS</name>
                        <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>INTS</name>
                <addressOffset>0x00000098</addressOffset>
                <description>Interrupt status after masking &amp; forcing</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EPX_STOPPED_ON_NAK</name>
                        <description>Source: NAK_POLL.EPX_STOPPED_ON_NAK</description>
                        <bitRange>[23:23]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_SM_WATCHDOG_FIRED</name>
                        <description>Source: DEV_SM_WATCHDOG.FIRED</description>
                        <bitRange>[22:22]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ENDPOINT_ERROR</name>
                        <description>Source: SIE_STATUS.ENDPOINT_ERROR</description>
                        <bitRange>[21:21]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>RX_SHORT_PACKET</name>
                        <description>Source: SIE_STATUS.RX_SHORT_PACKET</description>
                        <bitRange>[20:20]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>EP_STALL_NAK</name>
                        <description>Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by clearing all bits in EP_STATUS_STALL_NAK.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ABORT_DONE</name>
                        <description>Raised when any bit in ABORT_DONE is set. Clear by clearing all bits in ABORT_DONE.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_SOF</name>
                        <description>Set every time the device receives a SOF (Start of Frame) packet. Cleared by reading SOF_RD</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SETUP_REQ</name>
                        <description>Device. Source: SIE_STATUS.SETUP_REC</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_RESUME_FROM_HOST</name>
                        <description>Set when the device receives a resume from the host. Cleared by writing to SIE_STATUS.RESUME</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_SUSPEND</name>
                        <description>Set when the device suspend state changes. Cleared by writing to SIE_STATUS.SUSPENDED</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>DEV_CONN_DIS</name>
                        <description>Set when the device connection state changes. Cleared by writing to SIE_STATUS.CONNECTED</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BUS_RESET</name>
                        <description>Source: SIE_STATUS.BUS_RESET</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>VBUS_DETECT</name>
                        <description>Source: SIE_STATUS.VBUS_DETECTED</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STALL</name>
                        <description>Source: SIE_STATUS.STALL_REC</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_CRC</name>
                        <description>Source: SIE_STATUS.CRC_ERROR</description>
                        <bitRange>[9:9]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_BIT_STUFF</name>
                        <description>Source: SIE_STATUS.BIT_STUFF_ERROR</description>
                        <bitRange>[8:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_RX_OVERFLOW</name>
                        <description>Source: SIE_STATUS.RX_OVERFLOW</description>
                        <bitRange>[7:7]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_RX_TIMEOUT</name>
                        <description>Source: SIE_STATUS.RX_TIMEOUT</description>
                        <bitRange>[6:6]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>ERROR_DATA_SEQ</name>
                        <description>Source: SIE_STATUS.DATA_SEQ_ERROR</description>
                        <bitRange>[5:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BUFF_STATUS</name>
                        <description>Raised when any bit in BUFF_STATUS is set. Clear by clearing all bits in BUFF_STATUS.</description>
                        <bitRange>[4:4]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TRANS_COMPLETE</name>
                        <description>Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by writing to this bit.</description>
                        <bitRange>[3:3]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HOST_SOF</name>
                        <description>Host: raised every time the host sends a SOF (Start of Frame). Cleared by reading SOF_RD</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HOST_RESUME</name>
                        <description>Host: raised when a device wakes up the host. Cleared by writing to SIE_STATUS.RESUME</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HOST_CONN_DIS</name>
                        <description>Host: raised when a device is connected or disconnected (i.e. when SIE_STATUS.SPEED changes). Cleared by writing to SIE_STATUS.SPEED</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SOF_TIMESTAMP_RAW</name>
                <addressOffset>0x00000100</addressOffset>
                <description>Device only. Raw value of free-running PHY clock counter @48MHz. Used to calculate time between SOF events.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SOF_TIMESTAMP_RAW</name>
                        <bitRange>[20:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SOF_TIMESTAMP_LAST</name>
                <addressOffset>0x00000104</addressOffset>
                <description>Device only. Value of free-running PHY clock counter @48MHz when last SOF event occurred.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SOF_TIMESTAMP_LAST</name>
                        <bitRange>[20:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SM_STATE</name>
                <addressOffset>0x00000108</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>RX_DASM</name>
                        <bitRange>[11:8]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>BC_STATE</name>
                        <bitRange>[7:5]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>STATE</name>
                        <bitRange>[4:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EP_TX_ERROR</name>
                <addressOffset>0x0000010c</addressOffset>
                <description>TX error count for each endpoint. Write to each field to reset the counter to 0.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>EP15</name>
                        <bitRange>[31:30]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP14</name>
                        <bitRange>[29:28]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP13</name>
                        <bitRange>[27:26]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP12</name>
                        <bitRange>[25:24]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP11</name>
                        <bitRange>[23:22]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP10</name>
                        <bitRange>[21:20]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP9</name>
                        <bitRange>[19:18]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP8</name>
                        <bitRange>[17:16]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP7</name>
                        <bitRange>[15:14]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP6</name>
                        <bitRange>[13:12]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP5</name>
                        <bitRange>[11:10]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP4</name>
                        <bitRange>[9:8]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP3</name>
                        <bitRange>[7:6]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP2</name>
                        <bitRange>[5:4]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP1</name>
                        <bitRange>[3:2]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                    <field>
                        <name>EP0</name>
                        <bitRange>[1:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
