raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>EP9_OUT_CONTROL</name>
                <addressOffset>0x0000004c</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFERED</name>
                        <description>This endpoint is double buffered.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_BUFF</name>
                        <description>Trigger an interrupt each time a buffer is done.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                        <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT_TYPE</name>
                        <bitRange>[27:26]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>Control</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Isochronous</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Bulk</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Interrupt</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_STALL</name>
                        <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_NAK</name>
                        <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFFER_ADDRESS</name>
                        <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EP10_IN_CONTROL</name>
                <addressOffset>0x00000050</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFERED</name>
                        <description>This endpoint is double buffered.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_BUFF</name>
                        <description>Trigger an interrupt each time a buffer is done.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                        <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT_TYPE</name>
                        <bitRange>[27:26]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>Control</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Isochronous</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Bulk</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Interrupt</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_STALL</name>
                        <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_NAK</name>
                        <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFFER_ADDRESS</name>
                        <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EP10_OUT_CONTROL</name>
                <addressOffset>0x00000054</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFERED</name>
                        <description>This endpoint is double buffered.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_BUFF</name>
                        <description>Trigger an interrupt each time a buffer is done.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                        <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT_TYPE</name>
                        <bitRange>[27:26]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>Control</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Isochronous</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Bulk</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Interrupt</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_STALL</name>
                        <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_NAK</name>
                        <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFFER_ADDRESS</name>
                        <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EP11_IN_CONTROL</name>
                <addressOffset>0x00000058</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFERED</name>
                        <description>This endpoint is double buffered.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_BUFF</name>
                        <description>Trigger an interrupt each time a buffer is done.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                        <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT_TYPE</name>
                        <bitRange>[27:26]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>Control</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Isochronous</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Bulk</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Interrupt</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_STALL</name>
                        <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_NAK</name>
                        <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFFER_ADDRESS</name>
                        <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EP11_OUT_CONTROL</name>
                <addressOffset>0x0000005c</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFERED</name>
                        <description>This endpoint is double buffered.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_BUFF</name>
                        <description>Trigger an interrupt each time a buffer is done.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                        <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT_TYPE</name>
                        <bitRange>[27:26]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>Control</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Isochronous</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Bulk</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Interrupt</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_STALL</name>
                        <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_NAK</name>
                        <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFFER_ADDRESS</name>
                        <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EP12_IN_CONTROL</name>
                <addressOffset>0x00000060</addressOffset>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>ENABLE</name>
                        <description>Enable this endpoint. The device will not reply to any packets for this endpoint if this bit is not set.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFERED</name>
                        <description>This endpoint is double buffered.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_BUFF</name>
                        <description>Trigger an interrupt each time a buffer is done.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_PER_DOUBLE_BUFF</name>
                        <description>Trigger an interrupt each time both buffers are done. Only valid in double buffered mode.</description>
                        <bitRange>[28:28]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>ENDPOINT_TYPE</name>
                        <bitRange>[27:26]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>Control</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Isochronous</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Bulk</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Interrupt</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_STALL</name>
                        <description>Trigger an interrupt if a STALL is sent. Intended for debug only.</description>
                        <bitRange>[17:17]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INTERRUPT_ON_NAK</name>
                        <description>Trigger an interrupt if a NAK is sent. Intended for debug only.</description>
                        <bitRange>[16:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BUFFER_ADDRESS</name>
                        <description>64 byte aligned buffer address for this EP (bits 0-5 are ignored). Relative to the start of the DPRAM.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
