raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
            <register>
                <name>EP4_OUT_BUFFER_CONTROL</name>
                <addressOffset>0x000000a4</addressOffset>
                <description>Buffer control for both buffers of an endpoint. Fields ending in a _1 are for buffer 1. 
                    Fields ending in a _0 are for buffer 0. Buffer 1 controls are only valid if the endpoint is in double buffered mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FULL_1</name>
                        <description>Buffer 1 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LAST_1</name>
                        <description>Buffer 1 is the last buffer of the transfer.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PID_1</name>
                        <description>The data pid of buffer 1.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFER_ISO_OFFSET</name>
                        <description>The number of bytes buffer 1 is offset from buffer 0 in Isochronous mode. Only valid in double buffered mode for an Isochronous endpoint. 
                            For a non Isochronous endpoint the offset is always 64 bytes.</description>
                        <bitRange>[28:27]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>128</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>256</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>512</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1024</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AVAILABLE_1</name>
                        <description>Buffer 1 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LENGTH_1</name>
                        <description>The length of the data in buffer 1.</description>
                        <bitRange>[25:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FULL_0</name>
                        <description>Buffer 0 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LAST_0</name>
                        <description>Buffer 0 is the last buffer of the transfer.</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PID_0</name>
                        <description>The data pid of buffer 0.</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RESET</name>
                        <description>Reset the buffer selector to buffer 0.</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STALL</name>
                        <description>Reply with a stall (valid for both buffers).</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AVAILABLE_0</name>
                        <description>Buffer 0 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LENGTH_0</name>
                        <description>The length of the data in buffer 1.</description>
                        <bitRange>[9:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EP5_IN_BUFFER_CONTROL</name>
                <addressOffset>0x000000a8</addressOffset>
                <description>Buffer control for both buffers of an endpoint. Fields ending in a _1 are for buffer 1. 
                    Fields ending in a _0 are for buffer 0. Buffer 1 controls are only valid if the endpoint is in double buffered mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FULL_1</name>
                        <description>Buffer 1 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LAST_1</name>
                        <description>Buffer 1 is the last buffer of the transfer.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PID_1</name>
                        <description>The data pid of buffer 1.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFER_ISO_OFFSET</name>
                        <description>The number of bytes buffer 1 is offset from buffer 0 in Isochronous mode. Only valid in double buffered mode for an Isochronous endpoint. 
                            For a non Isochronous endpoint the offset is always 64 bytes.</description>
                        <bitRange>[28:27]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>128</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>256</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>512</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1024</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AVAILABLE_1</name>
                        <description>Buffer 1 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LENGTH_1</name>
                        <description>The length of the data in buffer 1.</description>
                        <bitRange>[25:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FULL_0</name>
                        <description>Buffer 0 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LAST_0</name>
                        <description>Buffer 0 is the last buffer of the transfer.</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PID_0</name>
                        <description>The data pid of buffer 0.</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RESET</name>
                        <description>Reset the buffer selector to buffer 0.</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STALL</name>
                        <description>Reply with a stall (valid for both buffers).</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AVAILABLE_0</name>
                        <description>Buffer 0 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LENGTH_0</name>
                        <description>The length of the data in buffer 1.</description>
                        <bitRange>[9:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>EP5_OUT_BUFFER_CONTROL</name>
                <addressOffset>0x000000ac</addressOffset>
                <description>Buffer control for both buffers of an endpoint. Fields ending in a _1 are for buffer 1. 
                    Fields ending in a _0 are for buffer 0. Buffer 1 controls are only valid if the endpoint is in double buffered mode.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FULL_1</name>
                        <description>Buffer 1 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
                        <bitRange>[31:31]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LAST_1</name>
                        <description>Buffer 1 is the last buffer of the transfer.</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PID_1</name>
                        <description>The data pid of buffer 1.</description>
                        <bitRange>[29:29]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DOUBLE_BUFFER_ISO_OFFSET</name>
                        <description>The number of bytes buffer 1 is offset from buffer 0 in Isochronous mode. Only valid in double buffered mode for an Isochronous endpoint. 
                            For a non Isochronous endpoint the offset is always 64 bytes.</description>
                        <bitRange>[28:27]</bitRange>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>128</name>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>256</name>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>512</name>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>1024</name>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AVAILABLE_1</name>
                        <description>Buffer 1 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LENGTH_1</name>
                        <description>The length of the data in buffer 1.</description>
                        <bitRange>[25:16]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FULL_0</name>
                        <description>Buffer 0 is full. For an IN transfer (TX to the host) the bit is set to indicate the data is valid. For an OUT transfer (RX from the host) this bit should be left as a 0. The host will set it when it has filled the buffer with data.</description>
                        <bitRange>[15:15]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LAST_0</name>
                        <description>Buffer 0 is the last buffer of the transfer.</description>
                        <bitRange>[14:14]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PID_0</name>
                        <description>The data pid of buffer 0.</description>
                        <bitRange>[13:13]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RESET</name>
                        <description>Reset the buffer selector to buffer 0.</description>
                        <bitRange>[12:12]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STALL</name>
                        <description>Reply with a stall (valid for both buffers).</description>
                        <bitRange>[11:11]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>AVAILABLE_0</name>
                        <description>Buffer 0 is available. This bit is set to indicate the buffer can be used by the controller. The controller clears the available bit when writing the status back.</description>
                        <bitRange>[10:10]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LENGTH_0</name>
                        <description>The length of the data in buffer 1.</description>
                        <bitRange>[9:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
