raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>

    <peripheral>
        <name>WATCHDOG</name>
        <baseAddress>0x400d8000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>44</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CTRL</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Watchdog control 
                    The rst_wdsel register determines which subsystems are reset when the watchdog is triggered. 
                    The watchdog can be triggered in software.</description>
                <resetValue>0x07000000</resetValue>
                <fields>
                    <field>
                        <name>TRIGGER</name>
                        <description>Trigger a watchdog reset</description>
                        <bitRange>[31:31]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>ENABLE</name>
                        <description>When not enabled the watchdog timer is paused</description>
                        <bitRange>[30:30]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PAUSE_DBG1</name>
                        <description>Pause the watchdog timer when processor 1 is in debug mode</description>
                        <bitRange>[26:26]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PAUSE_DBG0</name>
                        <description>Pause the watchdog timer when processor 0 is in debug mode</description>
                        <bitRange>[25:25]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PAUSE_JTAG</name>
                        <description>Pause the watchdog timer when JTAG is accessing the bus fabric</description>
                        <bitRange>[24:24]</bitRange>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>TIME</name>
                        <description>Indicates the time in usec before a watchdog reset will be triggered</description>
                        <bitRange>[23:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>LOAD</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Load the watchdog timer. The maximum setting is 0xffffff which corresponds to approximately 16 seconds.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>LOAD</name>
                        <bitRange>[23:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>REASON</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Logs the reason for the last reset. Both bits are zero for the case of a hardware reset.

                    Additionally, as of RP2350, a debugger warm reset of either core (SYSRESETREQ or hartreset) will also clear the watchdog reason register, so that software loaded under the debugger following a watchdog timeout will not continue to see the timeout condition.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>FORCE</name>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>TIMER</name>
                        <bitRange>[0:0]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH0</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Scratch register. Information persists through soft reset of the chip.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH0</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH1</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Scratch register. Information persists through soft reset of the chip.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH1</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH2</name>
                <addressOffset>0x00000014</addressOffset>
                <description>Scratch register. Information persists through soft reset of the chip.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH2</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH3</name>
                <addressOffset>0x00000018</addressOffset>
                <description>Scratch register. Information persists through soft reset of the chip.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH3</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH4</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>Scratch register. Information persists through soft reset of the chip.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH4</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH5</name>
                <addressOffset>0x00000020</addressOffset>
                <description>Scratch register. Information persists through soft reset of the chip.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH5</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH6</name>
                <addressOffset>0x00000024</addressOffset>
                <description>Scratch register. Information persists through soft reset of the chip.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH6</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>SCRATCH7</name>
                <addressOffset>0x00000028</addressOffset>
                <description>Scratch register. Information persists through soft reset of the chip.</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>SCRATCH7</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
