raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>XIP_AUX</name>
        <description>Auxiliary DMA access to XIP FIFOs, via fast AHB bus access</description>
        <baseAddress>0x50500000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>12</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>STREAM</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Read the XIP stream FIFO (fast bus access to XIP_CTRL_STREAM_FIFO)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STREAM</name>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
            <register>
                <name>QMI_DIRECT_TX</name>
                <addressOffset>0x00000004</addressOffset>
                <description>Write to the QMI direct-mode TX FIFO (fast bus access to QMI_DIRECT_TX)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>NOPUSH</name>
                        <description>Inhibit the RX FIFO push that would correspond to this TX FIFO entry.

                            Useful to avoid garbage appearing in the RX FIFO when pushing the command at the beginning of a SPI transfer.</description>
                        <bitRange>[20:20]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>OE</name>
                        <description>Output enable (active-high). For single width (SPI), this field is ignored, and SD0 is always set to output, with SD1 always set to input.

                            For dual and quad width (DSPI/QSPI), this sets whether the relevant SDx pads are set to output whilst transferring this FIFO record. In this case the command/address should have OE set, and the data transfer should have OE set or clear depending on the direction of the transfer.</description>
                        <bitRange>[19:19]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>DWIDTH</name>
                        <description>Data width. If 0, hardware will transmit the 8 LSBs of the DIRECT_TX DATA field, and return an 8-bit value in the 8 LSBs of DIRECT_RX. If 1, the full 16-bit width is used. 8-bit and 16-bit transfers can be mixed freely.</description>
                        <bitRange>[18:18]</bitRange>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>IWIDTH</name>
                        <description>Configure whether this FIFO record is transferred with single/dual/quad interface width (0/1/2). Different widths can be mixed freely.</description>
                        <bitRange>[17:16]</bitRange>
                        <access>write-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>S</name>
                                <value>0</value>
                                <description>Single width</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>D</name>
                                <value>1</value>
                                <description>Dual width</description>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Q</name>
                                <value>2</value>
                                <description>Quad width</description>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DATA</name>
                        <description>Data pushed here will be clocked out falling edges of SCK (or before the very first rising edge of SCK, if this is the first pulse). For each byte clocked out, the interface will simultaneously sample one byte, on rising edges of SCK, and push this to the DIRECT_RX FIFO.

                            For 16-bit data, the least-significant byte is transmitted first.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>write-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>QMI_DIRECT_RX</name>
                <addressOffset>0x00000008</addressOffset>
                <description>Read from the QMI direct-mode RX FIFO (fast bus access to QMI_DIRECT_RX)</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>QMI_DIRECT_RX</name>
                        <description>With each byte clocked out on the serial interface, one byte will simultaneously be clocked in, and will appear in this FIFO. The serial interface will stall when this FIFO is full, to avoid dropping data.

                            When 16-bit data is pushed into the TX FIFO, the corresponding RX FIFO push will also contain 16 bits of data. The least-significant byte is the first one received.</description>
                        <bitRange>[15:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>XIP_CTRL</name>
        <description>QSPI flash execute-in-place block</description>
        <baseAddress>0x400c8000</baseAddress>
        <addressBlock>
            <offset>0</offset>
            <size>32</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                <name>CTRL</name>
                <addressOffset>0x00000000</addressOffset>
                <description>Cache control register. Read-only from a Non-secure context.</description>
                <resetValue>0x00000083</resetValue>
                <fields>
                    <field>
                        <name>WRITABLE_M1</name>
                        <description>If 1, enable writes to XIP memory window 1 (addresses 0x11000000 through 0x11ffffff, and their uncached mirrors). If 0, this region is read-only.

