raspberrypi/pico-sdk/src/rp2350/hardware_regs/RP2350.svd
                            Accesses to the uncached (addr[26] == 1) window will never query the cache, irrespective of this bit.

                            There is no cache-as-SRAM address window. Cache lines are allocated for SRAM-like use by individually pinning them, and keeping the cache enabled.</description>
                        <bitRange>[0:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>STAT</name>
                <addressOffset>0x00000008</addressOffset>
                <resetValue>0x00000002</resetValue>
                <fields>
                    <field>
                        <name>FIFO_FULL</name>
                        <description>When 1, indicates the XIP streaming FIFO is completely full. 
                            The streaming FIFO is 2 entries deep, so the full and empty 
                            flag allow its level to be ascertained.</description>
                        <bitRange>[2:2]</bitRange>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>FIFO_EMPTY</name>
                        <description>When 1, indicates the XIP streaming FIFO is completely empty.</description>
                        <bitRange>[1:1]</bitRange>
                        <access>read-only</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTR_HIT</name>
                <addressOffset>0x0000000c</addressOffset>
                <description>Cache Hit counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTR_HIT</name>
                        <description>A 32 bit saturating counter that increments upon each cache hit, 
                            i.e. when an XIP access is serviced directly from cached data. 
                            Write any value to clear.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>CTR_ACC</name>
                <addressOffset>0x00000010</addressOffset>
                <description>Cache Access counter</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>CTR_ACC</name>
                        <description>A 32 bit saturating counter that increments upon each XIP access, 
                            whether the cache is hit or not. This includes noncacheable accesses. 
                            Write any value to clear.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-write</access>
                        <modifiedWriteValues>oneToClear</modifiedWriteValues>
                    </field>
                </fields>
            </register>
            <register>
                <name>STREAM_ADDR</name>
                <addressOffset>0x00000014</addressOffset>
                <description>FIFO stream address</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STREAM_ADDR</name>
                        <description>The address of the next word to be streamed from flash to the streaming FIFO. 
                            Increments automatically after each flash access. 
                            Write the initial access address here before starting a streaming read.</description>
                        <bitRange>[31:2]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>STREAM_CTR</name>
                <addressOffset>0x00000018</addressOffset>
                <description>FIFO stream control</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STREAM_CTR</name>
                        <description>Write a nonzero value to start a streaming read. This will then 
                            progress in the background, using flash idle cycles to transfer 
                            a linear data block from flash to the streaming FIFO. 
                            Decrements automatically (1 at a time) as the stream 
                            progresses, and halts on reaching 0. 
                            Write 0 to halt an in-progress stream, and discard any in-flight 
                            read, so that a new stream can immediately be started (after 
                            draining the FIFO and reinitialising STREAM_ADDR)</description>
                        <bitRange>[21:0]</bitRange>
                        <access>read-write</access>
                    </field>
                </fields>
            </register>
            <register>
                <name>STREAM_FIFO</name>
                <addressOffset>0x0000001c</addressOffset>
                <description>FIFO stream data</description>
                <resetValue>0x00000000</resetValue>
                <fields>
                    <field>
                        <name>STREAM_FIFO</name>
                        <description>Streamed data is buffered here, for retrieval by the system DMA. 
                            This FIFO can also be accessed via the XIP_AUX slave, to avoid exposing 
                            the DMA to bus stalls caused by other XIP traffic.</description>
                        <bitRange>[31:0]</bitRange>
                        <access>read-only</access>
                        <readAction>modify</readAction>
                    </field>
                </fields>
            </register>
